levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
    INT_SRC_USART3_TCI           = 335U,     /* USART_3_TCI */
    INT_SRC_USART4_EI            = 336U,     /* USART_4_EI */
    INT_SRC_USART4_RI            = 337U,     /* USART_4_RI */
    INT_SRC_USART4_TI            = 338U,     /* USART_4_TI */
    INT_SRC_USART4_TCI           = 339U,     /* USART_4_TCI */
    /* CAN1 CAN2 */
    INT_SRC_CAN1_HOST            = 340U,     /* CAN_1_HOST */
    INT_SRC_CAN2_HOST            = 341U,     /* CAN_2_HOST */
    /* SPI3 SPI4 */
    INT_SRC_SPI3_SPRI            = 342U,     /* SPI_3_SPRI */
    INT_SRC_SPI3_SPTI            = 343U,     /* SPI_3_SPTI */
    INT_SRC_SPI3_SPII            = 344U,     /* SPI_3_SPII */
    INT_SRC_SPI3_SPEI            = 345U,     /* SPI_3_SPEI */
    INT_SRC_SPI4_SPRI            = 347U,     /* SPI_4_SPRI */
    INT_SRC_SPI4_SPTI            = 348U,     /* SPI_4_SPTI */
    INT_SRC_SPI4_SPII            = 349U,     /* SPI_4_SPII */
    INT_SRC_SPI4_SPEI            = 350U,     /* SPI_4_SPEI */
    /* TIMERA_9 TIMERA_10 TIMER_11 TIMER_12 */
    INT_SRC_TMRA_9_OVF           = 352U,     /* TMRA_9_OVF */
    INT_SRC_TMRA_9_UDF           = 353U,     /* TMRA_9_UDF */
    INT_SRC_TMRA_9_CMP           = 354U,     /* TMRA_9_CMP */
    INT_SRC_TMRA_10_OVF          = 355U,     /* TMRA_10_OVF */
    INT_SRC_TMRA_10_UDF          = 356U,     /* TMRA_10_UDF */
    INT_SRC_TMRA_10_CMP          = 357U,     /* TMRA_10_CMP */
    INT_SRC_TMRA_11_OVF          = 358U,     /* TMRA_11_OVF */
    INT_SRC_TMRA_11_UDF          = 359U,     /* TMRA_11_UDF */
    INT_SRC_TMRA_11_CMP          = 360U,     /* TMRA_11_CMP */
    INT_SRC_TMRA_12_OVF          = 361U,     /* TMRA_12_OVF */
    INT_SRC_TMRA_12_UDF          = 362U,     /* TMRA_12_UDF */
    INT_SRC_TMRA_12_CMP          = 363U,     /* TMRA_12_CMP */
    /* USART5 USART6 */
    INT_SRC_USART5_BRKWKPI       = 364U,     /* USART_5_BRKWKPI */
    INT_SRC_USART5_EI            = 365U,     /* USART_5_EI */
    INT_SRC_USART5_RI            = 366U,     /* USART_5_RI */
    INT_SRC_USART5_TI            = 367U,     /* USART_5_TI */
    INT_SRC_USART5_TCI           = 368U,     /* USART_5_TCI */
    INT_SRC_USART6_EI            = 369U,     /* USART_6_EI */
    INT_SRC_USART6_RI            = 370U,     /* USART_6_RI */
    INT_SRC_USART6_TI            = 371U,     /* USART_6_TI */
    INT_SRC_USART6_TCI           = 372U,     /* USART_6_TCI */
    INT_SRC_USART6_RTO           = 373U,     /* USART_6_RTO */
    /* SPI5 SPI6 */
    INT_SRC_SPI5_SPRI            = 374U,     /* SPI_5_SPRI */
    INT_SRC_SPI5_SPTI            = 375U,     /* SPI_5_SPTI */
    INT_SRC_SPI5_SPII            = 376U,     /* SPI_5_SPII */
    INT_SRC_SPI5_SPEI            = 377U,     /* SPI_5_SPEI */
    INT_SRC_SPI6_SPRI            = 379U,     /* SPI_6_SPRI */
    INT_SRC_SPI6_SPTI            = 380U,     /* SPI_6_SPTI */
    INT_SRC_SPI6_SPII            = 381U,     /* SPI_6_SPII */
    INT_SRC_SPI6_SPEI            = 382U,     /* SPI_6_SPEI */
    /* I2S1 I2S2 */
    INT_SRC_I2S1_TXIRQOUT        = 384U,     /* I2S_1_TXIRQOUT */
    INT_SRC_I2S1_RXIRQOUT        = 385U,     /* I2S_1_RXIRQOUT */
    INT_SRC_I2S1_ERRIRQOUT       = 386U,     /* I2S_1_ERRIRQOUT */
    INT_SRC_I2S2_TXIRQOUT        = 387U,     /* I2S_2_TXIRQOUT */
    INT_SRC_I2S2_RXIRQOUT        = 388U,     /* I2S_2_RXIRQOUT */
    INT_SRC_I2S2_ERRIRQOUT       = 389U,     /* I2S_2_ERRIRQOUT */
    /* USART7 USART8 */
    INT_SRC_USART7_EI            = 390U,     /* USART_7_EI */
    INT_SRC_USART7_RI            = 391U,     /* USART_7_RI */
    INT_SRC_USART7_TI            = 392U,     /* USART_7_TI */
    INT_SRC_USART7_TCI           = 393U,     /* USART_7_TCI */
    INT_SRC_USART7_RTO           = 394U,     /* USART_7_RTO */
    INT_SRC_USART8_EI            = 395U,     /* USART_8_EI */
    INT_SRC_USART8_RI            = 396U,     /* USART_8_RI */
    INT_SRC_USART8_TI            = 397U,     /* USART_8_TI */
    INT_SRC_USART8_TCI           = 398U,     /* USART_8_TCI */
    /* USBFS */
    INT_SRC_USBFS_GLB            = 399U,     /* USBFS_GLB */
    INT_SRC_USBFS_WKUP           = 400U,     /* USBFS_WKUP */
    /* HASH */
    INT_SRC_HASH                 = 401U,     /* HASH_INT */
    /* SDIOC */
    INT_SRC_SDIOC1_SD            = 404U,     /* SDIOC_1_SD */
    INT_SRC_SDIOC2_SD            = 407U,     /* SDIOC_2_SD */
    /* EVENT PORT */
    INT_SRC_EVENT_PORT1          = 408U,     /* EVENT_PORT1 */
    INT_SRC_EVENT_PORT2          = 409U,     /* EVENT_PORT2 */
    INT_SRC_EVENT_PORT3          = 410U,     /* EVENT_PORT3 */
    INT_SRC_EVENT_PORT4          = 411U,     /* EVENT_PORT4 */
    /* ETHER */
    INT_SRC_ETH_GLB_INT          = 412U,     /* ETH_GLB_INT */
    INT_SRC_ETH_WKP_INT          = 413U,     /* ETH_WKP_INT */
    /* I2S3 I2S4 */
    INT_SRC_I2S3_TXIRQOUT        = 416U,     /* I2S_3_TXIRQOUT */
    INT_SRC_I2S3_RXIRQOUT        = 417U,     /* I2S_3_RXIRQOUT */
    INT_SRC_I2S3_ERRIRQOUT       = 418U,     /* I2S_3_ERRIRQOUT */
    INT_SRC_I2S4_TXIRQOUT        = 419U,     /* I2S_4_TXIRQOUT */
    INT_SRC_I2S4_RXIRQOUT        = 420U,     /* I2S_4_RXIRQOUT */
    INT_SRC_I2S4_ERRIRQOUT       = 421U,     /* I2S_4_ERRIRQOUT */
    /* USART9 USART10 */
    INT_SRC_USART9_EI            = 422U,     /* USART_9_EI */
    INT_SRC_USART9_RI            = 423U,     /* USART_9_RI */
    INT_SRC_USART9_TI            = 424U,     /* USART_9_TI */
    INT_SRC_USART9_TCI           = 425U,     /* USART_9_TCI */
    INT_SRC_USART10_BRKWKPI      = 426U,     /* USART_10_BRKWKPI */
    INT_SRC_USART10_EI           = 427U,     /* USART_10_EI */
    INT_SRC_USART10_RI           = 428U,     /* USART_10_RI */
    INT_SRC_USART10_TI           = 429U,     /* USART_10_TI */
    INT_SRC_USART10_TCI          = 430U,     /* USART_10_TCI */
    /* SKE */
    INT_SRC_SKE                  = 431U,     /* SKE */
    /* I2C1 I2C2 I2C3 */
    INT_SRC_I2C1_RXI             = 432U,     /* I2C_1_RXI */
    INT_SRC_I2C1_TXI             = 433U,     /* I2C_1_TXI */
    INT_SRC_I2C1_TEI             = 434U,     /* I2C_1_TEI */
    INT_SRC_I2C1_EEI             = 435U,     /* I2C_1_EEI */
    INT_SRC_I2C2_RXI             = 436U,     /* I2C_2_RXI */
    INT_SRC_I2C2_TXI             = 437U,     /* I2C_2_TXI */
    INT_SRC_I2C2_TEI             = 438U,     /* I2C_2_TEI */
    INT_SRC_I2C2_EEI             = 439U,     /* I2C_2_EEI */
    INT_SRC_I2C3_RXI             = 440U,     /* I2C_3_RXI */
    INT_SRC_I2C3_TXI             = 441U,     /* I2C_3_TXI */
    INT_SRC_I2C3_TEI             = 442U,     /* I2C_3_TEI */
    INT_SRC_I2C3_EEI             = 443U,     /* I2C_3_EEI */
    /* ACMP */
    INT_SRC_CMP1                 = 444U,     /* CMP1 */
    INT_SRC_CMP2                 = 445U,     /* CMP2 */
    INT_SRC_CMP3                 = 446U,     /* CMP3 */
    INT_SRC_CMP4                 = 447U,     /* CMP4 */
    /* I2C4 I2C5 I2C6 */
    INT_SRC_I2C4_RXI             = 448U,     /* I2C_4_RXI */
    INT_SRC_I2C4_TXI             = 449U,     /* I2C_4_TXI */
    INT_SRC_I2C4_TEI             = 450U,     /* I2C_4_TEI */
    INT_SRC_I2C4_EEI             = 451U,     /* I2C_4_EEI */
    INT_SRC_I2C5_RXI             = 452U,     /* I2C_5_RXI */
    INT_SRC_I2C5_TXI             = 453U,     /* I2C_5_TXI */
    INT_SRC_I2C5_TEI             = 454U,     /* I2C_5_TEI */
    INT_SRC_I2C5_EEI             = 455U,     /* I2C_5_EEI */
    INT_SRC_I2C6_RXI             = 456U,     /* I2C_6_RXI */
    INT_SRC_I2C6_TXI             = 457U,     /* I2C_6_TXI */
    INT_SRC_I2C6_TEI             = 458U,     /* I2C_6_TEI */
    INT_SRC_I2C6_EEI             = 459U,     /* I2C_6_EEI */
    /* USART1 */
    INT_SRC_USART1_WUPI          = 460U,     /* USART_1_WUPI */
    /* LVD */
    INT_SRC_LVD1                 = 461U,     /* LVD1 */
    INT_SRC_LVD2                 = 462U,     /* LVD2 */
    /* OTS */
    INT_SRC_OTS                  = 463U,     /* OTS */
    /* FCM */
    INT_SRC_FCMFERRI             = 464U,     /* FCMFERRI */
    INT_SRC_FCMMENDI             = 465U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI             = 466U,     /* FCMCOVFI */
    /* WDT */
    INT_SRC_WDT_REFUDF           = 467U,     /* WDT_REFUDF */
    /* CTC */
    INT_SRC_CTC_ERR              = 468U,     /* CTC_ERR */
    /* ERMU */
    INT_SRC_ERMU_LPI             = 469U,     /* ERMU_LPI */
    /* USART */
    INT_SRC_USART1_TENDI         = 470U,     /* USART_1_TENDI */
    INT_SRC_USART2_TENDI         = 471U,     /* USART_2_TENDI */
    INT_SRC_USART3_TENDI         = 472U,     /* USART_3_TENDI */
    INT_SRC_USART4_TENDI         = 473U,     /* USART_4_TENDI */
    INT_SRC_USART5_TENDI         = 474U,     /* USART_5_TENDI */
    INT_SRC_USART6_TENDI         = 475U,     /* USART_6_TENDI */
    INT_SRC_USART7_TENDI         = 476U,     /* USART_7_TENDI */
    INT_SRC_USART8_TENDI         = 477U,     /* USART_8_TENDI */
    INT_SRC_USART9_TENDI         = 478U,     /* USART_9_TENDI */
    INT_SRC_USART10_TENDI        = 479U,     /* USART_10_TENDI */
    /* ADC */
    INT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    INT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    INT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    INT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    INT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    INT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    INT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    INT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    INT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    INT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    INT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    INT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /* TRNG */
    INT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    /* CANRAM */
    INT_SRC_CAN1RAM_ECCER        = 493U,     /* CAN1RAM_ECCER */
    INT_SRC_CAN2RAM_ECCER        = 494U,     /* CAN2RAM_ECCER */
    INT_SRC_MCANRAM_ECCER        = 495U,     /* MCANRAM_ECCER */
    /* NFC */
    INT_SRC_NFC_INT              = 496U,     /* NFC_INT */
    /* MCAN1 MCAN2 */
    INT_SRC_MCAN1_INT0           = 497U,     /* MCAN1_INT0 */
    INT_SRC_MCAN1_INT1           = 498U,     /* MCAN1_INT1 */
    INT_SRC_MCAN2_INT0           = 499U,     /* MCAN2_INT0 */
    INT_SRC_MCAN2_INT1           = 500U,     /* MCAN2_INT1 */
    /* I2S */
    INT_SRC_I2S1_TXENDIRQOUT     = 501U,     /* I2S1_TXENDIRQOUT */
    INT_SRC_I2S1_RXENDIRQOUT     = 502U,     /* I2S1_RXENDIRQOUT */
    INT_SRC_I2S2_TXENDIRQOUT     = 503U,     /* I2S2_TXENDIRQOUT */
    INT_SRC_I2S2_RXENDIRQOUT     = 504U,     /* I2S2_RXENDIRQOUT */
    INT_SRC_I2S3_TXENDIRQOUT     = 505U,     /* I2S3_TXENDIRQOUT */
    INT_SRC_I2S3_RXENDIRQOUT     = 506U,     /* I2S3_RXENDIRQOUT */
    INT_SRC_I2S4_TXENDIRQOUT     = 507U,     /* I2S4_TXENDIRQOUT */
    INT_SRC_I2S4_RXENDIRQOUT     = 508U,     /* I2S4_RXENDIRQOUT */
    INT_SRC_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

/**
 * @brief ADC
 */
typedef struct {
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    __IO uint16_t CR2;
    uint8_t RESERVED1[2];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    __IO uint32_t AVCHSELR;
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED2[1];
    __IO uint16_t SHCR;
    uint8_t RESERVED3[4];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    __IO uint8_t  SSTR10;
    __IO uint8_t  SSTR11;
    __IO uint8_t  SSTR12;
    __IO uint8_t  SSTR13;
    __IO uint8_t  SSTR14;
    __IO uint8_t  SSTR15;
    __IO uint8_t  SSTRL;
    uint8_t RESERVED4[7];
    __IO uint16_t CHMUXR0;
    __IO uint16_t CHMUXR1;
    __IO uint16_t CHMUXR2;
    __IO uint16_t CHMUXR3;
    uint8_t RESERVED5[4];
    __I  uint8_t  ISR;
    __IO uint8_t  ICR;
    __IO uint8_t  ISCLRR;
    uint8_t RESERVED6[5];
    __IO uint16_t SYNCCR;
    uint8_t RESERVED7[2];
    __I  uint16_t DR0;
    __I  uint16_t DR1;
    __I  uint16_t DR2;
    __I  uint16_t DR3;
    __I  uint16_t DR4;
    __I  uint16_t DR5;
    __I  uint16_t DR6;
    __I  uint16_t DR7;
    __I  uint16_t DR8;
    __I  uint16_t DR9;
    __I  uint16_t DR10;
    __I  uint16_t DR11;
    __I  uint16_t DR12;
    __I  uint16_t DR13;
    __I  uint16_t DR14;
    __I  uint16_t DR15;
    __I  uint16_t DR16;
    __I  uint16_t DR17;
    __I  uint16_t DR18;
    __I  uint16_t DR19;
    uint8_t RESERVED8[40];
    __IO uint16_t AWDCR;
    __I  uint8_t  AWDSR;
    __IO uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint8_t  AWD0CHSR;
    uint8_t RESERVED9[3];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint8_t  AWD1CHSR;
    uint8_t RESERVED10[15];
    __IO uint8_t  PGACR1;
    __IO uint8_t  PGACR2;
    __IO uint8_t  PGACR3;
    uint8_t RESERVED11[1];
    __IO uint8_t  PGAVSSENR;
} CM_ADC_TypeDef;

/**
 * @brief AOS
 */
typedef struct {
    __O  uint32_t INTSFTTRG;
    __IO uint32_t DCU_TRGSEL1;
    __IO uint32_t DCU_TRGSEL2;
    __IO uint32_t DCU_TRGSEL3;
    __IO uint32_t DCU_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL0;
    __IO uint32_t DMA1_TRGSEL1;
    __IO uint32_t DMA1_TRGSEL2;
    __IO uint32_t DMA1_TRGSEL3;
    __IO uint32_t DMA1_TRGSEL4;
    __IO uint32_t DMA1_TRGSEL5;
    __IO uint32_t DMA1_TRGSEL6;
    __IO uint32_t DMA1_TRGSEL7;
    __IO uint32_t DMA2_TRGSEL0;
    __IO uint32_t DMA2_TRGSEL1;
    __IO uint32_t DMA2_TRGSEL2;
    __IO uint32_t DMA2_TRGSEL3;
    __IO uint32_t DMA2_TRGSEL4;
    __IO uint32_t DMA2_TRGSEL5;
    __IO uint32_t DMA2_TRGSEL6;
    __IO uint32_t DMA2_TRGSEL7;
    __IO uint32_t DMA_RC_TRGSEL;
    __IO uint32_t TMR6_TRGSEL0;
    __IO uint32_t TMR6_TRGSEL1;
    __IO uint32_t TMR6_TRGSEL2;
    __IO uint32_t TMR6_TRGSEL3;
    __IO uint32_t PEVNT_TRGSEL12;
    __IO uint32_t PEVNT_TRGSEL34;
    __IO uint32_t TMR0_TRGSEL;
    __IO uint32_t TMR2_TRGSEL;
    __IO uint32_t HASH_TRGSELB;
    __IO uint32_t HASH_TRGSELA;
    __IO uint32_t TMRA_TRGSEL0;
    __IO uint32_t TMRA_TRGSEL1;
    __IO uint32_t TMRA_TRGSEL2;
    __IO uint32_t TMRA_TRGSEL3;
    __IO uint32_t OTS_TRGSEL;
    __IO uint32_t ADC1_TRGSEL0;
    __IO uint32_t ADC1_TRGSEL1;
    __IO uint32_t ADC2_TRGSEL0;
    __IO uint32_t ADC2_TRGSEL1;
    __IO uint32_t ADC3_TRGSEL0;
    __IO uint32_t ADC3_TRGSEL1;
    __IO uint32_t COMTRGSEL1;
    __IO uint32_t COMTRGSEL2;
    uint8_t RESERVED0[76];
    __IO uint32_t PEVNTDIRR1;
    __I  uint32_t PEVNTIDR1;
    __IO uint32_t PEVNTODR1;
    __IO uint32_t PEVNTORR1;
    __IO uint32_t PEVNTOSR1;
    __IO uint32_t PEVNTRISR1;
    __IO uint32_t PEVNTFALR1;
    __IO uint32_t PEVNTDIRR2;
    __I  uint32_t PEVNTIDR2;
    __IO uint32_t PEVNTODR2;
    __IO uint32_t PEVNTORR2;
    __IO uint32_t PEVNTOSR2;
    __IO uint32_t PEVNTRISR2;
    __IO uint32_t PEVNTFALR2;
    __IO uint32_t PEVNTDIRR3;
    __I  uint32_t PEVNTIDR3;
    __IO uint32_t PEVNTODR3;
    __IO uint32_t PEVNTORR3;
    __IO uint32_t PEVNTOSR3;
    __IO uint32_t PEVNTRISR3;
    __IO uint32_t PEVNTFALR3;
    __IO uint32_t PEVNTDIRR4;
    __I  uint32_t PEVNTIDR4;
    __IO uint32_t PEVNTODR4;
    __IO uint32_t PEVNTORR4;
    __IO uint32_t PEVNTOSR4;
    __IO uint32_t PEVNTRISR4;
    __IO uint32_t PEVNTFALR4;
    __IO uint32_t PEVNTNFCR;
    uint8_t RESERVED1[140];
    __IO uint32_t PLU0_CR;
    __IO uint32_t PLU1_CR;
    __IO uint32_t PLU2_CR;
    __IO uint32_t PLU3_CR;
    __IO uint32_t PLU0_TRGSELA;
    __IO uint32_t PLU0_TRGSELB;
    __IO uint32_t PLU0_TRGSELC;
    __IO uint32_t PLU0_TRGSELD;
    __IO uint32_t PLU1_TRGSELA;
    __IO uint32_t PLU1_TRGSELB;
    __IO uint32_t PLU1_TRGSELC;
    __IO uint32_t PLU1_TRGSELD;
    __IO uint32_t PLU2_TRGSELA;
    __IO uint32_t PLU2_TRGSELB;
    __IO uint32_t PLU2_TRGSELC;
    __IO uint32_t PLU2_TRGSELD;
    __IO uint32_t PLU3_TRGSELA;
    __IO uint32_t PLU3_TRGSELB;
    __IO uint32_t PLU3_TRGSELC;
    __IO uint32_t PLU3_TRGSELD;
} CM_AOS_TypeDef;

/**
 * @brief CAN
 */
typedef struct {
    __I  uint32_t RBUF;
    uint8_t RESERVED0[76];
    __IO uint32_t TBUF;
    uint8_t RESERVED1[76];
    __IO uint8_t  CFG_STAT;
    __IO uint8_t  TCMD;
    __IO uint8_t  TCTRL;
    __IO uint8_t  RCTRL;
    __IO uint8_t  RTIE;
    __IO uint8_t  RTIF;
    __IO uint8_t  ERRINT;
    __IO uint8_t  LIMIT;
    __IO uint32_t SBT;
    __IO uint32_t FBT;
    __I  uint8_t  EALCAP;
    __IO uint8_t  TDC;
    __IO uint8_t  RECNT;
    __IO uint8_t  TECNT;
    __IO uint8_t  ACFCTRL;
    uint8_t RESERVED2[1];
    __IO uint16_t ACFEN;
    __IO uint32_t ACF;
    uint8_t RESERVED3[2];
    __IO uint8_t  TBSLOT;
    __IO uint8_t  TTCFG;
    __IO uint32_t REF_MSG;
    __IO uint16_t TRG_CFG;
    __IO uint16_t TT_TRIG;
    __IO uint16_t TT_WTRIG;
    uint8_t RESERVED4[54];
    __IO uint32_t RAM_CKCR;
    __IO uint32_t RAM_CKSR;
    __IO uint32_t RAM_EIEN;
    __IO uint32_t RAM_EIBIT0;
    __IO uint32_t RAM_EIBIT1;
    __I  uint32_t RAM_ECCERRADDR;
} CM_CAN_TypeDef;

/**
 * @brief CMP
 */
typedef struct {
    __IO uint8_t  MDR;
    __IO uint8_t  FIR;
    __IO uint8_t  OCR;
    __IO uint8_t  PMSR;
    __IO uint16_t BWSR;
    __IO uint16_t BWPR;
    __IO uint16_t VISR;
} CM_CMP_TypeDef;

/**
 * @brief CMU
 */
typedef struct {
    uint8_t RESERVED0[24];
    __IO uint32_t XTALDIVR;
    __IO uint32_t XTALDIVCR;
    uint8_t RESERVED1[17376];
    __IO uint8_t  XTAL32CR;
    uint8_t RESERVED2[3];
    __IO uint8_t  XTAL32CFGR;
    uint8_t RESERVED3[15];
    __IO uint8_t  XTAL32NFR;
    uint8_t RESERVED4[7];
    __IO uint8_t  LRCCR;
    uint8_t RESERVED5[7];
    __IO uint8_t  LRCTRM;
    uint8_t RESERVED6[7];
    __IO uint8_t  RTCLRCTRM;
    uint8_t RESERVED7[2123];
    __IO uint8_t  XTALCFGR;
    uint8_t RESERVED8[29591];
    __IO uint16_t PERICKSEL;
    __IO uint16_t I2SCKSEL;
    uint8_t RESERVED9[4];
    __IO uint16_t CANCKCFGR;
    uint8_t RESERVED10[6];
    __IO uint32_t SCFGR;
    __IO uint8_t  USBCKCFGR;
    uint8_t RESERVED11[1];
    __IO uint8_t  CKSWR;
    uint8_t RESERVED12[3];
    __IO uint8_t  PLLHCR;
    uint8_t RESERVED13[3];
    __IO uint8_t  PLLACR;
    uint8_t RESERVED14[3];
    __IO uint8_t  XTALCR;
    uint8_t RESERVED15[3];
    __IO uint8_t  HRCCR;
    uint8_t RESERVED16[1];
    __IO uint8_t  MRCCR;
    uint8_t RESERVED17[3];
    __IO uint8_t  OSCSTBSR;
    __IO uint8_t  MCO1CFGR;
    __IO uint8_t  MCO2CFGR;
    __IO uint8_t  TPIUCKCFGR;
    __IO uint8_t  XTALSTDCR;
    __IO uint8_t  XTALSTDSR;
    uint8_t RESERVED18[31];
    __IO uint8_t  MRCTRM;
    __IO uint8_t  HRCTRM;
    uint8_t RESERVED19[63];
    __IO uint8_t  XTALSTBCR;
    uint8_t RESERVED20[93];
    __IO uint32_t PLLHCFGR;
    __IO uint32_t PLLACFGR;
} CM_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t RESLT1;
    __IO uint32_t RESLT2;
    uint8_t RESERVED0[116];
    __O  uint32_t DAT0;
    __O  uint32_t DAT1;
    __O  uint32_t DAT2;
    __O  uint32_t DAT3;
    __O  uint32_t DAT4;
    __O  uint32_t DAT5;
    __O  uint32_t DAT6;
    __O  uint32_t DAT7;
    __O  uint32_t DAT8;
    __O  uint32_t DAT9;
    __O  uint32_t DAT10;
    __O  uint32_t DAT11;
    __O  uint32_t DAT12;
    __O  uint32_t DAT13;
    __O  uint32_t DAT14;
    __O  uint32_t DAT15;
    __O  uint32_t DAT16;
    __O  uint32_t DAT17;
    __O  uint32_t DAT18;
    __O  uint32_t DAT19;
    __O  uint32_t DAT20;
    __O  uint32_t DAT21;
    __O  uint32_t DAT22;
    __O  uint32_t DAT23;
    __O  uint32_t DAT24;
    __O  uint32_t DAT25;
    __O  uint32_t DAT26;
    __O  uint32_t DAT27;
    __O  uint32_t DAT28;
    __O  uint32_t DAT29;
    __O  uint32_t DAT30;
    __O  uint32_t DAT31;
} CM_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __I  uint32_t STR;
} CM_CTC_TypeDef;

/**
 * @brief DAC
 */
typedef struct {
    __IO uint16_t DADR1;
    __IO uint16_t DADR2;
    __IO uint16_t DACR;
    __IO uint16_t DAADPCR;
    uint8_t RESERVED0[20];
    __IO uint16_t DAOCR;
} CM_DAC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct {
    uint8_t RESERVED0[12];
    __I  uint32_t CHIPID;
    uint8_t RESERVED1[12];
    __IO uint32_t MCUDBGCSTAT;
    __IO uint32_t MCUSTPCTL;
    __IO uint32_t MCUTRACECTL;
    __IO uint32_t MCUSTPCTL2;
} CM_DBGC_TypeDef;

/**
 * @brief DCU
 */
typedef struct {
    __IO uint32_t CTL;
    __I  uint32_t FLAG;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    __O  uint32_t FLAGCLR;
    __IO uint32_t INTEVTSEL;
} CM_DCU_TypeDef;

