levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/**
 * @brief HASH
 */
typedef struct {
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t HR7;
    __IO uint32_t HR6;
    __IO uint32_t HR5;
    __IO uint32_t HR4;
    __IO uint32_t HR3;
    __IO uint32_t HR2;
    __IO uint32_t HR1;
    __IO uint32_t HR0;
    uint8_t RESERVED1[16];
    __IO uint32_t DR15;
    __IO uint32_t DR14;
    __IO uint32_t DR13;
    __IO uint32_t DR12;
    __IO uint32_t DR11;
    __IO uint32_t DR10;
    __IO uint32_t DR9;
    __IO uint32_t DR8;
    __IO uint32_t DR7;
    __IO uint32_t DR6;
    __IO uint32_t DR5;
    __IO uint32_t DR4;
    __IO uint32_t DR3;
    __IO uint32_t DR2;
    __IO uint32_t DR1;
    __IO uint32_t DR0;
} CM_HASH_TypeDef;

/**
 * @brief I2C
 */
typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t CR4;
    __IO uint32_t SLR0;
    __IO uint32_t SLR1;
    __IO uint32_t SLTR;
    __IO uint32_t SR;
    __O  uint32_t CLR;
    __IO uint8_t  DTR;
    uint8_t RESERVED0[3];
    __I  uint8_t  DRR;
    uint8_t RESERVED1[3];
    __IO uint32_t CCR;
    __IO uint32_t FLTR;
    __IO uint32_t FSTR;
    __IO uint32_t SLVADDR;
} CM_I2C_TypeDef;

/**
 * @brief I2S
 */
typedef struct {
    __IO uint32_t CTRL;
    __I  uint32_t SR;
    __IO uint32_t ER;
    __IO uint32_t CFGR;
    __O  uint32_t TXBUF;
    __I  uint32_t RXBUF;
    __IO uint32_t PR;
} CM_I2S_TypeDef;

/**
 * @brief ICG
 */
typedef struct {
    __I  uint32_t ICG0;
    __I  uint32_t ICG1;
    uint8_t RESERVED0[4];
    __I  uint32_t ICG3;
    uint8_t RESERVED1[80];
    __I  uint32_t ICG8A;
    __I  uint32_t ICG8B;
    __I  uint32_t ICG8C;
} CM_ICG_TypeDef;

/**
 * @brief INTC
 */
typedef struct {
    __IO uint32_t NOCCR;
    __IO uint32_t NMIER;
    __IO uint32_t NMIFR;
    __IO uint32_t NMIFCR;
    __IO uint32_t EIRQCR0;
    __IO uint32_t EIRQCR1;
    __IO uint32_t EIRQCR2;
    __IO uint32_t EIRQCR3;
    __IO uint32_t EIRQCR4;
    __IO uint32_t EIRQCR5;
    __IO uint32_t EIRQCR6;
    __IO uint32_t EIRQCR7;
    __IO uint32_t EIRQCR8;
    __IO uint32_t EIRQCR9;
    __IO uint32_t EIRQCR10;
    __IO uint32_t EIRQCR11;
    __IO uint32_t EIRQCR12;
    __IO uint32_t EIRQCR13;
    __IO uint32_t EIRQCR14;
    __IO uint32_t EIRQCR15;
    __IO uint32_t WKEN;
    __IO uint32_t EIFR;
    __IO uint32_t EIFCR;
    __IO uint32_t INTSEL0;
    __IO uint32_t INTSEL1;
    __IO uint32_t INTSEL2;
    __IO uint32_t INTSEL3;
    __IO uint32_t INTSEL4;
    __IO uint32_t INTSEL5;
    __IO uint32_t INTSEL6;
    __IO uint32_t INTSEL7;
    __IO uint32_t INTSEL8;
    __IO uint32_t INTSEL9;
    __IO uint32_t INTSEL10;
    __IO uint32_t INTSEL11;
    __IO uint32_t INTSEL12;
    __IO uint32_t INTSEL13;
    __IO uint32_t INTSEL14;
    __IO uint32_t INTSEL15;
    __IO uint32_t INTSEL16;
    __IO uint32_t INTSEL17;
    __IO uint32_t INTSEL18;
    __IO uint32_t INTSEL19;
    __IO uint32_t INTSEL20;
    __IO uint32_t INTSEL21;
    __IO uint32_t INTSEL22;
    __IO uint32_t INTSEL23;
    __IO uint32_t INTSEL24;
    __IO uint32_t INTSEL25;
    __IO uint32_t INTSEL26;
    __IO uint32_t INTSEL27;
    __IO uint32_t INTSEL28;
    __IO uint32_t INTSEL29;
    __IO uint32_t INTSEL30;
    __IO uint32_t INTSEL31;
    __IO uint32_t INTSEL32;
    __IO uint32_t INTSEL33;
    __IO uint32_t INTSEL34;
    __IO uint32_t INTSEL35;
    __IO uint32_t INTSEL36;
    __IO uint32_t INTSEL37;
    __IO uint32_t INTSEL38;
    __IO uint32_t INTSEL39;
    __IO uint32_t INTSEL40;
    __IO uint32_t INTSEL41;
    __IO uint32_t INTSEL42;
    __IO uint32_t INTSEL43;
    __IO uint32_t INTSEL44;
    __IO uint32_t INTSEL45;
    __IO uint32_t INTSEL46;
    __IO uint32_t INTSEL47;
    __IO uint32_t INTSEL48;
    __IO uint32_t INTSEL49;
    __IO uint32_t INTSEL50;
    __IO uint32_t INTSEL51;
    __IO uint32_t INTSEL52;
    __IO uint32_t INTSEL53;
    __IO uint32_t INTSEL54;
    __IO uint32_t INTSEL55;
    __IO uint32_t INTSEL56;
    __IO uint32_t INTSEL57;
    __IO uint32_t INTSEL58;
    __IO uint32_t INTSEL59;
    __IO uint32_t INTSEL60;
    __IO uint32_t INTSEL61;
    __IO uint32_t INTSEL62;
    __IO uint32_t INTSEL63;
    __IO uint32_t INTSEL64;
    __IO uint32_t INTSEL65;
    __IO uint32_t INTSEL66;
    __IO uint32_t INTSEL67;
    __IO uint32_t INTSEL68;
    __IO uint32_t INTSEL69;
    __IO uint32_t INTSEL70;
    __IO uint32_t INTSEL71;
    __IO uint32_t INTSEL72;
    __IO uint32_t INTSEL73;
    __IO uint32_t INTSEL74;
    __IO uint32_t INTSEL75;
    __IO uint32_t INTSEL76;
    __IO uint32_t INTSEL77;
    __IO uint32_t INTSEL78;
    __IO uint32_t INTSEL79;
    __IO uint32_t INTSEL80;
    __IO uint32_t INTSEL81;
    __IO uint32_t INTSEL82;
    __IO uint32_t INTSEL83;
    __IO uint32_t INTSEL84;
    __IO uint32_t INTSEL85;
    __IO uint32_t INTSEL86;
    __IO uint32_t INTSEL87;
    __IO uint32_t INTSEL88;
    __IO uint32_t INTSEL89;
    __IO uint32_t INTSEL90;
    __IO uint32_t INTSEL91;
    __IO uint32_t INTSEL92;
    __IO uint32_t INTSEL93;
    __IO uint32_t INTSEL94;
    __IO uint32_t INTSEL95;
    __IO uint32_t INTSEL96;
    __IO uint32_t INTSEL97;
    __IO uint32_t INTSEL98;
    __IO uint32_t INTSEL99;
    __IO uint32_t INTSEL100;
    __IO uint32_t INTSEL101;
    __IO uint32_t INTSEL102;
    __IO uint32_t INTSEL103;
    __IO uint32_t INTSEL104;
    __IO uint32_t INTSEL105;
    __IO uint32_t INTSEL106;
    __IO uint32_t INTSEL107;
    __IO uint32_t INTSEL108;
    __IO uint32_t INTSEL109;
    __IO uint32_t INTSEL110;
    __IO uint32_t INTSEL111;
    __IO uint32_t INTSEL112;
    __IO uint32_t INTSEL113;
    __IO uint32_t INTSEL114;
    __IO uint32_t INTSEL115;
    __IO uint32_t INTSEL116;
    __IO uint32_t INTSEL117;
    __IO uint32_t INTSEL118;
    __IO uint32_t INTSEL119;
    __IO uint32_t INTSEL120;
    __IO uint32_t INTSEL121;
    __IO uint32_t INTSEL122;
    __IO uint32_t INTSEL123;
    __IO uint32_t INTSEL124;
    __IO uint32_t INTSEL125;
    __IO uint32_t INTSEL126;
    __IO uint32_t INTSEL127;
    __IO uint32_t VSSEL128;
    __IO uint32_t VSSEL129;
    __IO uint32_t VSSEL130;
    __IO uint32_t VSSEL131;
    __IO uint32_t VSSEL132;
    __IO uint32_t VSSEL133;
    __IO uint32_t VSSEL134;
    __IO uint32_t VSSEL135;
    __IO uint32_t VSSEL136;
    __IO uint32_t VSSEL137;
    __IO uint32_t VSSEL138;
    __IO uint32_t VSSEL139;
    __IO uint32_t VSSEL140;
    __IO uint32_t VSSEL141;
    __IO uint32_t VSSEL142;
    __IO uint32_t VSSEL143;
    __IO uint32_t SWIER;
    __IO uint32_t EVTER;
    __IO uint32_t IER;
    __IO uint32_t FPUIER;
} CM_INTC_TypeDef;

/**
 * @brief KEYSCAN
 */
typedef struct {
    __IO uint32_t SCR;
    __IO uint32_t SER;
    __IO uint32_t SSR;
} CM_KEYSCAN_TypeDef;

/**
 * @brief MAU
 */
typedef struct {
    __IO uint32_t CSR;
    __IO uint32_t DTR0;
    uint8_t RESERVED0[4];
    __IO uint32_t RTR0;
    __IO uint32_t DTR1;
    __IO uint32_t RTR1;
} CM_MAU_TypeDef;

/**
 * @brief MCAN
 */
typedef struct {
    uint8_t RESERVED0[4];
    __IO uint32_t ENDN;
    uint8_t RESERVED1[4];
    __IO uint32_t DBTP;
    __IO uint32_t TEST;
    __IO uint32_t RWD;
    __IO uint32_t CCCR;
    __IO uint32_t NBTP;
    __IO uint32_t TSCC;
    __IO uint32_t TSCV;
    __IO uint32_t TOCC;
    __IO uint32_t TOCV;
    uint8_t RESERVED2[16];
    __I  uint32_t ECR;
    __I  uint32_t PSR;
    __IO uint32_t TDCR;
    uint8_t RESERVED3[4];
    __IO uint32_t IR;
    __IO uint32_t IE;
    __IO uint32_t ILS;
    __IO uint32_t ILE;
    uint8_t RESERVED4[32];
    __IO uint32_t GFC;
    __IO uint32_t SIDFC;
    __IO uint32_t XIDFC;
    uint8_t RESERVED5[4];
    __IO uint32_t XIDAM;
    __I  uint32_t HPMS;
    __IO uint32_t NDAT1;
    __IO uint32_t NDAT2;
    __IO uint32_t RXF0C;
    __I  uint32_t RXF0S;
    __IO uint32_t RXF0A;
    __IO uint32_t RXBC;
    __IO uint32_t RXF1C;
    __I  uint32_t RXF1S;
    __IO uint32_t RXF1A;
    __IO uint32_t RXESC;
    __IO uint32_t TXBC;
    __I  uint32_t TXFQS;
    __IO uint32_t TXESC;
    __I  uint32_t TXBRP;
    __IO uint32_t TXBAR;
    __IO uint32_t TXBCR;
    __I  uint32_t TXBTO;
    __I  uint32_t TXBCF;
    __IO uint32_t TXBTIE;
    __IO uint32_t TXBCIE;
    uint8_t RESERVED6[8];
    __IO uint32_t TXEFC;
    __I  uint32_t TXEFS;
    __IO uint32_t TXEFA;
} CM_MCAN_TypeDef;

/**
 * @brief MCANRAM
 */
typedef struct {
    __IO uint32_t CKCR;
    __IO uint32_t CKSR;
    __IO uint32_t EIEN;
    __IO uint32_t EIBIT0;
    __IO uint32_t EIBIT1;
    __I  uint32_t ECCERRADDR;
} CM_MCANRAM_TypeDef;

/**
 * @brief MPU
 */
typedef struct {
    __IO uint32_t RGD0;
    __IO uint32_t RGD1;
    __IO uint32_t RGD2;
    __IO uint32_t RGD3;
    __IO uint32_t RGD4;
    __IO uint32_t RGD5;
    __IO uint32_t RGD6;
    __IO uint32_t RGD7;
    __IO uint32_t RGD8;
    __IO uint32_t RGD9;
    __IO uint32_t RGD10;
    __IO uint32_t RGD11;
    __IO uint32_t RGD12;
    __IO uint32_t RGD13;
    __IO uint32_t RGD14;
    __IO uint32_t RGD15;
    __I  uint32_t SR;
    __O  uint32_t ECLR;
    __IO uint32_t WP;
    __IO uint32_t IPPR;
    __IO uint32_t S1RGE;
    __IO uint32_t S1RGWP;
    __IO uint32_t S1RGRP;
    __IO uint32_t S1CR;
    __IO uint32_t S2RGE;
    __IO uint32_t S2RGWP;
    __IO uint32_t S2RGRP;
    __IO uint32_t S2CR;
    __IO uint32_t FRGE;
    __IO uint32_t FRGWP;
    __IO uint32_t FRGRP;
    __IO uint32_t FCR;
    __IO uint32_t HRGE;
    __IO uint32_t HRGWP;
    __IO uint32_t HRGRP;
    __IO uint32_t HCR;
    __IO uint32_t ERGE;
    __IO uint32_t ERGWP;
    __IO uint32_t ERGRP;
    __IO uint32_t ECR;
} CM_MPU_TypeDef;

/**
 * @brief NFC
 */
typedef struct {
    __IO uint32_t DATR_BASE;
    uint8_t RESERVED0[32764];
    __IO uint32_t CMDR;
    __IO uint32_t IDXR0;
    uint8_t RESERVED1[40];
    __IO uint32_t IENR;
    __IO uint32_t ISTR;
    __IO uint32_t IRSR;
    uint8_t RESERVED2[12];
    __IO uint32_t IDXR1;
    __IO uint32_t TMCR0;
    __IO uint32_t TMCR1;
    __IO uint32_t BACR;
    uint8_t RESERVED3[4];
    __IO uint32_t TMCR2;
    __I  uint32_t ECCR0;
    __I  uint32_t ECCR1;
    __I  uint32_t ECCR2;
    __I  uint32_t ECCR3;
    __I  uint32_t ECCR4;
    __I  uint32_t ECCR5;
    __I  uint32_t ECCR6;
    union {
        __I  uint32_t ECCR7;
        __I  uint32_t ECC_STAT;
    };
    union {
        __I  uint32_t ECCR8;
        __I  uint32_t ECC_SECTION0_SYND12;
    };
    union {
        __I  uint32_t ECCR9;
        __I  uint32_t ECC_SECTION0_SYND34;
    };
    union {
        __I  uint32_t ECCR10;
        __I  uint32_t ECC_SECTION0_SYND56;
    };
    union {
        __I  uint32_t ECCR11;
        __I  uint32_t ECC_SECTION0_SYND78;
    };
    union {
        __I  uint32_t ECCR12;
        __I  uint32_t ECC_SECTION1_SYND12;
    };
    union {
        __I  uint32_t ECCR13;
        __I  uint32_t ECC_SECTION1_SYND34;
    };
    union {
        __I  uint32_t ECCR14;
        __I  uint32_t ECC_SECTION1_SYND56;
    };
    union {
        __I  uint32_t ECCR15;
        __I  uint32_t ECC_SECTION1_SYND78;
    };
    __I  uint32_t ECC_SECTION2_SYND12;
    __I  uint32_t ECC_SECTION2_SYND34;
    __I  uint32_t ECC_SECTION2_SYND56;
    __I  uint32_t ECC_SECTION2_SYND78;
    __I  uint32_t ECC_SECTION3_SYND12;
    __I  uint32_t ECC_SECTION3_SYND34;
    __I  uint32_t ECC_SECTION3_SYND56;
    __I  uint32_t ECC_SECTION3_SYND78;
    __I  uint32_t ECC_SECTION4_SYND12;
    __I  uint32_t ECC_SECTION4_SYND34;
    __I  uint32_t ECC_SECTION4_SYND56;
    __I  uint32_t ECC_SECTION4_SYND78;
    __I  uint32_t ECC_SECTION5_SYND12;
    __I  uint32_t ECC_SECTION5_SYND34;
    __I  uint32_t ECC_SECTION5_SYND56;
    __I  uint32_t ECC_SECTION5_SYND78;
    __I  uint32_t ECC_SECTION6_SYND12;
    __I  uint32_t ECC_SECTION6_SYND34;
    __I  uint32_t ECC_SECTION6_SYND56;
    __I  uint32_t ECC_SECTION6_SYND78;
    __I  uint32_t ECC_SECTION7_SYND12;
    __I  uint32_t ECC_SECTION7_SYND34;
    __I  uint32_t ECC_SECTION7_SYND56;
    __I  uint32_t ECC_SECTION7_SYND78;
    __I  uint32_t ECC_SECTION8_SYND12;
    __I  uint32_t ECC_SECTION8_SYND34;
    __I  uint32_t ECC_SECTION8_SYND56;
    __I  uint32_t ECC_SECTION8_SYND78;
    __I  uint32_t ECC_SECTION9_SYND12;
    __I  uint32_t ECC_SECTION9_SYND34;
    __I  uint32_t ECC_SECTION9_SYND56;
    __I  uint32_t ECC_SECTION9_SYND78;
    __I  uint32_t ECC_SECTION10_SYND12;
    __I  uint32_t ECC_SECTION10_SYND34;
    __I  uint32_t ECC_SECTION10_SYND56;
    __I  uint32_t ECC_SECTION10_SYND78;
    __I  uint32_t ECC_SECTION11_SYND12;
    __I  uint32_t ECC_SECTION11_SYND34;
    __I  uint32_t ECC_SECTION11_SYND56;
    __I  uint32_t ECC_SECTION11_SYND78;
    __I  uint32_t ECC_SECTION12_SYND12;
    __I  uint32_t ECC_SECTION12_SYND34;
    __I  uint32_t ECC_SECTION12_SYND56;
    __I  uint32_t ECC_SECTION12_SYND78;
    __I  uint32_t ECC_SECTION13_SYND12;
    __I  uint32_t ECC_SECTION13_SYND34;
    __I  uint32_t ECC_SECTION13_SYND56;
    __I  uint32_t ECC_SECTION13_SYND78;
    __I  uint32_t ECC_SECTION14_SYND12;
    __I  uint32_t ECC_SECTION14_SYND34;
    __I  uint32_t ECC_SECTION14_SYND56;
    __I  uint32_t ECC_SECTION14_SYND78;
    __I  uint32_t ECC_SECTION15_SYND12;
    __I  uint32_t ECC_SECTION15_SYND34;
    __I  uint32_t ECC_SECTION15_SYND56;
    __I  uint32_t ECC_SECTION15_SYND78;
} CM_NFC_TypeDef;

/**
 * @brief OTS
 */
typedef struct {
    uint8_t RESERVED0[224];
    __IO uint32_t PDR1;
    uint8_t RESERVED1[16];
    __IO uint32_t PDR2;
    __IO uint32_t PDR3;
    uint8_t RESERVED2[237828];
    __IO uint16_t CTL;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t ECR;
} CM_OTS_TypeDef;

/**
 * @brief PERIC
 */
typedef struct {
    __IO uint32_t USB_SYCTLREG;
    __IO uint32_t SDIOC_SYCTLREG;
    __IO uint32_t NFC_STCR;
    __IO uint32_t EXMC_ENAR;
    __IO uint32_t ETH_MAC_IFCONFR;
    __IO uint32_t TMR_SYNENR1;
    __IO uint32_t CAN_SYCTLREG;
    __IO uint32_t USART1_NFC;
    uint8_t RESERVED0[8];
    __I  uint32_t NFC_STSR;
    uint8_t RESERVED1[20];
    __IO uint32_t TMR_SYNENR2;
} CM_PERIC_TypeDef;

/**
 * @brief PKE
 */
typedef struct {
    __IO uint32_t RAM0_CKCR;
    __IO uint32_t RAM0_CKSR;
    __IO uint32_t RAM0_EIEN;
    __IO uint32_t RAM0_EIBIT0;
    __IO uint32_t RAM0_EIBIT1;
    __I  uint32_t RAM0_ECCERRADDR;
    uint8_t RESERVED0[8];
    __IO uint32_t RAM1_CKCR;
    __IO uint32_t RAM1_CKSR;
    __IO uint32_t RAM1_EIEN;
    __IO uint32_t RAM1_EIBIT0;
    __IO uint32_t RAM1_EIBIT1;
    __I  uint32_t RAM1_ECCERRADDR;
    uint8_t RESERVED1[4040];
    __IO uint32_t CTRL;
    __IO uint32_t CFG;
    __IO uint32_t MC_PTR;
    __IO uint32_t RISR;
    __IO uint32_t IMCR;
    __I  uint32_t MISR;
    uint8_t RESERVED2[12];
    __I  uint32_t RT_CODE;
    uint8_t RESERVED3[40];
    __IO uint32_t EXE_CFG;
    uint8_t RESERVED4[168];
    __I  uint32_t VERSION;
    uint8_t RESERVED5[768];
    __IO uint32_t MEM_RAM0;
    uint8_t RESERVED6[3068];
    __IO uint32_t MEM_RAM1;
} CM_PKE_TypeDef;

/**
 * @brief PWC
 */
typedef struct {
    __IO uint32_t FCG0;
    __IO uint32_t FCG1;
    __IO uint32_t FCG2;
    __IO uint32_t FCG3;
    __IO uint32_t FCG0PC;
    uint8_t RESERVED0[17436];
    __IO uint8_t  VBATRSTR;
    uint8_t RESERVED1[15];
    __IO uint8_t  VBATCR;
    uint8_t RESERVED2[7];
    __I  uint8_t  VBATPORF;
    uint8_t RESERVED3[3];
    __IO uint8_t  VBATPORFCLR;
    uint8_t RESERVED4[3];
    __IO uint8_t  WKTC0;
    uint8_t RESERVED5[3];
    __IO uint8_t  WKTC1;
    uint8_t RESERVED6[3];
    __IO uint8_t  WKTC2;
    uint8_t RESERVED7[423];
    __IO uint8_t  BKR0;
    uint8_t RESERVED8[3];
    __IO uint8_t  BKR1;
    uint8_t RESERVED9[3];
    __IO uint8_t  BKR2;
    uint8_t RESERVED10[3];
    __IO uint8_t  BKR3;
    uint8_t RESERVED11[3];
    __IO uint8_t  BKR4;
    uint8_t RESERVED12[3];
    __IO uint8_t  BKR5;
    uint8_t RESERVED13[3];
    __IO uint8_t  BKR6;
    uint8_t RESERVED14[3];
    __IO uint8_t  BKR7;
    uint8_t RESERVED15[3];
    __IO uint8_t  BKR8;
    uint8_t RESERVED16[3];
    __IO uint8_t  BKR9;
    uint8_t RESERVED17[3];
    __IO uint8_t  BKR10;
    uint8_t RESERVED18[3];
    __IO uint8_t  BKR11;
    uint8_t RESERVED19[3];
    __IO uint8_t  BKR12;
    uint8_t RESERVED20[3];
    __IO uint8_t  BKR13;
    uint8_t RESERVED21[3];
    __IO uint8_t  BKR14;
    uint8_t RESERVED22[3];
    __IO uint8_t  BKR15;
    uint8_t RESERVED23[3];
    __IO uint8_t  BKR16;
    uint8_t RESERVED24[3];
    __IO uint8_t  BKR17;
    uint8_t RESERVED25[3];
    __IO uint8_t  BKR18;
    uint8_t RESERVED26[3];
    __IO uint8_t  BKR19;
    uint8_t RESERVED27[3];
    __IO uint8_t  BKR20;
    uint8_t RESERVED28[3];
    __IO uint8_t  BKR21;
    uint8_t RESERVED29[3];
    __IO uint8_t  BKR22;
    uint8_t RESERVED30[3];
    __IO uint8_t  BKR23;
    uint8_t RESERVED31[3];
    __IO uint8_t  BKR24;
    uint8_t RESERVED32[3];
    __IO uint8_t  BKR25;
    uint8_t RESERVED33[3];
    __IO uint8_t  BKR26;
    uint8_t RESERVED34[3];
    __IO uint8_t  BKR27;
    uint8_t RESERVED35[3];
    __IO uint8_t  BKR28;
    uint8_t RESERVED36[3];
    __IO uint8_t  BKR29;
    uint8_t RESERVED37[3];
    __IO uint8_t  BKR30;
    uint8_t RESERVED38[3];
    __IO uint8_t  BKR31;
    uint8_t RESERVED39[3];
    __IO uint8_t  BKR32;
    uint8_t RESERVED40[3];
    __IO uint8_t  BKR33;
    uint8_t RESERVED41[3];
    __IO uint8_t  BKR34;
    uint8_t RESERVED42[3];
    __IO uint8_t  BKR35;
    uint8_t RESERVED43[3];
    __IO uint8_t  BKR36;
    uint8_t RESERVED44[3];
    __IO uint8_t  BKR37;
    uint8_t RESERVED45[3];
    __IO uint8_t  BKR38;
    uint8_t RESERVED46[3];
    __IO uint8_t  BKR39;
    uint8_t RESERVED47[3];
    __IO uint8_t  BKR40;
    uint8_t RESERVED48[3];
    __IO uint8_t  BKR41;
    uint8_t RESERVED49[3];
    __IO uint8_t  BKR42;
    uint8_t RESERVED50[3];
    __IO uint8_t  BKR43;
    uint8_t RESERVED51[3];
    __IO uint8_t  BKR44;
    uint8_t RESERVED52[3];
    __IO uint8_t  BKR45;
    uint8_t RESERVED53[3];
    __IO uint8_t  BKR46;
    uint8_t RESERVED54[3];
    __IO uint8_t  BKR47;
    uint8_t RESERVED55[3];
    __IO uint8_t  BKR48;
    uint8_t RESERVED56[3];
    __IO uint8_t  BKR49;
    uint8_t RESERVED57[3];
    __IO uint8_t  BKR50;
    uint8_t RESERVED58[3];
    __IO uint8_t  BKR51;
    uint8_t RESERVED59[3];
    __IO uint8_t  BKR52;
    uint8_t RESERVED60[3];
    __IO uint8_t  BKR53;
    uint8_t RESERVED61[3];
    __IO uint8_t  BKR54;
    uint8_t RESERVED62[3];
    __IO uint8_t  BKR55;
    uint8_t RESERVED63[3];
    __IO uint8_t  BKR56;
    uint8_t RESERVED64[3];
    __IO uint8_t  BKR57;
    uint8_t RESERVED65[3];
    __IO uint8_t  BKR58;
    uint8_t RESERVED66[3];
    __IO uint8_t  BKR59;
    uint8_t RESERVED67[3];
    __IO uint8_t  BKR60;
    uint8_t RESERVED68[3];
    __IO uint8_t  BKR61;
    uint8_t RESERVED69[3];
    __IO uint8_t  BKR62;
    uint8_t RESERVED70[3];
    __IO uint8_t  BKR63;
    uint8_t RESERVED71[3];
    __IO uint8_t  BKR64;
    uint8_t RESERVED72[3];
    __IO uint8_t  BKR65;
    uint8_t RESERVED73[3];
    __IO uint8_t  BKR66;
    uint8_t RESERVED74[3];
    __IO uint8_t  BKR67;
    uint8_t RESERVED75[3];
    __IO uint8_t  BKR68;
    uint8_t RESERVED76[3];
    __IO uint8_t  BKR69;
    uint8_t RESERVED77[3];
    __IO uint8_t  BKR70;
    uint8_t RESERVED78[3];
    __IO uint8_t  BKR71;
    uint8_t RESERVED79[3];
    __IO uint8_t  BKR72;
    uint8_t RESERVED80[3];
    __IO uint8_t  BKR73;
    uint8_t RESERVED81[3];
    __IO uint8_t  BKR74;
    uint8_t RESERVED82[3];
    __IO uint8_t  BKR75;
    uint8_t RESERVED83[3];
    __IO uint8_t  BKR76;
    uint8_t RESERVED84[3];
    __IO uint8_t  BKR77;
    uint8_t RESERVED85[3];
    __IO uint8_t  BKR78;
    uint8_t RESERVED86[3];
    __IO uint8_t  BKR79;
    uint8_t RESERVED87[3];
    __IO uint8_t  BKR80;
    uint8_t RESERVED88[3];
    __IO uint8_t  BKR81;
    uint8_t RESERVED89[3];
    __IO uint8_t  BKR82;
    uint8_t RESERVED90[3];
    __IO uint8_t  BKR83;
    uint8_t RESERVED91[3];
    __IO uint8_t  BKR84;
    uint8_t RESERVED92[3];
    __IO uint8_t  BKR85;
    uint8_t RESERVED93[3];
    __IO uint8_t  BKR86;
    uint8_t RESERVED94[3];
    __IO uint8_t  BKR87;
    uint8_t RESERVED95[3];
    __IO uint8_t  BKR88;
    uint8_t RESERVED96[3];
    __IO uint8_t  BKR89;
    uint8_t RESERVED97[3];
    __IO uint8_t  BKR90;
    uint8_t RESERVED98[3];
    __IO uint8_t  BKR91;
    uint8_t RESERVED99[3];
    __IO uint8_t  BKR92;
    uint8_t RESERVED100[3];
    __IO uint8_t  BKR93;
    uint8_t RESERVED101[3];
    __IO uint8_t  BKR94;
    uint8_t RESERVED102[3];
    __IO uint8_t  BKR95;
    uint8_t RESERVED103[3];
    __IO uint8_t  BKR96;
    uint8_t RESERVED104[3];
    __IO uint8_t  BKR97;
    uint8_t RESERVED105[3];
    __IO uint8_t  BKR98;
    uint8_t RESERVED106[3];
    __IO uint8_t  BKR99;
    uint8_t RESERVED107[3];
    __IO uint8_t  BKR100;
    uint8_t RESERVED108[3];
    __IO uint8_t  BKR101;
    uint8_t RESERVED109[3];
    __IO uint8_t  BKR102;
    uint8_t RESERVED110[3];
    __IO uint8_t  BKR103;
    uint8_t RESERVED111[3];
    __IO uint8_t  BKR104;
    uint8_t RESERVED112[3];
    __IO uint8_t  BKR105;
    uint8_t RESERVED113[3];
    __IO uint8_t  BKR106;
    uint8_t RESERVED114[3];
    __IO uint8_t  BKR107;
    uint8_t RESERVED115[3];
    __IO uint8_t  BKR108;
    uint8_t RESERVED116[3];
    __IO uint8_t  BKR109;
    uint8_t RESERVED117[3];
    __IO uint8_t  BKR110;
    uint8_t RESERVED118[3];
    __IO uint8_t  BKR111;
    uint8_t RESERVED119[3];
    __IO uint8_t  BKR112;
    uint8_t RESERVED120[3];
    __IO uint8_t  BKR113;
    uint8_t RESERVED121[3];
    __IO uint8_t  BKR114;
    uint8_t RESERVED122[3];
    __IO uint8_t  BKR115;
    uint8_t RESERVED123[3];
    __IO uint8_t  BKR116;
    uint8_t RESERVED124[3];
    __IO uint8_t  BKR117;
    uint8_t RESERVED125[3];
    __IO uint8_t  BKR118;
    uint8_t RESERVED126[3];
    __IO uint8_t  BKR119;
    uint8_t RESERVED127[3];
    __IO uint8_t  BKR120;
    uint8_t RESERVED128[3];
    __IO uint8_t  BKR121;
    uint8_t RESERVED129[3];
    __IO uint8_t  BKR122;
    uint8_t RESERVED130[3];
    __IO uint8_t  BKR123;
    uint8_t RESERVED131[3];
    __IO uint8_t  BKR124;
    uint8_t RESERVED132[3];
    __IO uint8_t  BKR125;
    uint8_t RESERVED133[3];
    __IO uint8_t  BKR126;
    uint8_t RESERVED134[3];
    __IO uint8_t  BKR127;
    uint8_t RESERVED135[1027];
    __IO uint8_t  PWRC0;
    uint8_t RESERVED136[3];
    __IO uint8_t  PWRC1;
    uint8_t RESERVED137[3];
    __IO uint8_t  PWRC2;
    uint8_t RESERVED138[3];
    __IO uint8_t  PWRC3;
    uint8_t RESERVED139[3];
    __IO uint8_t  PWRC4;
    uint8_t RESERVED140[3];
    __IO uint8_t  PVDCR0;
    uint8_t RESERVED141[3];
    __IO uint8_t  PVDCR1;
    uint8_t RESERVED142[3];
    __IO uint8_t  PVDFCR;
    uint8_t RESERVED143[3];
    __IO uint8_t  PVDLCR;
    uint8_t RESERVED144[7];
    __IO uint8_t  PDWKE0;
    uint8_t RESERVED145[3];
    __IO uint8_t  PDWKE1;
    uint8_t RESERVED146[3];
    __IO uint8_t  PDWKE2;
    uint8_t RESERVED147[3];
    __IO uint8_t  PDWKES;
    uint8_t RESERVED148[3];
    __IO uint8_t  PDWKF0;
    uint8_t RESERVED149[3];
    __IO uint8_t  PDWKF1;
    uint8_t RESERVED150[163];
    __IO uint32_t RAMPC0;
    __IO uint16_t RAMOPM;
    uint8_t RESERVED151[2];
    __IO uint32_t PRAMLPC;
    __I  uint16_t LPMCSR;
    __IO uint16_t LPMCSCR;
    __IO uint8_t  PVDICR;
    uint8_t RESERVED152[3];
    __IO uint8_t  PVDDSR;
    uint8_t RESERVED153[29463];
    __IO uint16_t STPMCR;
    uint8_t RESERVED154[1008];
    __IO uint16_t FPRC;
} CM_PWC_TypeDef;

/**
 * @brief QSPI
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSCR;
    __IO uint32_t FCR;
    __IO uint32_t SR;
    __IO uint32_t DCOM;
    __IO uint32_t CCMD;
    __IO uint32_t XCMD;
    uint8_t RESERVED0[8];
    __O  uint32_t CLR;
    uint8_t RESERVED1[2012];
    __IO uint32_t EXAR;
} CM_QSPI_TypeDef;

/**
 * @brief RMU
 */
typedef struct {
    uint8_t RESERVED0[192];
    __IO uint32_t FRST0;
    __IO uint32_t FRST1;
    __IO uint32_t FRST2;
    __IO uint32_t FRST3;
    uint8_t RESERVED1[40];
    __IO uint8_t  PRSTCR0;
    uint8_t RESERVED2[3];
    __IO uint32_t RSTF0;
} CM_RMU_TypeDef;

