levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for AOS_PEVNTIDR register  */
#define AOS_PEVNTIDR_PIN                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTODR register  */
#define AOS_PEVNTODR_POUT                              (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTORR register  */
#define AOS_PEVNTORR_POR                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTOSR register  */
#define AOS_PEVNTOSR_POS                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTRISR register  */
#define AOS_PEVNTRISR_RIS                              (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTFALR register  */
#define AOS_PEVNTFALR_FAL                              (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTDIRR2 register  */
#define AOS_PEVNTDIRR2_PDIR                            (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTNFCR register  */
#define AOS_PEVNTNFCR_NFEN1_POS                        (0U)
#define AOS_PEVNTNFCR_NFEN1                            (0x00000001UL)
#define AOS_PEVNTNFCR_DIVS1_POS                        (1U)
#define AOS_PEVNTNFCR_DIVS1                            (0x00000006UL)
#define AOS_PEVNTNFCR_DIVS1_0                          (0x00000002UL)
#define AOS_PEVNTNFCR_DIVS1_1                          (0x00000004UL)
#define AOS_PEVNTNFCR_NFEN2_POS                        (8U)
#define AOS_PEVNTNFCR_NFEN2                            (0x00000100UL)
#define AOS_PEVNTNFCR_DIVS2_POS                        (9U)
#define AOS_PEVNTNFCR_DIVS2                            (0x00000600UL)
#define AOS_PEVNTNFCR_DIVS2_0                          (0x00000200UL)
#define AOS_PEVNTNFCR_DIVS2_1                          (0x00000400UL)
#define AOS_PEVNTNFCR_NFEN3_POS                        (16U)
#define AOS_PEVNTNFCR_NFEN3                            (0x00010000UL)
#define AOS_PEVNTNFCR_DIVS3_POS                        (17U)
#define AOS_PEVNTNFCR_DIVS3                            (0x00060000UL)
#define AOS_PEVNTNFCR_DIVS3_0                          (0x00020000UL)
#define AOS_PEVNTNFCR_DIVS3_1                          (0x00040000UL)
#define AOS_PEVNTNFCR_NFEN4_POS                        (24U)
#define AOS_PEVNTNFCR_NFEN4                            (0x01000000UL)
#define AOS_PEVNTNFCR_DIVS4_POS                        (25U)
#define AOS_PEVNTNFCR_DIVS4                            (0x06000000UL)
#define AOS_PEVNTNFCR_DIVS4_0                          (0x02000000UL)
#define AOS_PEVNTNFCR_DIVS4_1                          (0x04000000UL)

/*  Bit definition for AOS_PLU_CR register  */
#define AOS_PLU_CR_PLMODE_POS                          (0U)
#define AOS_PLU_CR_PLMODE                              (0x00000003UL)
#define AOS_PLU_CR_PLMODE_0                            (0x00000001UL)
#define AOS_PLU_CR_PLMODE_1                            (0x00000002UL)
#define AOS_PLU_CR_PLINASEL_POS                        (8U)
#define AOS_PLU_CR_PLINASEL                            (0x00000300UL)
#define AOS_PLU_CR_PLINASEL_0                          (0x00000100UL)
#define AOS_PLU_CR_PLINASEL_1                          (0x00000200UL)
#define AOS_PLU_CR_PLINBSEL_POS                        (10U)
#define AOS_PLU_CR_PLINBSEL                            (0x00000C00UL)
#define AOS_PLU_CR_PLINBSEL_0                          (0x00000400UL)
#define AOS_PLU_CR_PLINBSEL_1                          (0x00000800UL)
#define AOS_PLU_CR_PLINCSEL_POS                        (12U)
#define AOS_PLU_CR_PLINCSEL                            (0x00003000UL)
#define AOS_PLU_CR_PLINCSEL_0                          (0x00001000UL)
#define AOS_PLU_CR_PLINCSEL_1                          (0x00002000UL)
#define AOS_PLU_CR_PLINDSEL_POS                        (14U)
#define AOS_PLU_CR_PLINDSEL                            (0x0000C000UL)
#define AOS_PLU_CR_PLINDSEL_0                          (0x00004000UL)
#define AOS_PLU_CR_PLINDSEL_1                          (0x00008000UL)

/*  Bit definition for AOS_PLU_TRGSELA register  */
#define AOS_PLU_TRGSELA_PLTRGSEL                       (0x000001FFUL)

/*  Bit definition for AOS_PLU_TRGSELB register  */
#define AOS_PLU_TRGSELB_PLTRGSEL                       (0x000001FFUL)

/*  Bit definition for AOS_PLU_TRGSELC register  */
#define AOS_PLU_TRGSELC_PLTRGSEL                       (0x000001FFUL)

/*  Bit definition for AOS_PLU_TRGSELD register  */
#define AOS_PLU_TRGSELD_PLTRGSEL                       (0x000001FFUL)

/*******************************************************************************
                Bit definition for Peripheral CAN
*******************************************************************************/
/*  Bit definition for CAN_RBUF register  */
#define CAN_RBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_TBUF register  */
#define CAN_TBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_CFG_STAT register  */
#define CAN_CFG_STAT_BUSOFF_POS                        (0U)
#define CAN_CFG_STAT_BUSOFF                            (0x01U)
#define CAN_CFG_STAT_TACTIVE_POS                       (1U)
#define CAN_CFG_STAT_TACTIVE                           (0x02U)
#define CAN_CFG_STAT_RACTIVE_POS                       (2U)
#define CAN_CFG_STAT_RACTIVE                           (0x04U)
#define CAN_CFG_STAT_TSSS_POS                          (3U)
#define CAN_CFG_STAT_TSSS                              (0x08U)
#define CAN_CFG_STAT_TPSS_POS                          (4U)
#define CAN_CFG_STAT_TPSS                              (0x10U)
#define CAN_CFG_STAT_LBMI_POS                          (5U)
#define CAN_CFG_STAT_LBMI                              (0x20U)
#define CAN_CFG_STAT_LBME_POS                          (6U)
#define CAN_CFG_STAT_LBME                              (0x40U)
#define CAN_CFG_STAT_RESET_POS                         (7U)
#define CAN_CFG_STAT_RESET                             (0x80U)

/*  Bit definition for CAN_TCMD register  */
#define CAN_TCMD_TSA_POS                               (0U)
#define CAN_TCMD_TSA                                   (0x01U)
#define CAN_TCMD_TSALL_POS                             (1U)
#define CAN_TCMD_TSALL                                 (0x02U)
#define CAN_TCMD_TSONE_POS                             (2U)
#define CAN_TCMD_TSONE                                 (0x04U)
#define CAN_TCMD_TPA_POS                               (3U)
#define CAN_TCMD_TPA                                   (0x08U)
#define CAN_TCMD_TPE_POS                               (4U)
#define CAN_TCMD_TPE                                   (0x10U)
#define CAN_TCMD_LOM_POS                               (6U)
#define CAN_TCMD_LOM                                   (0x40U)
#define CAN_TCMD_TBSEL_POS                             (7U)
#define CAN_TCMD_TBSEL                                 (0x80U)

