levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for CAN_TTCFG register  */
#define CAN_TTCFG_TTEN_POS                             (0U)
#define CAN_TTCFG_TTEN                                 (0x01U)
#define CAN_TTCFG_T_PRESC_POS                          (1U)
#define CAN_TTCFG_T_PRESC                              (0x06U)
#define CAN_TTCFG_T_PRESC_0                            (0x02U)
#define CAN_TTCFG_T_PRESC_1                            (0x04U)
#define CAN_TTCFG_TTIF_POS                             (3U)
#define CAN_TTCFG_TTIF                                 (0x08U)
#define CAN_TTCFG_TTIE_POS                             (4U)
#define CAN_TTCFG_TTIE                                 (0x10U)
#define CAN_TTCFG_TEIF_POS                             (5U)
#define CAN_TTCFG_TEIF                                 (0x20U)
#define CAN_TTCFG_WTIF_POS                             (6U)
#define CAN_TTCFG_WTIF                                 (0x40U)
#define CAN_TTCFG_WTIE_POS                             (7U)
#define CAN_TTCFG_WTIE                                 (0x80U)

/*  Bit definition for CAN_REF_MSG register  */
#define CAN_REF_MSG_REF_ID_POS                         (0U)
#define CAN_REF_MSG_REF_ID                             (0x1FFFFFFFUL)
#define CAN_REF_MSG_REF_IDE_POS                        (31U)
#define CAN_REF_MSG_REF_IDE                            (0x80000000UL)

/*  Bit definition for CAN_TRG_CFG register  */
#define CAN_TRG_CFG_TTPTR_POS                          (0U)
#define CAN_TRG_CFG_TTPTR                              (0x0007U)
#define CAN_TRG_CFG_TTYPE_POS                          (8U)
#define CAN_TRG_CFG_TTYPE                              (0x0700U)
#define CAN_TRG_CFG_TTYPE_0                            (0x0100U)
#define CAN_TRG_CFG_TTYPE_1                            (0x0200U)
#define CAN_TRG_CFG_TTYPE_2                            (0x0400U)
#define CAN_TRG_CFG_TEW_POS                            (12U)
#define CAN_TRG_CFG_TEW                                (0xF000U)

/*  Bit definition for CAN_TT_TRIG register  */
#define CAN_TT_TRIG                                    (0xFFFFU)

/*  Bit definition for CAN_TT_WTRIG register  */
#define CAN_TT_WTRIG                                   (0xFFFFU)

/*  Bit definition for CAN_RAM_CKCR register  */
#define CAN_RAM_CKCR_ECCMOD                            (0x00000003UL)
#define CAN_RAM_CKCR_ECCMOD_0                          (0x00000001UL)
#define CAN_RAM_CKCR_ECCMOD_1                          (0x00000002UL)

/*  Bit definition for CAN_RAM_CKSR register  */
#define CAN_RAM_CKSR_RAM_1ERR_POS                      (0U)
#define CAN_RAM_CKSR_RAM_1ERR                          (0x00000001UL)
#define CAN_RAM_CKSR_RAM_2ERR_POS                      (1U)
#define CAN_RAM_CKSR_RAM_2ERR                          (0x00000002UL)

/*  Bit definition for CAN_RAM_EIEN register  */
#define CAN_RAM_EIEN_EIEN                              (0x00000001UL)

/*  Bit definition for CAN_RAM_EIBIT0 register  */
#define CAN_RAM_EIBIT0                                 (0xFFFFFFFFUL)

/*  Bit definition for CAN_RAM_EIBIT1 register  */
#define CAN_RAM_EIBIT1_EIBIT                           (0x0000007FUL)

/*  Bit definition for CAN_RAM_ECCERRADDR register  */
#define CAN_RAM_ECCERRADDR_ECCERRADDR                  (0x000007FFUL)

/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_MDR register  */
#define CMP_MDR_CENA_POS                               (0U)
#define CMP_MDR_CENA                                   (0x01U)
#define CMP_MDR_WDEN_POS                               (1U)
#define CMP_MDR_WDEN                                   (0x02U)
#define CMP_MDR_HYST_POS                               (4U)
#define CMP_MDR_HYST                                   (0x70U)
#define CMP_MDR_CMON_POS                               (7U)
#define CMP_MDR_CMON                                   (0x80U)

/*  Bit definition for CMP_FIR register  */
#define CMP_FIR_FCKS_POS                               (0U)
#define CMP_FIR_FCKS                                   (0x03U)
#define CMP_FIR_FCKS_0                                 (0x01U)
#define CMP_FIR_FCKS_1                                 (0x02U)
#define CMP_FIR_EDGS_POS                               (4U)
#define CMP_FIR_EDGS                                   (0x30U)
#define CMP_FIR_EDGS_0                                 (0x10U)
#define CMP_FIR_EDGS_1                                 (0x20U)
#define CMP_FIR_CIEN_POS                               (6U)
#define CMP_FIR_CIEN                                   (0x40U)

/*  Bit definition for CMP_OCR register  */
#define CMP_OCR_COEN_POS                               (0U)
#define CMP_OCR_COEN                                   (0x01U)
#define CMP_OCR_COPS_POS                               (1U)
#define CMP_OCR_COPS                                   (0x02U)
#define CMP_OCR_CPOE_POS                               (2U)
#define CMP_OCR_CPOE                                   (0x04U)
#define CMP_OCR_BWEN_POS                               (3U)
#define CMP_OCR_BWEN                                   (0x08U)
#define CMP_OCR_BWOL_POS                               (4U)
#define CMP_OCR_BWOL                                   (0x10U)

/*  Bit definition for CMP_PMSR register  */
#define CMP_PMSR_RVSL_POS                              (0U)
#define CMP_PMSR_RVSL                                  (0x0FU)
#define CMP_PMSR_RVSL_0                                (0x01U)
#define CMP_PMSR_RVSL_1                                (0x02U)
#define CMP_PMSR_RVSL_2                                (0x04U)
#define CMP_PMSR_RVSL_3                                (0x08U)
#define CMP_PMSR_CVSL_POS                              (4U)
#define CMP_PMSR_CVSL                                  (0xF0U)
#define CMP_PMSR_CVSL_0                                (0x10U)
#define CMP_PMSR_CVSL_1                                (0x20U)
#define CMP_PMSR_CVSL_2                                (0x40U)
#define CMP_PMSR_CVSL_3                                (0x80U)

/*  Bit definition for CMP_BWSR register  */
#define CMP_BWSR_CBWS0_POS                             (0U)
#define CMP_BWSR_CBWS0                                 (0x0001U)
#define CMP_BWSR_CBWS1_POS                             (1U)
#define CMP_BWSR_CBWS1                                 (0x0002U)
#define CMP_BWSR_CBWS2_POS                             (2U)
#define CMP_BWSR_CBWS2                                 (0x0004U)
#define CMP_BWSR_CBWS3_POS                             (3U)
#define CMP_BWSR_CBWS3                                 (0x0008U)
#define CMP_BWSR_CBWS4_POS                             (4U)
#define CMP_BWSR_CBWS4                                 (0x0010U)
#define CMP_BWSR_CBWS5_POS                             (5U)
#define CMP_BWSR_CBWS5                                 (0x0020U)
#define CMP_BWSR_CBWS6_POS                             (6U)
#define CMP_BWSR_CBWS6                                 (0x0040U)
#define CMP_BWSR_CBWS7_POS                             (7U)
#define CMP_BWSR_CBWS7                                 (0x0080U)
#define CMP_BWSR_CBWS8_POS                             (8U)
#define CMP_BWSR_CBWS8                                 (0x0100U)
#define CMP_BWSR_CBWS9_POS                             (9U)
#define CMP_BWSR_CBWS9                                 (0x0200U)
#define CMP_BWSR_CBWS10_POS                            (10U)
#define CMP_BWSR_CBWS10                                (0x0400U)
#define CMP_BWSR_CBWS11_POS                            (11U)
#define CMP_BWSR_CBWS11                                (0x0800U)
#define CMP_BWSR_CBWS12_POS                            (12U)
#define CMP_BWSR_CBWS12                                (0x1000U)
#define CMP_BWSR_CBWS13_POS                            (13U)
#define CMP_BWSR_CBWS13                                (0x2000U)
#define CMP_BWSR_CBWS14_POS                            (14U)
#define CMP_BWSR_CBWS14                                (0x4000U)
#define CMP_BWSR_CBWS15_POS                            (15U)
#define CMP_BWSR_CBWS15                                (0x8000U)

/*  Bit definition for CMP_BWPR register  */
#define CMP_BWPR_CBWP0_POS                             (0U)
#define CMP_BWPR_CBWP0                                 (0x0001U)
#define CMP_BWPR_CBWP1_POS                             (1U)
#define CMP_BWPR_CBWP1                                 (0x0002U)
#define CMP_BWPR_CBWP2_POS                             (2U)
#define CMP_BWPR_CBWP2                                 (0x0004U)
#define CMP_BWPR_CBWP3_POS                             (3U)
#define CMP_BWPR_CBWP3                                 (0x0008U)
#define CMP_BWPR_CBWP4_POS                             (4U)
#define CMP_BWPR_CBWP4                                 (0x0010U)
#define CMP_BWPR_CBWP5_POS                             (5U)
#define CMP_BWPR_CBWP5                                 (0x0020U)
#define CMP_BWPR_CBWP6_POS                             (6U)
#define CMP_BWPR_CBWP6                                 (0x0040U)
#define CMP_BWPR_CBWP7_POS                             (7U)
#define CMP_BWPR_CBWP7                                 (0x0080U)
#define CMP_BWPR_CBWP8_POS                             (8U)
#define CMP_BWPR_CBWP8                                 (0x0100U)
#define CMP_BWPR_CBWP9_POS                             (9U)
#define CMP_BWPR_CBWP9                                 (0x0200U)
#define CMP_BWPR_CBWP10_POS                            (10U)
#define CMP_BWPR_CBWP10                                (0x0400U)
#define CMP_BWPR_CBWP11_POS                            (11U)
#define CMP_BWPR_CBWP11                                (0x0800U)
#define CMP_BWPR_CBWP12_POS                            (12U)
#define CMP_BWPR_CBWP12                                (0x1000U)
#define CMP_BWPR_CBWP13_POS                            (13U)
#define CMP_BWPR_CBWP13                                (0x2000U)
#define CMP_BWPR_CBWP14_POS                            (14U)
#define CMP_BWPR_CBWP14                                (0x4000U)
#define CMP_BWPR_CBWP15_POS                            (15U)
#define CMP_BWPR_CBWP15                                (0x8000U)

/*  Bit definition for CMP_VISR register  */
#define CMP_VISR_P2SL_POS                              (0U)
#define CMP_VISR_P2SL                                  (0x0007U)
#define CMP_VISR_P2SL_0                                (0x0001U)
#define CMP_VISR_P2SL_1                                (0x0002U)
#define CMP_VISR_P2SL_2                                (0x0004U)
#define CMP_VISR_P3SL_POS                              (4U)
#define CMP_VISR_P3SL                                  (0x0030U)
#define CMP_VISR_P3SL_0                                (0x0010U)
#define CMP_VISR_P3SL_1                                (0x0020U)

