levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for EFM_CKSR register  */
#define EFM_CKSR_F0_1ERR_POS                           (0U)
#define EFM_CKSR_F0_1ERR                               (0x00000001UL)
#define EFM_CKSR_F0_2ERR_POS                           (1U)
#define EFM_CKSR_F0_2ERR                               (0x00000002UL)
#define EFM_CKSR_F1_1ERR_POS                           (16U)
#define EFM_CKSR_F1_1ERR                               (0x00010000UL)
#define EFM_CKSR_F1_2ERR_POS                           (17U)
#define EFM_CKSR_F1_2ERR                               (0x00020000UL)

/*  Bit definition for EFM_EIEN register  */
#define EFM_EIEN_F0_EIEN_POS                           (0U)
#define EFM_EIEN_F0_EIEN                               (0x00000001UL)
#define EFM_EIEN_F1_EIEN_POS                           (16U)
#define EFM_EIEN_F1_EIEN                               (0x00010000UL)

/*  Bit definition for EFM_F0ECCCR register  */
#define EFM_F0ECCCR_GDIS_POS                           (0U)
#define EFM_F0ECCCR_GDIS                               (0x00000001UL)
#define EFM_F0ECCCR_VDIS_POS                           (1U)
#define EFM_F0ECCCR_VDIS                               (0x00000002UL)

/*  Bit definition for EFM_F0ECCDR register  */
#define EFM_F0ECCDR_DWD_POS                            (0U)
#define EFM_F0ECCDR_DWD                                (0x000001FFUL)
#define EFM_F0ECCDR_DRD_POS                            (16U)
#define EFM_F0ECCDR_DRD                                (0x01FF0000UL)

/*  Bit definition for EFM_F0ERR0 register  */
#define EFM_F0ERR0_VALID_POS                           (0U)
#define EFM_F0ERR0_VALID                               (0x00000001UL)
#define EFM_F0ERR0_FATAL_POS                           (1U)
#define EFM_F0ERR0_FATAL                               (0x00000002UL)
#define EFM_F0ERR0_INDEX_POS                           (4U)
#define EFM_F0ERR0_INDEX                               (0x00FFFFF0UL)

/*  Bit definition for EFM_F0ERR1 register  */
#define EFM_F0ERR1_VALID_POS                           (0U)
#define EFM_F0ERR1_VALID                               (0x00000001UL)
#define EFM_F0ERR1_FATAL_POS                           (1U)
#define EFM_F0ERR1_FATAL                               (0x00000002UL)
#define EFM_F0ERR1_INDEX_POS                           (4U)
#define EFM_F0ERR1_INDEX                               (0x00FFFFF0UL)

/*  Bit definition for EFM_F0EIR0 register  */
#define EFM_F0EIR0                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0EIR1 register  */
#define EFM_F0EIR1                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0EIR2 register  */
#define EFM_F0EIR2                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0EIR3 register  */
#define EFM_F0EIR3                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0EIR4 register  */
#define EFM_F0EIR4                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F1ECCCR register  */
#define EFM_F1ECCCR_GDIS_POS                           (0U)
#define EFM_F1ECCCR_GDIS                               (0x00000001UL)
#define EFM_F1ECCCR_VDIS_POS                           (1U)
#define EFM_F1ECCCR_VDIS                               (0x00000002UL)

/*  Bit definition for EFM_F1ECCDR register  */
#define EFM_F1ECCDR_DWD_POS                            (0U)
#define EFM_F1ECCDR_DWD                                (0x000001FFUL)
#define EFM_F1ECCDR_DRD_POS                            (16U)
#define EFM_F1ECCDR_DRD                                (0x01FF0000UL)

/*  Bit definition for EFM_F1ERR0 register  */
#define EFM_F1ERR0_VALID_POS                           (0U)
#define EFM_F1ERR0_VALID                               (0x00000001UL)
#define EFM_F1ERR0_FATAL_POS                           (1U)
#define EFM_F1ERR0_FATAL                               (0x00000002UL)
#define EFM_F1ERR0_INDEX_POS                           (4U)
#define EFM_F1ERR0_INDEX                               (0x00FFFFF0UL)

/*  Bit definition for EFM_F1ERR1 register  */
#define EFM_F1ERR1_VALID_POS                           (0U)
#define EFM_F1ERR1_VALID                               (0x00000001UL)
#define EFM_F1ERR1_FATAL_POS                           (1U)
#define EFM_F1ERR1_FATAL                               (0x00000002UL)
#define EFM_F1ERR1_INDEX_POS                           (4U)
#define EFM_F1ERR1_INDEX                               (0x00FFFFF0UL)

/*  Bit definition for EFM_F1EIR0 register  */
#define EFM_F1EIR0                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F1EIR1 register  */
#define EFM_F1EIR1                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F1EIR2 register  */
#define EFM_F1EIR2                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F1EIR3 register  */
#define EFM_F1EIR3                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_F1EIR4 register  */
#define EFM_F1EIR4                                     (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral EMB
*******************************************************************************/
/*  Bit definition for EMB_CTL1 register  */
#define EMB_CTL1_CMPEN1_POS                            (0U)
#define EMB_CTL1_CMPEN1                                (0x00000001UL)
#define EMB_CTL1_CMPEN2_POS                            (1U)
#define EMB_CTL1_CMPEN2                                (0x00000002UL)
#define EMB_CTL1_CMPEN3_POS                            (2U)
#define EMB_CTL1_CMPEN3                                (0x00000004UL)
#define EMB_CTL1_CMPEN4_POS                            (3U)
#define EMB_CTL1_CMPEN4                                (0x00000008UL)
#define EMB_CTL1_SYSEN_POS                             (4U)
#define EMB_CTL1_SYSEN                                 (0x00000010UL)
#define EMB_CTL1_PWMSEN0_POS                           (5U)
#define EMB_CTL1_PWMSEN0                               (0x00000020UL)
#define EMB_CTL1_PWMSEN1_POS                           (6U)
#define EMB_CTL1_PWMSEN1                               (0x00000040UL)
#define EMB_CTL1_PWMSEN2_POS                           (7U)
#define EMB_CTL1_PWMSEN2                               (0x00000080UL)
#define EMB_CTL1_PWMSEN3_POS                           (8U)
#define EMB_CTL1_PWMSEN3                               (0x00000100UL)
#define EMB_CTL1_PWMSEN4_POS                           (9U)
#define EMB_CTL1_PWMSEN4                               (0x00000200UL)
#define EMB_CTL1_PWMSEN5_POS                           (10U)
#define EMB_CTL1_PWMSEN5                               (0x00000400UL)
#define EMB_CTL1_PWMSEN6_POS                           (11U)
#define EMB_CTL1_PWMSEN6                               (0x00000800UL)
#define EMB_CTL1_PWMSEN7_POS                           (12U)
#define EMB_CTL1_PWMSEN7                               (0x00001000UL)
#define EMB_CTL1_FCMERREN_POS                          (15U)
#define EMB_CTL1_FCMERREN                              (0x00008000UL)
#define EMB_CTL1_PORTINEN1_POS                         (16U)
#define EMB_CTL1_PORTINEN1                             (0x00010000UL)
#define EMB_CTL1_PORTINEN2_POS                         (17U)
#define EMB_CTL1_PORTINEN2                             (0x00020000UL)
#define EMB_CTL1_PORTINEN3_POS                         (18U)
#define EMB_CTL1_PORTINEN3                             (0x00040000UL)
#define EMB_CTL1_PORTINEN4_POS                         (19U)
#define EMB_CTL1_PORTINEN4                             (0x00080000UL)
#define EMB_CTL1_INVSEL1_POS                           (22U)
#define EMB_CTL1_INVSEL1                               (0x00400000UL)
#define EMB_CTL1_INVSEL2_POS                           (23U)
#define EMB_CTL1_INVSEL2                               (0x00800000UL)
#define EMB_CTL1_INVSEL3_POS                           (24U)
#define EMB_CTL1_INVSEL3                               (0x01000000UL)
#define EMB_CTL1_INVSEL4_POS                           (25U)
#define EMB_CTL1_INVSEL4                               (0x02000000UL)
#define EMB_CTL1_FLASHECCERREN_POS                     (26U)
#define EMB_CTL1_FLASHECCERREN                         (0x04000000UL)
#define EMB_CTL1_OSCSTPEN_POS                          (27U)
#define EMB_CTL1_OSCSTPEN                              (0x08000000UL)
#define EMB_CTL1_SRAMECCERREN_POS                      (28U)
#define EMB_CTL1_SRAMECCERREN                          (0x10000000UL)
#define EMB_CTL1_LOCKUPEN_POS                          (30U)
#define EMB_CTL1_LOCKUPEN                              (0x40000000UL)
#define EMB_CTL1_PVDEN_POS                             (31U)
#define EMB_CTL1_PVDEN                                 (0x80000000UL)

/*  Bit definition for EMB_CTL2 register  */
#define EMB_CTL2_PWMLV0_POS                            (0U)
#define EMB_CTL2_PWMLV0                                (0x00000001UL)
#define EMB_CTL2_PWMLV1_POS                            (1U)
#define EMB_CTL2_PWMLV1                                (0x00000002UL)
#define EMB_CTL2_PWMLV2_POS                            (2U)
#define EMB_CTL2_PWMLV2                                (0x00000004UL)
#define EMB_CTL2_PWMLV3_POS                            (3U)
#define EMB_CTL2_PWMLV3                                (0x00000008UL)
#define EMB_CTL2_PWMLV4_POS                            (4U)
#define EMB_CTL2_PWMLV4                                (0x00000010UL)
#define EMB_CTL2_PWMLV5_POS                            (5U)
#define EMB_CTL2_PWMLV5                                (0x00000020UL)
#define EMB_CTL2_PWMLV6_POS                            (6U)
#define EMB_CTL2_PWMLV6                                (0x00000040UL)
#define EMB_CTL2_PWMLV7_POS                            (7U)
#define EMB_CTL2_PWMLV7                                (0x00000080UL)
#define EMB_CTL2_NFSEL1_POS                            (16U)
#define EMB_CTL2_NFSEL1                                (0x00030000UL)
#define EMB_CTL2_NFEN1_POS                             (18U)
#define EMB_CTL2_NFEN1                                 (0x00040000UL)
#define EMB_CTL2_NFSEL2_POS                            (19U)
#define EMB_CTL2_NFSEL2                                (0x00180000UL)
#define EMB_CTL2_NFEN2_POS                             (21U)
#define EMB_CTL2_NFEN2                                 (0x00200000UL)
#define EMB_CTL2_NFSEL3_POS                            (22U)
#define EMB_CTL2_NFSEL3                                (0x00C00000UL)
#define EMB_CTL2_NFEN3_POS                             (24U)
#define EMB_CTL2_NFEN3                                 (0x01000000UL)
#define EMB_CTL2_NFSEL4_POS                            (25U)
#define EMB_CTL2_NFSEL4                                (0x06000000UL)
#define EMB_CTL2_NFEN4_POS                             (27U)
#define EMB_CTL2_NFEN4                                 (0x08000000UL)

/*  Bit definition for EMB_SOE register  */
#define EMB_SOE_SOE                                    (0x00000001UL)

/*  Bit definition for EMB_STAT register  */
#define EMB_STAT_PWMSF_POS                             (1U)
#define EMB_STAT_PWMSF                                 (0x00000002UL)
#define EMB_STAT_CMPF_POS                              (2U)
#define EMB_STAT_CMPF                                  (0x00000004UL)
#define EMB_STAT_SYSF_POS                              (3U)
#define EMB_STAT_SYSF                                  (0x00000008UL)
#define EMB_STAT_PWMST_POS                             (5U)
#define EMB_STAT_PWMST                                 (0x00000020UL)
#define EMB_STAT_CMPST_POS                             (6U)
#define EMB_STAT_CMPST                                 (0x00000040UL)
#define EMB_STAT_SYSST_POS                             (7U)
#define EMB_STAT_SYSST                                 (0x00000080UL)
#define EMB_STAT_PORTINF1_POS                          (8U)
#define EMB_STAT_PORTINF1                              (0x00000100UL)
#define EMB_STAT_PORTINF2_POS                          (9U)
#define EMB_STAT_PORTINF2                              (0x00000200UL)
#define EMB_STAT_PORTINF3_POS                          (10U)
#define EMB_STAT_PORTINF3                              (0x00000400UL)
#define EMB_STAT_PORTINF4_POS                          (11U)
#define EMB_STAT_PORTINF4                              (0x00000800UL)
#define EMB_STAT_PORTINST1_POS                         (14U)
#define EMB_STAT_PORTINST1                             (0x00004000UL)
#define EMB_STAT_PORTINST2_POS                         (15U)
#define EMB_STAT_PORTINST2                             (0x00008000UL)
#define EMB_STAT_PORTINST3_POS                         (16U)
#define EMB_STAT_PORTINST3                             (0x00010000UL)
#define EMB_STAT_PORTINST4_POS                         (17U)
#define EMB_STAT_PORTINST4                             (0x00020000UL)

/*  Bit definition for EMB_STATCLR register  */
#define EMB_STATCLR_PWMSFCLR_POS                       (1U)
#define EMB_STATCLR_PWMSFCLR                           (0x00000002UL)
#define EMB_STATCLR_CMPFCLR_POS                        (2U)
#define EMB_STATCLR_CMPFCLR                            (0x00000004UL)
#define EMB_STATCLR_SYSFCLR_POS                        (3U)
#define EMB_STATCLR_SYSFCLR                            (0x00000008UL)
#define EMB_STATCLR_PORTINFCLR1_POS                    (8U)
#define EMB_STATCLR_PORTINFCLR1                        (0x00000100UL)
#define EMB_STATCLR_PORTINFCLR2_POS                    (9U)
#define EMB_STATCLR_PORTINFCLR2                        (0x00000200UL)
#define EMB_STATCLR_PORTINFCLR3_POS                    (10U)
#define EMB_STATCLR_PORTINFCLR3                        (0x00000400UL)
#define EMB_STATCLR_PORTINFCLR4_POS                    (11U)
#define EMB_STATCLR_PORTINFCLR4                        (0x00000800UL)

/*  Bit definition for EMB_INTEN register  */
#define EMB_INTEN_PWMSINTEN_POS                        (1U)
#define EMB_INTEN_PWMSINTEN                            (0x00000002UL)
#define EMB_INTEN_CMPINTEN_POS                         (2U)
#define EMB_INTEN_CMPINTEN                             (0x00000004UL)
#define EMB_INTEN_SYSINTEN_POS                         (3U)
#define EMB_INTEN_SYSINTEN                             (0x00000008UL)
#define EMB_INTEN_PORTININTEN1_POS                     (8U)
#define EMB_INTEN_PORTININTEN1                         (0x00000100UL)
#define EMB_INTEN_PORTININTEN2_POS                     (9U)
#define EMB_INTEN_PORTININTEN2                         (0x00000200UL)
#define EMB_INTEN_PORTININTEN3_POS                     (10U)
#define EMB_INTEN_PORTININTEN3                         (0x00000400UL)
#define EMB_INTEN_PORTININTEN4_POS                     (11U)
#define EMB_INTEN_PORTININTEN4                         (0x00000800UL)

/*  Bit definition for EMB_RLSSEL register  */
#define EMB_RLSSEL_PWMRSEL_POS                         (1U)
#define EMB_RLSSEL_PWMRSEL                             (0x00000002UL)
#define EMB_RLSSEL_CMPRSEL_POS                         (2U)
#define EMB_RLSSEL_CMPRSEL                             (0x00000004UL)
#define EMB_RLSSEL_SYSRSEL_POS                         (3U)
#define EMB_RLSSEL_SYSRSEL                             (0x00000008UL)
#define EMB_RLSSEL_PORTINRSEL1_POS                     (8U)
#define EMB_RLSSEL_PORTINRSEL1                         (0x00000100UL)
#define EMB_RLSSEL_PORTINRSEL2_POS                     (9U)
#define EMB_RLSSEL_PORTINRSEL2                         (0x00000200UL)
#define EMB_RLSSEL_PORTINRSEL3_POS                     (10U)
#define EMB_RLSSEL_PORTINRSEL3                         (0x00000400UL)
#define EMB_RLSSEL_PORTINRSEL4_POS                     (11U)
#define EMB_RLSSEL_PORTINRSEL4                         (0x00000800UL)

