levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*******************************************************************************
                Bit definition for Peripheral ERMU
*******************************************************************************/
/*  Bit definition for ERMU_EOC register  */
#define ERMU_EOC_SET_POS                               (0U)
#define ERMU_EOC_SET                                   (0x00000001UL)
#define ERMU_EOC_CLR_POS                               (1U)
#define ERMU_EOC_CLR                                   (0x00000002UL)
#define ERMU_EOC_CTE_POS                               (16U)
#define ERMU_EOC_CTE                                   (0x00010000UL)

/*  Bit definition for ERMU_EOS register  */
#define ERMU_EOS_EOS_POS                               (0U)
#define ERMU_EOS_EOS                                   (0x00000001UL)
#define ERMU_EOS_CTS_POS                               (16U)
#define ERMU_EOS_CTS                                   (0x00010000UL)

/*  Bit definition for ERMU_EOCTCNT register  */
#define ERMU_EOCTCNT_CNT                               (0x0000FFFFUL)

/*  Bit definition for ERMU_EOCTCMP register  */
#define ERMU_EOCTCMP_CMP                               (0x0000FFFFUL)

/*  Bit definition for ERMU_EOTTC register  */
#define ERMU_EOTTC_TTE                                 (0x00000001UL)

/*  Bit definition for ERMU_EOTTCMP register  */
#define ERMU_EOTTCMP_CMP                               (0x0000FFFFUL)

/*  Bit definition for ERMU_EOOM0 register  */
#define ERMU_EOOM0_OM                                  (0xFFFFFFFFUL)

/*  Bit definition for ERMU_EOOM1 register  */
#define ERMU_EOOM1_OM                                  (0xFFFFFFFFUL)

/*  Bit definition for ERMU_WTC register  */
#define ERMU_WTC_WTE_POS                               (0U)
#define ERMU_WTC_WTE                                   (0x00000001UL)
#define ERMU_WTC_STP_POS                               (16U)
#define ERMU_WTC_STP                                   (0x00010000UL)

/*  Bit definition for ERMU_WTS register  */
#define ERMU_WTS_WTS                                   (0x00000001UL)

/*  Bit definition for ERMU_WTCNT register  */
#define ERMU_WTCNT_CNT                                 (0x0000FFFFUL)

/*  Bit definition for ERMU_WTCMP register  */
#define ERMU_WTCMP_CMP                                 (0x0000FFFFUL)

/*  Bit definition for ERMU_WTSE register  */
#define ERMU_WTSE_LPISE_POS                            (0U)
#define ERMU_WTSE_LPISE                                (0x00000001UL)
#define ERMU_WTSE_HPISE_POS                            (16U)
#define ERMU_WTSE_HPISE                                (0x00010000UL)

/*  Bit definition for ERMU_ESS register  */
#define ERMU_ESS_ESS                                   (0xFFFFFFFFUL)

/*  Bit definition for ERMU_ESSC register  */
#define ERMU_ESSC_ESSC                                 (0xFFFFFFFFUL)

/*  Bit definition for ERMU_PET register  */
#define ERMU_PET_PET                                   (0xFFFFFFFFUL)

/*  Bit definition for ERMU_RE register  */
#define ERMU_RE_RE                                     (0xFFFFFFFFUL)

/*  Bit definition for ERMU_LPIE register  */
#define ERMU_LPIE_LPIE                                 (0xFFFFFFFFUL)

/*  Bit definition for ERMU_HPIE register  */
#define ERMU_HPIE_HPIE                                 (0xFFFFFFFFUL)

/*  Bit definition for ERMU_CCPS register  */
#define ERMU_CCPS_PSE_POS                              (0U)
#define ERMU_CCPS_PSE                                  (0x00000001UL)
#define ERMU_CCPS_PSS_POS                              (16U)
#define ERMU_CCPS_PSS                                  (0xFFFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral ETH
*******************************************************************************/
/*  Bit definition for ETH_MAC_CONFIGR register  */
#define ETH_MAC_CONFIGR_RE_POS                         (2U)
#define ETH_MAC_CONFIGR_RE                             (0x00000004UL)
#define ETH_MAC_CONFIGR_TE_POS                         (3U)
#define ETH_MAC_CONFIGR_TE                             (0x00000008UL)
#define ETH_MAC_CONFIGR_DC_POS                         (4U)
#define ETH_MAC_CONFIGR_DC                             (0x00000010UL)
#define ETH_MAC_CONFIGR_BL_POS                         (5U)
#define ETH_MAC_CONFIGR_BL                             (0x00000060UL)
#define ETH_MAC_CONFIGR_BL_0                           (0x00000020UL)
#define ETH_MAC_CONFIGR_BL_1                           (0x00000040UL)
#define ETH_MAC_CONFIGR_ACS_POS                        (7U)
#define ETH_MAC_CONFIGR_ACS                            (0x00000080UL)
#define ETH_MAC_CONFIGR_DRTY_POS                       (9U)
#define ETH_MAC_CONFIGR_DRTY                           (0x00000200UL)
#define ETH_MAC_CONFIGR_IPCO_POS                       (10U)
#define ETH_MAC_CONFIGR_IPCO                           (0x00000400UL)
#define ETH_MAC_CONFIGR_DM_POS                         (11U)
#define ETH_MAC_CONFIGR_DM                             (0x00000800UL)
#define ETH_MAC_CONFIGR_LM_POS                         (12U)
#define ETH_MAC_CONFIGR_LM                             (0x00001000UL)
#define ETH_MAC_CONFIGR_DO_POS                         (13U)
#define ETH_MAC_CONFIGR_DO                             (0x00002000UL)
#define ETH_MAC_CONFIGR_FES_POS                        (14U)
#define ETH_MAC_CONFIGR_FES                            (0x00004000UL)
#define ETH_MAC_CONFIGR_DCRS_POS                       (16U)
#define ETH_MAC_CONFIGR_DCRS                           (0x00010000UL)
#define ETH_MAC_CONFIGR_IFG_POS                        (17U)
#define ETH_MAC_CONFIGR_IFG                            (0x000E0000UL)
#define ETH_MAC_CONFIGR_MJB_POS                        (22U)
#define ETH_MAC_CONFIGR_MJB                            (0x00400000UL)
#define ETH_MAC_CONFIGR_MWD_POS                        (23U)
#define ETH_MAC_CONFIGR_MWD                            (0x00800000UL)
#define ETH_MAC_CONFIGR_CST_POS                        (25U)
#define ETH_MAC_CONFIGR_CST                            (0x02000000UL)
#define ETH_MAC_CONFIGR_SAIRC_POS                      (28U)
#define ETH_MAC_CONFIGR_SAIRC                          (0x70000000UL)

/*  Bit definition for ETH_MAC_FLTCTLR register  */
#define ETH_MAC_FLTCTLR_PR_POS                         (0U)
#define ETH_MAC_FLTCTLR_PR                             (0x00000001UL)
#define ETH_MAC_FLTCTLR_HUC_POS                        (1U)
#define ETH_MAC_FLTCTLR_HUC                            (0x00000002UL)
#define ETH_MAC_FLTCTLR_HMC_POS                        (2U)
#define ETH_MAC_FLTCTLR_HMC                            (0x00000004UL)
#define ETH_MAC_FLTCTLR_DAIF_POS                       (3U)
#define ETH_MAC_FLTCTLR_DAIF                           (0x00000008UL)
#define ETH_MAC_FLTCTLR_PMF_POS                        (4U)
#define ETH_MAC_FLTCTLR_PMF                            (0x00000010UL)
#define ETH_MAC_FLTCTLR_DBF_POS                        (5U)
#define ETH_MAC_FLTCTLR_DBF                            (0x00000020UL)
#define ETH_MAC_FLTCTLR_PCF_POS                        (6U)
#define ETH_MAC_FLTCTLR_PCF                            (0x000000C0UL)
#define ETH_MAC_FLTCTLR_PCF_0                          (0x00000040UL)
#define ETH_MAC_FLTCTLR_PCF_1                          (0x00000080UL)
#define ETH_MAC_FLTCTLR_SAIF_POS                       (8U)
#define ETH_MAC_FLTCTLR_SAIF                           (0x00000100UL)
#define ETH_MAC_FLTCTLR_SAF_POS                        (9U)
#define ETH_MAC_FLTCTLR_SAF                            (0x00000200UL)
#define ETH_MAC_FLTCTLR_HPF_POS                        (10U)
#define ETH_MAC_FLTCTLR_HPF                            (0x00000400UL)
#define ETH_MAC_FLTCTLR_VTFE_POS                       (16U)
#define ETH_MAC_FLTCTLR_VTFE                           (0x00010000UL)
#define ETH_MAC_FLTCTLR_IPFE_POS                       (20U)
#define ETH_MAC_FLTCTLR_IPFE                           (0x00100000UL)
#define ETH_MAC_FLTCTLR_DNTU_POS                       (21U)
#define ETH_MAC_FLTCTLR_DNTU                           (0x00200000UL)
#define ETH_MAC_FLTCTLR_RA_POS                         (31U)
#define ETH_MAC_FLTCTLR_RA                             (0x80000000UL)

/*  Bit definition for ETH_MAC_HASHTHR register  */
#define ETH_MAC_HASHTHR                                (0xFFFFFFFFUL)

