levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for ETH_MMC_TITCTLR register  */
#define ETH_MMC_TITCTLR_TXBGIM_POS                     (2U)
#define ETH_MMC_TITCTLR_TXBGIM                         (0x00000004UL)
#define ETH_MMC_TITCTLR_TXMGIM_POS                     (3U)
#define ETH_MMC_TITCTLR_TXMGIM                         (0x00000008UL)
#define ETH_MMC_TITCTLR_TXDEEIM_POS                    (16U)
#define ETH_MMC_TITCTLR_TXDEEIM                        (0x00010000UL)
#define ETH_MMC_TITCTLR_TXLCEIM_POS                    (17U)
#define ETH_MMC_TITCTLR_TXLCEIM                        (0x00020000UL)
#define ETH_MMC_TITCTLR_TXECEIM_POS                    (18U)
#define ETH_MMC_TITCTLR_TXECEIM                        (0x00040000UL)
#define ETH_MMC_TITCTLR_TXCAEIM_POS                    (19U)
#define ETH_MMC_TITCTLR_TXCAEIM                        (0x00080000UL)
#define ETH_MMC_TITCTLR_TXUGIM_POS                     (21U)
#define ETH_MMC_TITCTLR_TXUGIM                         (0x00200000UL)
#define ETH_MMC_TITCTLR_TXEDEIM_POS                    (22U)
#define ETH_MMC_TITCTLR_TXEDEIM                        (0x00400000UL)

/*  Bit definition for ETH_MMC_TXBRGFR register  */
#define ETH_MMC_TXBRGFR_TXBRGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXMUGFR register  */
#define ETH_MMC_TXMUGFR_TXMUGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXDEEFR register  */
#define ETH_MMC_TXDEEFR_TXDEECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXLCEFR register  */
#define ETH_MMC_TXLCEFR_TXLCECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXECEFR register  */
#define ETH_MMC_TXECEFR_TXECECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXCAEFR register  */
#define ETH_MMC_TXCAEFR_TXCAECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXUNGFR register  */
#define ETH_MMC_TXUNGFR_TXUNGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_TXEDEFR register  */
#define ETH_MMC_TXEDEFR_TXEDECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXBRGFR register  */
#define ETH_MMC_RXBRGFR_RXBRGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXMUGFR register  */
#define ETH_MMC_RXMUGFR_RXMUGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXCREFR register  */
#define ETH_MMC_RXCREFR_RXCRECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXALEFR register  */
#define ETH_MMC_RXALEFR_RXALECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXRUEFR register  */
#define ETH_MMC_RXRUEFR_RXRUECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXUNGFR register  */
#define ETH_MMC_RXUNGFR_RXUNGCNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXLEEFR register  */
#define ETH_MMC_RXLEEFR_RXLEECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MMC_RXOREFR register  */
#define ETH_MMC_RXOREFR_RXORECNT                       (0x0000FFFFUL)

/*  Bit definition for ETH_MAC_L34CTLR register  */
#define ETH_MAC_L34CTLR_L3PEN_POS                      (0U)
#define ETH_MAC_L34CTLR_L3PEN                          (0x00000001UL)
#define ETH_MAC_L34CTLR_L3SAM_POS                      (2U)
#define ETH_MAC_L34CTLR_L3SAM                          (0x00000004UL)
#define ETH_MAC_L34CTLR_L3SAIM_POS                     (3U)
#define ETH_MAC_L34CTLR_L3SAIM                         (0x00000008UL)
#define ETH_MAC_L34CTLR_L3DAM_POS                      (4U)
#define ETH_MAC_L34CTLR_L3DAM                          (0x00000010UL)
#define ETH_MAC_L34CTLR_L3DAIM_POS                     (5U)
#define ETH_MAC_L34CTLR_L3DAIM                         (0x00000020UL)
#define ETH_MAC_L34CTLR_L3HSBM_POS                     (6U)
#define ETH_MAC_L34CTLR_L3HSBM                         (0x000007C0UL)
#define ETH_MAC_L34CTLR_L3HDBM_POS                     (11U)
#define ETH_MAC_L34CTLR_L3HDBM                         (0x0000F800UL)
#define ETH_MAC_L34CTLR_L4PEN_POS                      (16U)
#define ETH_MAC_L34CTLR_L4PEN                          (0x00010000UL)
#define ETH_MAC_L34CTLR_L4SPM_POS                      (18U)
#define ETH_MAC_L34CTLR_L4SPM                          (0x00040000UL)
#define ETH_MAC_L34CTLR_L4SPIM_POS                     (19U)
#define ETH_MAC_L34CTLR_L4SPIM                         (0x00080000UL)
#define ETH_MAC_L34CTLR_L4DPM_POS                      (20U)
#define ETH_MAC_L34CTLR_L4DPM                          (0x00100000UL)
#define ETH_MAC_L34CTLR_L4DPIM_POS                     (21U)
#define ETH_MAC_L34CTLR_L4DPIM                         (0x00200000UL)

/*  Bit definition for ETH_MAC_L4PORTR register  */
#define ETH_MAC_L4PORTR_L4SPVAL_POS                    (0U)
#define ETH_MAC_L4PORTR_L4SPVAL                        (0x0000FFFFUL)
#define ETH_MAC_L4PORTR_L4DPVAL_POS                    (16U)
#define ETH_MAC_L4PORTR_L4DPVAL                        (0xFFFF0000UL)

/*  Bit definition for ETH_MAC_L3ADDRR0 register  */
#define ETH_MAC_L3ADDRR0                               (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_L3ADDRR1 register  */
#define ETH_MAC_L3ADDRR1                               (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_L3ADDRR2 register  */
#define ETH_MAC_L3ADDRR2                               (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_L3ADDRR3 register  */
#define ETH_MAC_L3ADDRR3                               (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_VTACTLR register  */
#define ETH_MAC_VTACTLR_VLANV_POS                      (0U)
#define ETH_MAC_VTACTLR_VLANV                          (0x0000FFFFUL)
#define ETH_MAC_VTACTLR_VLANC_POS                      (16U)
#define ETH_MAC_VTACTLR_VLANC                          (0x00030000UL)
#define ETH_MAC_VTACTLR_VLANC_0                        (0x00010000UL)
#define ETH_MAC_VTACTLR_VLANC_1                        (0x00020000UL)
#define ETH_MAC_VTACTLR_VLANS_POS                      (18U)
#define ETH_MAC_VTACTLR_VLANS                          (0x00040000UL)

/*  Bit definition for ETH_MAC_VLAHTBR register  */
#define ETH_MAC_VLAHTBR_VLHT                           (0x0000FFFFUL)

