levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for ETH_DMA_REVWDTR register  */
#define ETH_DMA_REVWDTR_RIWT                           (0x000000FFUL)

/*  Bit definition for ETH_DMA_CHTXDER register  */
#define ETH_DMA_CHTXDER                                (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHRXDER register  */
#define ETH_DMA_CHRXDER                                (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHTXBFR register  */
#define ETH_DMA_CHTXBFR                                (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHRXBFR register  */
#define ETH_DMA_CHRXBFR                                (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral FCM
*******************************************************************************/
/*  Bit definition for FCM_LVR register  */
#define FCM_LVR_LVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_UVR register  */
#define FCM_UVR_UVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_CNTR register  */
#define FCM_CNTR_CNTR                                  (0x0000FFFFUL)

/*  Bit definition for FCM_MCCR register  */
#define FCM_MCCR_MDIVS_POS                             (0U)
#define FCM_MCCR_MDIVS                                 (0x00000003UL)
#define FCM_MCCR_MCKS_POS                              (4U)
#define FCM_MCCR_MCKS                                  (0x000000F0UL)

/*  Bit definition for FCM_RCCR register  */
#define FCM_RCCR_RDIVS_POS                             (0U)
#define FCM_RCCR_RDIVS                                 (0x00000003UL)
#define FCM_RCCR_RCKS_POS                              (3U)
#define FCM_RCCR_RCKS                                  (0x00000078UL)
#define FCM_RCCR_INEXS_POS                             (7U)
#define FCM_RCCR_INEXS                                 (0x00000080UL)
#define FCM_RCCR_DNFS_POS                              (8U)
#define FCM_RCCR_DNFS                                  (0x00000300UL)
#define FCM_RCCR_DNFS_0                                (0x00000100UL)
#define FCM_RCCR_DNFS_1                                (0x00000200UL)
#define FCM_RCCR_EDGES_POS                             (12U)
#define FCM_RCCR_EDGES                                 (0x00003000UL)
#define FCM_RCCR_EDGES_0                               (0x00001000UL)
#define FCM_RCCR_EDGES_1                               (0x00002000UL)
#define FCM_RCCR_EXREFE_POS                            (15U)
#define FCM_RCCR_EXREFE                                (0x00008000UL)

/*  Bit definition for FCM_RIER register  */
#define FCM_RIER_ERRIE_POS                             (0U)
#define FCM_RIER_ERRIE                                 (0x00000001UL)
#define FCM_RIER_MENDIE_POS                            (1U)
#define FCM_RIER_MENDIE                                (0x00000002UL)
#define FCM_RIER_OVFIE_POS                             (2U)
#define FCM_RIER_OVFIE                                 (0x00000004UL)
#define FCM_RIER_ERRINTRS_POS                          (4U)
#define FCM_RIER_ERRINTRS                              (0x00000010UL)
#define FCM_RIER_ERRRE_POS                             (7U)
#define FCM_RIER_ERRRE                                 (0x00000080UL)

/*  Bit definition for FCM_CLR register  */
#define FCM_CLR_ERRFCLR_POS                            (0U)
#define FCM_CLR_ERRFCLR                                (0x00000001UL)
#define FCM_CLR_MENDFCLR_POS                           (1U)
#define FCM_CLR_MENDFCLR                               (0x00000002UL)
#define FCM_CLR_OVFCLR_POS                             (2U)
#define FCM_CLR_OVFCLR                                 (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral FCM_COM
*******************************************************************************/
/*  Bit definition for FCM_COM_STR register  */
#define FCM_COM_STR_START1_POS                         (0U)
#define FCM_COM_STR_START1                             (0x00000001UL)
#define FCM_COM_STR_START2_POS                         (1U)
#define FCM_COM_STR_START2                             (0x00000002UL)
#define FCM_COM_STR_START3_POS                         (2U)
#define FCM_COM_STR_START3                             (0x00000004UL)
#define FCM_COM_STR_START4_POS                         (3U)
#define FCM_COM_STR_START4                             (0x00000008UL)

/*  Bit definition for FCM_COM_SR register  */
#define FCM_COM_SR_ERRF1_POS                           (0U)
#define FCM_COM_SR_ERRF1                               (0x00000001UL)
#define FCM_COM_SR_MENDF1_POS                          (1U)
#define FCM_COM_SR_MENDF1                              (0x00000002UL)
#define FCM_COM_SR_OVF1_POS                            (2U)
#define FCM_COM_SR_OVF1                                (0x00000004UL)
#define FCM_COM_SR_ERRF2_POS                           (3U)
#define FCM_COM_SR_ERRF2                               (0x00000008UL)
#define FCM_COM_SR_MENDF2_POS                          (4U)
#define FCM_COM_SR_MENDF2                              (0x00000010UL)
#define FCM_COM_SR_OVF2_POS                            (5U)
#define FCM_COM_SR_OVF2                                (0x00000020UL)
#define FCM_COM_SR_ERRF3_POS                           (6U)
#define FCM_COM_SR_ERRF3                               (0x00000040UL)
#define FCM_COM_SR_MENDF3_POS                          (7U)
#define FCM_COM_SR_MENDF3                              (0x00000080UL)
#define FCM_COM_SR_OVF3_POS                            (8U)
#define FCM_COM_SR_OVF3                                (0x00000100UL)
#define FCM_COM_SR_ERRF4_POS                           (9U)
#define FCM_COM_SR_ERRF4                               (0x00000200UL)
#define FCM_COM_SR_MENDF4_POS                          (10U)
#define FCM_COM_SR_MENDF4                              (0x00000400UL)
#define FCM_COM_SR_OVF4_POS                            (11U)
#define FCM_COM_SR_OVF4                                (0x00000800UL)

