levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*******************************************************************************
                Bit definition for Peripheral INTC
*******************************************************************************/
/*  Bit definition for INTC_NOCCR register  */
#define INTC_NOCCR_NOCSEL_POS                          (12U)
#define INTC_NOCCR_NOCSEL                              (0x00003000UL)
#define INTC_NOCCR_NOCSEL_0                            (0x00001000UL)
#define INTC_NOCCR_NOCSEL_1                            (0x00002000UL)

/*  Bit definition for INTC_NMIER register  */
#define INTC_NMIER_SWDTEN_POS                          (1U)
#define INTC_NMIER_SWDTEN                              (0x00000002UL)
#define INTC_NMIER_PVD1EN_POS                          (2U)
#define INTC_NMIER_PVD1EN                              (0x00000004UL)
#define INTC_NMIER_PVD2EN_POS                          (3U)
#define INTC_NMIER_PVD2EN                              (0x00000008UL)
#define INTC_NMIER_XTALSTPEN_POS                       (5U)
#define INTC_NMIER_XTALSTPEN                           (0x00000020UL)
#define INTC_NMIER_RECCERREN_POS                       (9U)
#define INTC_NMIER_RECCERREN                           (0x00000200UL)
#define INTC_NMIER_BUSERREN_POS                        (10U)
#define INTC_NMIER_BUSERREN                            (0x00000400UL)
#define INTC_NMIER_WDTEN_POS                           (11U)
#define INTC_NMIER_WDTEN                               (0x00000800UL)
#define INTC_NMIER_FECCERREN_POS                       (12U)
#define INTC_NMIER_FECCERREN                           (0x00001000UL)
#define INTC_NMIER_ERMUEN_POS                          (13U)
#define INTC_NMIER_ERMUEN                              (0x00002000UL)

/*  Bit definition for INTC_NMIFR register  */
#define INTC_NMIFR_SWDTF_POS                           (1U)
#define INTC_NMIFR_SWDTF                               (0x00000002UL)
#define INTC_NMIFR_PVD1F_POS                           (2U)
#define INTC_NMIFR_PVD1F                               (0x00000004UL)
#define INTC_NMIFR_PVD2F_POS                           (3U)
#define INTC_NMIFR_PVD2F                               (0x00000008UL)
#define INTC_NMIFR_XTALSTPF_POS                        (5U)
#define INTC_NMIFR_XTALSTPF                            (0x00000020UL)
#define INTC_NMIFR_RECCERRF_POS                        (9U)
#define INTC_NMIFR_RECCERRF                            (0x00000200UL)
#define INTC_NMIFR_BUSERRF_POS                         (10U)
#define INTC_NMIFR_BUSERRF                             (0x00000400UL)
#define INTC_NMIFR_WDTF_POS                            (11U)
#define INTC_NMIFR_WDTF                                (0x00000800UL)
#define INTC_NMIFR_FECCERRF_POS                        (12U)
#define INTC_NMIFR_FECCERRF                            (0x00001000UL)
#define INTC_NMIFR_ERMUF_POS                           (13U)
#define INTC_NMIFR_ERMUF                               (0x00002000UL)

/*  Bit definition for INTC_NMIFCR register  */
#define INTC_NMIFCR_SWDTCLR_POS                        (1U)
#define INTC_NMIFCR_SWDTCLR                            (0x00000002UL)
#define INTC_NMIFCR_PVD1CLR_POS                        (2U)
#define INTC_NMIFCR_PVD1CLR                            (0x00000004UL)
#define INTC_NMIFCR_PVD2CLR_POS                        (3U)
#define INTC_NMIFCR_PVD2CLR                            (0x00000008UL)
#define INTC_NMIFCR_XTALSTPCLR_POS                     (5U)
#define INTC_NMIFCR_XTALSTPCLR                         (0x00000020UL)
#define INTC_NMIFCR_RECCERRCLR_POS                     (9U)
#define INTC_NMIFCR_RECCERRCLR                         (0x00000200UL)
#define INTC_NMIFCR_BUSERRCLR_POS                      (10U)
#define INTC_NMIFCR_BUSERRCLR                          (0x00000400UL)
#define INTC_NMIFCR_WDTCLR_POS                         (11U)
#define INTC_NMIFCR_WDTCLR                             (0x00000800UL)
#define INTC_NMIFCR_FECCERRCLR_POS                     (12U)
#define INTC_NMIFCR_FECCERRCLR                         (0x00001000UL)
#define INTC_NMIFCR_ERMUCLR_POS                        (13U)
#define INTC_NMIFCR_ERMUCLR                            (0x00002000UL)

/*  Bit definition for INTC_EIRQCR register  */
#define INTC_EIRQCR_EIRQTRG_POS                        (0U)
#define INTC_EIRQCR_EIRQTRG                            (0x00000003UL)
#define INTC_EIRQCR_EIRQTRG_0                          (0x00000001UL)
#define INTC_EIRQCR_EIRQTRG_1                          (0x00000002UL)
#define INTC_EIRQCR_EISMPCLK_POS                       (4U)
#define INTC_EIRQCR_EISMPCLK                           (0x00000030UL)
#define INTC_EIRQCR_EISMPCLK_0                         (0x00000010UL)
#define INTC_EIRQCR_EISMPCLK_1                         (0x00000020UL)
#define INTC_EIRQCR_EFEN_POS                           (7U)
#define INTC_EIRQCR_EFEN                               (0x00000080UL)
#define INTC_EIRQCR_NOCEN_POS                          (15U)
#define INTC_EIRQCR_NOCEN                              (0x00008000UL)
#define INTC_EIRQCR_NFSEL_POS                          (16U)
#define INTC_EIRQCR_NFSEL                              (0x00FF0000UL)

/*  Bit definition for INTC_WKEN register  */
#define INTC_WKEN_EIRQWKEN_POS                         (0U)
#define INTC_WKEN_EIRQWKEN                             (0x0000FFFFUL)
#define INTC_WKEN_EIRQWKEN_0                           (0x00000001UL)
#define INTC_WKEN_EIRQWKEN_1                           (0x00000002UL)
#define INTC_WKEN_EIRQWKEN_2                           (0x00000004UL)
#define INTC_WKEN_EIRQWKEN_3                           (0x00000008UL)
#define INTC_WKEN_EIRQWKEN_4                           (0x00000010UL)
#define INTC_WKEN_EIRQWKEN_5                           (0x00000020UL)
#define INTC_WKEN_EIRQWKEN_6                           (0x00000040UL)
#define INTC_WKEN_EIRQWKEN_7                           (0x00000080UL)
#define INTC_WKEN_EIRQWKEN_8                           (0x00000100UL)
#define INTC_WKEN_EIRQWKEN_9                           (0x00000200UL)
#define INTC_WKEN_EIRQWKEN_10                          (0x00000400UL)
#define INTC_WKEN_EIRQWKEN_11                          (0x00000800UL)
#define INTC_WKEN_EIRQWKEN_12                          (0x00001000UL)
#define INTC_WKEN_EIRQWKEN_13                          (0x00002000UL)
#define INTC_WKEN_EIRQWKEN_14                          (0x00004000UL)
#define INTC_WKEN_EIRQWKEN_15                          (0x00008000UL)
#define INTC_WKEN_SWDTWKEN_POS                         (16U)
#define INTC_WKEN_SWDTWKEN                             (0x00010000UL)
#define INTC_WKEN_PVD1WKEN_POS                         (17U)
#define INTC_WKEN_PVD1WKEN                             (0x00020000UL)
#define INTC_WKEN_PVD2WKEN_POS                         (18U)
#define INTC_WKEN_PVD2WKEN                             (0x00040000UL)
#define INTC_WKEN_CMPWKEN_POS                          (19U)
#define INTC_WKEN_CMPWKEN                              (0x00080000UL)
#define INTC_WKEN_WKTMWKEN_POS                         (20U)
#define INTC_WKEN_WKTMWKEN                             (0x00100000UL)
#define INTC_WKEN_RTCALMWKEN_POS                       (21U)
#define INTC_WKEN_RTCALMWKEN                           (0x00200000UL)
#define INTC_WKEN_RTCPRDWKEN_POS                       (22U)
#define INTC_WKEN_RTCPRDWKEN                           (0x00400000UL)
#define INTC_WKEN_TMR0CMPWKEN_POS                      (23U)
#define INTC_WKEN_TMR0CMPWKEN                          (0x00800000UL)
#define INTC_WKEN_TMR2GCMWKEN_POS                      (24U)
#define INTC_WKEN_TMR2GCMWKEN                          (0x01000000UL)
#define INTC_WKEN_TMR2OVFWKEN_POS                      (25U)
#define INTC_WKEN_TMR2OVFWKEN                          (0x02000000UL)
#define INTC_WKEN_RXWKEN_POS                           (26U)
#define INTC_WKEN_RXWKEN                               (0x04000000UL)
#define INTC_WKEN_USHWKEN_POS                          (27U)
#define INTC_WKEN_USHWKEN                              (0x08000000UL)
#define INTC_WKEN_USFWKEN_POS                          (28U)
#define INTC_WKEN_USFWKEN                              (0x10000000UL)
#define INTC_WKEN_ETHWKEN_POS                          (29U)
#define INTC_WKEN_ETHWKEN                              (0x20000000UL)

/*  Bit definition for INTC_EIFR register  */
#define INTC_EIFR_EIFR0_POS                            (0U)
#define INTC_EIFR_EIFR0                                (0x00000001UL)
#define INTC_EIFR_EIFR1_POS                            (1U)
#define INTC_EIFR_EIFR1                                (0x00000002UL)
#define INTC_EIFR_EIFR2_POS                            (2U)
#define INTC_EIFR_EIFR2                                (0x00000004UL)
#define INTC_EIFR_EIFR3_POS                            (3U)
#define INTC_EIFR_EIFR3                                (0x00000008UL)
#define INTC_EIFR_EIFR4_POS                            (4U)
#define INTC_EIFR_EIFR4                                (0x00000010UL)
#define INTC_EIFR_EIFR5_POS                            (5U)
#define INTC_EIFR_EIFR5                                (0x00000020UL)
#define INTC_EIFR_EIFR6_POS                            (6U)
#define INTC_EIFR_EIFR6                                (0x00000040UL)
#define INTC_EIFR_EIFR7_POS                            (7U)
#define INTC_EIFR_EIFR7                                (0x00000080UL)
#define INTC_EIFR_EIFR8_POS                            (8U)
#define INTC_EIFR_EIFR8                                (0x00000100UL)
#define INTC_EIFR_EIFR9_POS                            (9U)
#define INTC_EIFR_EIFR9                                (0x00000200UL)
#define INTC_EIFR_EIFR10_POS                           (10U)
#define INTC_EIFR_EIFR10                               (0x00000400UL)
#define INTC_EIFR_EIFR11_POS                           (11U)
#define INTC_EIFR_EIFR11                               (0x00000800UL)
#define INTC_EIFR_EIFR12_POS                           (12U)
#define INTC_EIFR_EIFR12                               (0x00001000UL)
#define INTC_EIFR_EIFR13_POS                           (13U)
#define INTC_EIFR_EIFR13                               (0x00002000UL)
#define INTC_EIFR_EIFR14_POS                           (14U)
#define INTC_EIFR_EIFR14                               (0x00004000UL)
#define INTC_EIFR_EIFR15_POS                           (15U)
#define INTC_EIFR_EIFR15                               (0x00008000UL)

/*  Bit definition for INTC_EIFCR register  */
#define INTC_EIFCR_EIFCR0_POS                          (0U)
#define INTC_EIFCR_EIFCR0                              (0x00000001UL)
#define INTC_EIFCR_EIFCR1_POS                          (1U)
#define INTC_EIFCR_EIFCR1                              (0x00000002UL)
#define INTC_EIFCR_EIFCR2_POS                          (2U)
#define INTC_EIFCR_EIFCR2                              (0x00000004UL)
#define INTC_EIFCR_EIFCR3_POS                          (3U)
#define INTC_EIFCR_EIFCR3                              (0x00000008UL)
#define INTC_EIFCR_EIFCR4_POS                          (4U)
#define INTC_EIFCR_EIFCR4                              (0x00000010UL)
#define INTC_EIFCR_EIFCR5_POS                          (5U)
#define INTC_EIFCR_EIFCR5                              (0x00000020UL)
#define INTC_EIFCR_EIFCR6_POS                          (6U)
#define INTC_EIFCR_EIFCR6                              (0x00000040UL)
#define INTC_EIFCR_EIFCR7_POS                          (7U)
#define INTC_EIFCR_EIFCR7                              (0x00000080UL)
#define INTC_EIFCR_EIFCR8_POS                          (8U)
#define INTC_EIFCR_EIFCR8                              (0x00000100UL)
#define INTC_EIFCR_EIFCR9_POS                          (9U)
#define INTC_EIFCR_EIFCR9                              (0x00000200UL)
#define INTC_EIFCR_EIFCR10_POS                         (10U)
#define INTC_EIFCR_EIFCR10                             (0x00000400UL)
#define INTC_EIFCR_EIFCR11_POS                         (11U)
#define INTC_EIFCR_EIFCR11                             (0x00000800UL)
#define INTC_EIFCR_EIFCR12_POS                         (12U)
#define INTC_EIFCR_EIFCR12                             (0x00001000UL)
#define INTC_EIFCR_EIFCR13_POS                         (13U)
#define INTC_EIFCR_EIFCR13                             (0x00002000UL)
#define INTC_EIFCR_EIFCR14_POS                         (14U)
#define INTC_EIFCR_EIFCR14                             (0x00004000UL)
#define INTC_EIFCR_EIFCR15_POS                         (15U)
#define INTC_EIFCR_EIFCR15                             (0x00008000UL)

/*  Bit definition for INTC_INTSEL register  */
#define INTC_INTSEL_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_VSSEL register  */
#define INTC_VSSEL_VSEL0_POS                           (0U)
#define INTC_VSSEL_VSEL0                               (0x00000001UL)
#define INTC_VSSEL_VSEL1_POS                           (1U)
#define INTC_VSSEL_VSEL1                               (0x00000002UL)
#define INTC_VSSEL_VSEL2_POS                           (2U)
#define INTC_VSSEL_VSEL2                               (0x00000004UL)
#define INTC_VSSEL_VSEL3_POS                           (3U)
#define INTC_VSSEL_VSEL3                               (0x00000008UL)
#define INTC_VSSEL_VSEL4_POS                           (4U)
#define INTC_VSSEL_VSEL4                               (0x00000010UL)
#define INTC_VSSEL_VSEL5_POS                           (5U)
#define INTC_VSSEL_VSEL5                               (0x00000020UL)
#define INTC_VSSEL_VSEL6_POS                           (6U)
#define INTC_VSSEL_VSEL6                               (0x00000040UL)
#define INTC_VSSEL_VSEL7_POS                           (7U)
#define INTC_VSSEL_VSEL7                               (0x00000080UL)
#define INTC_VSSEL_VSEL8_POS                           (8U)
#define INTC_VSSEL_VSEL8                               (0x00000100UL)
#define INTC_VSSEL_VSEL9_POS                           (9U)
#define INTC_VSSEL_VSEL9                               (0x00000200UL)
#define INTC_VSSEL_VSEL10_POS                          (10U)
#define INTC_VSSEL_VSEL10                              (0x00000400UL)
#define INTC_VSSEL_VSEL11_POS                          (11U)
#define INTC_VSSEL_VSEL11                              (0x00000800UL)
#define INTC_VSSEL_VSEL12_POS                          (12U)
#define INTC_VSSEL_VSEL12                              (0x00001000UL)
#define INTC_VSSEL_VSEL13_POS                          (13U)
#define INTC_VSSEL_VSEL13                              (0x00002000UL)
#define INTC_VSSEL_VSEL14_POS                          (14U)
#define INTC_VSSEL_VSEL14                              (0x00004000UL)
#define INTC_VSSEL_VSEL15_POS                          (15U)
#define INTC_VSSEL_VSEL15                              (0x00008000UL)
#define INTC_VSSEL_VSEL16_POS                          (16U)
#define INTC_VSSEL_VSEL16                              (0x00010000UL)
#define INTC_VSSEL_VSEL17_POS                          (17U)
#define INTC_VSSEL_VSEL17                              (0x00020000UL)
#define INTC_VSSEL_VSEL18_POS                          (18U)
#define INTC_VSSEL_VSEL18                              (0x00040000UL)
#define INTC_VSSEL_VSEL19_POS                          (19U)
#define INTC_VSSEL_VSEL19                              (0x00080000UL)
#define INTC_VSSEL_VSEL20_POS                          (20U)
#define INTC_VSSEL_VSEL20                              (0x00100000UL)
#define INTC_VSSEL_VSEL21_POS                          (21U)
#define INTC_VSSEL_VSEL21                              (0x00200000UL)
#define INTC_VSSEL_VSEL22_POS                          (22U)
#define INTC_VSSEL_VSEL22                              (0x00400000UL)
#define INTC_VSSEL_VSEL23_POS                          (23U)
#define INTC_VSSEL_VSEL23                              (0x00800000UL)
#define INTC_VSSEL_VSEL24_POS                          (24U)
#define INTC_VSSEL_VSEL24                              (0x01000000UL)
#define INTC_VSSEL_VSEL25_POS                          (25U)
#define INTC_VSSEL_VSEL25                              (0x02000000UL)
#define INTC_VSSEL_VSEL26_POS                          (26U)
#define INTC_VSSEL_VSEL26                              (0x04000000UL)
#define INTC_VSSEL_VSEL27_POS                          (27U)
#define INTC_VSSEL_VSEL27                              (0x08000000UL)
#define INTC_VSSEL_VSEL28_POS                          (28U)
#define INTC_VSSEL_VSEL28                              (0x10000000UL)
#define INTC_VSSEL_VSEL29_POS                          (29U)
#define INTC_VSSEL_VSEL29                              (0x20000000UL)
#define INTC_VSSEL_VSEL30_POS                          (30U)
#define INTC_VSSEL_VSEL30                              (0x40000000UL)
#define INTC_VSSEL_VSEL31_POS                          (31U)
#define INTC_VSSEL_VSEL31                              (0x80000000UL)

/*  Bit definition for INTC_SWIER register  */
#define INTC_SWIER_SWIE0_POS                           (0U)
#define INTC_SWIER_SWIE0                               (0x00000001UL)
#define INTC_SWIER_SWIE1_POS                           (1U)
#define INTC_SWIER_SWIE1                               (0x00000002UL)
#define INTC_SWIER_SWIE2_POS                           (2U)
#define INTC_SWIER_SWIE2                               (0x00000004UL)
#define INTC_SWIER_SWIE3_POS                           (3U)
#define INTC_SWIER_SWIE3                               (0x00000008UL)
#define INTC_SWIER_SWIE4_POS                           (4U)
#define INTC_SWIER_SWIE4                               (0x00000010UL)
#define INTC_SWIER_SWIE5_POS                           (5U)
#define INTC_SWIER_SWIE5                               (0x00000020UL)
#define INTC_SWIER_SWIE6_POS                           (6U)
#define INTC_SWIER_SWIE6                               (0x00000040UL)
#define INTC_SWIER_SWIE7_POS                           (7U)
#define INTC_SWIER_SWIE7                               (0x00000080UL)
#define INTC_SWIER_SWIE8_POS                           (8U)
#define INTC_SWIER_SWIE8                               (0x00000100UL)
#define INTC_SWIER_SWIE9_POS                           (9U)
#define INTC_SWIER_SWIE9                               (0x00000200UL)
#define INTC_SWIER_SWIE10_POS                          (10U)
#define INTC_SWIER_SWIE10                              (0x00000400UL)
#define INTC_SWIER_SWIE11_POS                          (11U)
#define INTC_SWIER_SWIE11                              (0x00000800UL)
#define INTC_SWIER_SWIE12_POS                          (12U)
#define INTC_SWIER_SWIE12                              (0x00001000UL)
#define INTC_SWIER_SWIE13_POS                          (13U)
#define INTC_SWIER_SWIE13                              (0x00002000UL)
#define INTC_SWIER_SWIE14_POS                          (14U)
#define INTC_SWIER_SWIE14                              (0x00004000UL)
#define INTC_SWIER_SWIE15_POS                          (15U)
#define INTC_SWIER_SWIE15                              (0x00008000UL)
#define INTC_SWIER_SWIE16_POS                          (16U)
#define INTC_SWIER_SWIE16                              (0x00010000UL)
#define INTC_SWIER_SWIE17_POS                          (17U)
#define INTC_SWIER_SWIE17                              (0x00020000UL)
#define INTC_SWIER_SWIE18_POS                          (18U)
#define INTC_SWIER_SWIE18                              (0x00040000UL)
#define INTC_SWIER_SWIE19_POS                          (19U)
#define INTC_SWIER_SWIE19                              (0x00080000UL)
#define INTC_SWIER_SWIE20_POS                          (20U)
#define INTC_SWIER_SWIE20                              (0x00100000UL)
#define INTC_SWIER_SWIE21_POS                          (21U)
#define INTC_SWIER_SWIE21                              (0x00200000UL)
#define INTC_SWIER_SWIE22_POS                          (22U)
#define INTC_SWIER_SWIE22                              (0x00400000UL)
#define INTC_SWIER_SWIE23_POS                          (23U)
#define INTC_SWIER_SWIE23                              (0x00800000UL)
#define INTC_SWIER_SWIE24_POS                          (24U)
#define INTC_SWIER_SWIE24                              (0x01000000UL)
#define INTC_SWIER_SWIE25_POS                          (25U)
#define INTC_SWIER_SWIE25                              (0x02000000UL)
#define INTC_SWIER_SWIE26_POS                          (26U)
#define INTC_SWIER_SWIE26                              (0x04000000UL)
#define INTC_SWIER_SWIE27_POS                          (27U)
#define INTC_SWIER_SWIE27                              (0x08000000UL)
#define INTC_SWIER_SWIE28_POS                          (28U)
#define INTC_SWIER_SWIE28                              (0x10000000UL)
#define INTC_SWIER_SWIE29_POS                          (29U)
#define INTC_SWIER_SWIE29                              (0x20000000UL)
#define INTC_SWIER_SWIE30_POS                          (30U)
#define INTC_SWIER_SWIE30                              (0x40000000UL)
#define INTC_SWIER_SWIE31_POS                          (31U)
#define INTC_SWIER_SWIE31                              (0x80000000UL)

