levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for NFC_ECC_SECTION_SYND34 register  */
#define NFC_ECC_SECTION_SYND34_S3_POS                  (0U)
#define NFC_ECC_SECTION_SYND34_S3                      (0x00001FFFUL)
#define NFC_ECC_SECTION_SYND34_S4_POS                  (16U)
#define NFC_ECC_SECTION_SYND34_S4                      (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SECTION_SYND56 register  */
#define NFC_ECC_SECTION_SYND56_S5_POS                  (0U)
#define NFC_ECC_SECTION_SYND56_S5                      (0x00001FFFUL)
#define NFC_ECC_SECTION_SYND56_S6_POS                  (16U)
#define NFC_ECC_SECTION_SYND56_S6                      (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SECTION_SYND78 register  */
#define NFC_ECC_SECTION_SYND78_S7_POS                  (0U)
#define NFC_ECC_SECTION_SYND78_S7                      (0x00001FFFUL)
#define NFC_ECC_SECTION_SYND78_S8_POS                  (16U)
#define NFC_ECC_SECTION_SYND78_S8                      (0x1FFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_PDR register  */
#define OTS_PDR_TSPD1_POS                              (0U)
#define OTS_PDR_TSPD1                                  (0x0000FFFFUL)
#define OTS_PDR_TSPD2_POS                              (16U)
#define OTS_PDR_TSPD2                                  (0xFFFF0000UL)

/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR register  */
#define OTS_DR                                         (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USB_SYCTLREG register  */
#define PERIC_USB_SYCTLREG_USBFS_DFB_POS               (0U)
#define PERIC_USB_SYCTLREG_USBFS_DFB                   (0x00000001UL)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN_POS             (1U)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN                 (0x00000002UL)
#define PERIC_USB_SYCTLREG_USBHS_DFB_POS               (8U)
#define PERIC_USB_SYCTLREG_USBHS_DFB                   (0x00000100UL)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN_POS             (9U)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN                 (0x00000200UL)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE_POS            (10U)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE                (0x00000400UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_USB_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_USB_SYCTLREG_USBFS_NFE                   (0x00040000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_POS               (24U)
#define PERIC_USB_SYCTLREG_USBHS_NFS                   (0x03000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_0                 (0x01000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_1                 (0x02000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFE_POS               (26U)
#define PERIC_USB_SYCTLREG_USBHS_NFE                   (0x04000000UL)

/*  Bit definition for PERIC_SDIOC_SYCTLREG register  */
#define PERIC_SDIOC_SYCTLREG_SELMMC1_POS               (1U)
#define PERIC_SDIOC_SYCTLREG_SELMMC1                   (0x00000002UL)
#define PERIC_SDIOC_SYCTLREG_SELMMC2_POS               (3U)
#define PERIC_SDIOC_SYCTLREG_SELMMC2                   (0x00000008UL)

/*  Bit definition for PERIC_NFC_STCR register  */
#define PERIC_NFC_STCR_OPENP                           (0x00000001UL)

/*  Bit definition for PERIC_EXMC_ENAR register  */
#define PERIC_EXMC_ENAR_DMCEN_POS                      (0U)
#define PERIC_EXMC_ENAR_DMCEN                          (0x00000001UL)
#define PERIC_EXMC_ENAR_SMCEN_POS                      (1U)
#define PERIC_EXMC_ENAR_SMCEN                          (0x00000002UL)
#define PERIC_EXMC_ENAR_NFCEN_POS                      (2U)
#define PERIC_EXMC_ENAR_NFCEN                          (0x00000004UL)

/*  Bit definition for PERIC_ETH_MAC_IFCONFR register  */
#define PERIC_ETH_MAC_IFCONFR_IFSEL_POS                (0U)
#define PERIC_ETH_MAC_IFCONFR_IFSEL                    (0x00000001UL)
#define PERIC_ETH_MAC_IFCONFR_RCKINV_POS               (4U)
#define PERIC_ETH_MAC_IFCONFR_RCKINV                   (0x00000010UL)
#define PERIC_ETH_MAC_IFCONFR_TCKINV_POS               (5U)
#define PERIC_ETH_MAC_IFCONFR_TCKINV                   (0x00000020UL)

/*  Bit definition for PERIC_TMR_SYNENR1 register  */
#define PERIC_TMR_SYNENR1_TMR0_1_A_POS                 (0U)
#define PERIC_TMR_SYNENR1_TMR0_1_A                     (0x00000001UL)
#define PERIC_TMR_SYNENR1_TMR0_1_B_POS                 (1U)
#define PERIC_TMR_SYNENR1_TMR0_1_B                     (0x00000002UL)
#define PERIC_TMR_SYNENR1_TMR0_2_A_POS                 (2U)
#define PERIC_TMR_SYNENR1_TMR0_2_A                     (0x00000004UL)
#define PERIC_TMR_SYNENR1_TMR0_2_B_POS                 (3U)
#define PERIC_TMR_SYNENR1_TMR0_2_B                     (0x00000008UL)
#define PERIC_TMR_SYNENR1_TMR0_3_A_POS                 (4U)
#define PERIC_TMR_SYNENR1_TMR0_3_A                     (0x00000010UL)
#define PERIC_TMR_SYNENR1_TMR0_3_B_POS                 (5U)
#define PERIC_TMR_SYNENR1_TMR0_3_B                     (0x00000020UL)
#define PERIC_TMR_SYNENR1_TMR0_4_A_POS                 (6U)
#define PERIC_TMR_SYNENR1_TMR0_4_A                     (0x00000040UL)
#define PERIC_TMR_SYNENR1_TMR0_4_B_POS                 (7U)
#define PERIC_TMR_SYNENR1_TMR0_4_B                     (0x00000080UL)
#define PERIC_TMR_SYNENR1_TMR0_5_A_POS                 (8U)
#define PERIC_TMR_SYNENR1_TMR0_5_A                     (0x00000100UL)
#define PERIC_TMR_SYNENR1_TMR0_5_B_POS                 (9U)
#define PERIC_TMR_SYNENR1_TMR0_5_B                     (0x00000200UL)
#define PERIC_TMR_SYNENR1_TMR4_1_POS                   (16U)
#define PERIC_TMR_SYNENR1_TMR4_1                       (0x00010000UL)
#define PERIC_TMR_SYNENR1_TMR4_2_POS                   (17U)
#define PERIC_TMR_SYNENR1_TMR4_2                       (0x00020000UL)
#define PERIC_TMR_SYNENR1_TMR4_3_POS                   (18U)
#define PERIC_TMR_SYNENR1_TMR4_3                       (0x00040000UL)
#define PERIC_TMR_SYNENR1_TMR6_1_POS                   (24U)
#define PERIC_TMR_SYNENR1_TMR6_1                       (0x01000000UL)
#define PERIC_TMR_SYNENR1_TMR6_2_POS                   (25U)
#define PERIC_TMR_SYNENR1_TMR6_2                       (0x02000000UL)
#define PERIC_TMR_SYNENR1_TMR6_3_POS                   (26U)
#define PERIC_TMR_SYNENR1_TMR6_3                       (0x04000000UL)
#define PERIC_TMR_SYNENR1_TMR6_4_POS                   (27U)
#define PERIC_TMR_SYNENR1_TMR6_4                       (0x08000000UL)
#define PERIC_TMR_SYNENR1_TMR6_5_POS                   (28U)
#define PERIC_TMR_SYNENR1_TMR6_5                       (0x10000000UL)
#define PERIC_TMR_SYNENR1_TMR6_6_POS                   (29U)
#define PERIC_TMR_SYNENR1_TMR6_6                       (0x20000000UL)
#define PERIC_TMR_SYNENR1_TMR6_7_POS                   (30U)
#define PERIC_TMR_SYNENR1_TMR6_7                       (0x40000000UL)
#define PERIC_TMR_SYNENR1_TMR6_8_POS                   (31U)
#define PERIC_TMR_SYNENR1_TMR6_8                       (0x80000000UL)

/*  Bit definition for PERIC_CAN_SYCTLREG register  */
#define PERIC_CAN_SYCTLREG_CAN1FDE_POS                 (0U)
#define PERIC_CAN_SYCTLREG_CAN1FDE                     (0x00000001UL)
#define PERIC_CAN_SYCTLREG_CAN2FDE_POS                 (1U)
#define PERIC_CAN_SYCTLREG_CAN2FDE                     (0x00000002UL)

/*  Bit definition for PERIC_USART1_NFC register  */
#define PERIC_USART1_NFC_USASRT1_NFS_POS               (0U)
#define PERIC_USART1_NFC_USASRT1_NFS                   (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0                 (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1                 (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS                (2U)
#define PERIC_USART1_NFC_USART1_NFE                    (0x00000004UL)

