levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for PERIC_NFC_STSR register  */
#define PERIC_NFC_STSR_CHIP_BUSY_POS                   (0U)
#define PERIC_NFC_STSR_CHIP_BUSY                       (0x000000FFUL)
#define PERIC_NFC_STSR_PECC_POS                        (8U)
#define PERIC_NFC_STSR_PECC                            (0x00000100UL)

/*  Bit definition for PERIC_TMR_SYNENR2 register  */
#define PERIC_TMR_SYNENR2_TMRA_1_POS                   (0U)
#define PERIC_TMR_SYNENR2_TMRA_1                       (0x00000001UL)
#define PERIC_TMR_SYNENR2_TMRA_2_POS                   (1U)
#define PERIC_TMR_SYNENR2_TMRA_2                       (0x00000002UL)
#define PERIC_TMR_SYNENR2_TMRA_3_POS                   (2U)
#define PERIC_TMR_SYNENR2_TMRA_3                       (0x00000004UL)
#define PERIC_TMR_SYNENR2_TMRA_4_POS                   (3U)
#define PERIC_TMR_SYNENR2_TMRA_4                       (0x00000008UL)
#define PERIC_TMR_SYNENR2_TMRA_5_POS                   (4U)
#define PERIC_TMR_SYNENR2_TMRA_5                       (0x00000010UL)
#define PERIC_TMR_SYNENR2_TMRA_6_POS                   (5U)
#define PERIC_TMR_SYNENR2_TMRA_6                       (0x00000020UL)
#define PERIC_TMR_SYNENR2_TMRA_7_POS                   (6U)
#define PERIC_TMR_SYNENR2_TMRA_7                       (0x00000040UL)
#define PERIC_TMR_SYNENR2_TMRA_8_POS                   (7U)
#define PERIC_TMR_SYNENR2_TMRA_8                       (0x00000080UL)
#define PERIC_TMR_SYNENR2_TMRA_9_POS                   (8U)
#define PERIC_TMR_SYNENR2_TMRA_9                       (0x00000100UL)
#define PERIC_TMR_SYNENR2_TMRA_10_POS                  (9U)
#define PERIC_TMR_SYNENR2_TMRA_10                      (0x00000200UL)
#define PERIC_TMR_SYNENR2_TMRA_11_POS                  (10U)
#define PERIC_TMR_SYNENR2_TMRA_11                      (0x00000400UL)
#define PERIC_TMR_SYNENR2_TMRA_12_POS                  (11U)
#define PERIC_TMR_SYNENR2_TMRA_12                      (0x00000800UL)
#define PERIC_TMR_SYNENR2_TMR2_1_A_POS                 (16U)
#define PERIC_TMR_SYNENR2_TMR2_1_A                     (0x00010000UL)
#define PERIC_TMR_SYNENR2_TMR2_1_B_POS                 (17U)
#define PERIC_TMR_SYNENR2_TMR2_1_B                     (0x00020000UL)
#define PERIC_TMR_SYNENR2_TMR2_2_A_POS                 (18U)
#define PERIC_TMR_SYNENR2_TMR2_2_A                     (0x00040000UL)
#define PERIC_TMR_SYNENR2_TMR2_2_B_POS                 (19U)
#define PERIC_TMR_SYNENR2_TMR2_2_B                     (0x00080000UL)
#define PERIC_TMR_SYNENR2_TMR2_3_A_POS                 (20U)
#define PERIC_TMR_SYNENR2_TMR2_3_A                     (0x00100000UL)
#define PERIC_TMR_SYNENR2_TMR2_3_B_POS                 (21U)
#define PERIC_TMR_SYNENR2_TMR2_3_B                     (0x00200000UL)
#define PERIC_TMR_SYNENR2_TMR2_4_A_POS                 (22U)
#define PERIC_TMR_SYNENR2_TMR2_4_A                     (0x00400000UL)
#define PERIC_TMR_SYNENR2_TMR2_4_B_POS                 (23U)
#define PERIC_TMR_SYNENR2_TMR2_4_B                     (0x00800000UL)

/*******************************************************************************
                Bit definition for Peripheral PKE
*******************************************************************************/
/*  Bit definition for PKE_RAM0_CKCR register  */
#define PKE_RAM0_CKCR_ECCMOD                           (0x00000003UL)
#define PKE_RAM0_CKCR_ECCMOD_0                         (0x00000001UL)
#define PKE_RAM0_CKCR_ECCMOD_1                         (0x00000002UL)

/*  Bit definition for PKE_RAM0_CKSR register  */
#define PKE_RAM0_CKSR_RAM_1ERR_POS                     (0U)
#define PKE_RAM0_CKSR_RAM_1ERR                         (0x00000001UL)
#define PKE_RAM0_CKSR_RAM_2ERR_POS                     (1U)
#define PKE_RAM0_CKSR_RAM_2ERR                         (0x00000002UL)

/*  Bit definition for PKE_RAM0_EIEN register  */
#define PKE_RAM0_EIEN_EIEN                             (0x00000001UL)

/*  Bit definition for PKE_RAM0_EIBIT0 register  */
#define PKE_RAM0_EIBIT0                                (0xFFFFFFFFUL)

/*  Bit definition for PKE_RAM0_EIBIT1 register  */
#define PKE_RAM0_EIBIT1_EIBIT1                         (0x0000007FUL)

/*  Bit definition for PKE_RAM0_ECCERRADDR register  */
#define PKE_RAM0_ECCERRADDR_ECCERRADDR                 (0x00001FFFUL)

/*  Bit definition for PKE_RAM1_CKCR register  */
#define PKE_RAM1_CKCR_ECCMOD                           (0x00000003UL)
#define PKE_RAM1_CKCR_ECCMOD_0                         (0x00000001UL)
#define PKE_RAM1_CKCR_ECCMOD_1                         (0x00000002UL)

/*  Bit definition for PKE_RAM1_CKSR register  */
#define PKE_RAM1_CKSR_RAM_1ERR_POS                     (0U)
#define PKE_RAM1_CKSR_RAM_1ERR                         (0x00000001UL)
#define PKE_RAM1_CKSR_RAM_2ERR_POS                     (1U)
#define PKE_RAM1_CKSR_RAM_2ERR                         (0x00000002UL)

/*  Bit definition for PKE_RAM1_EIEN register  */
#define PKE_RAM1_EIEN_EIEN                             (0x00000001UL)

/*  Bit definition for PKE_RAM1_EIBIT0 register  */
#define PKE_RAM1_EIBIT0                                (0xFFFFFFFFUL)

/*  Bit definition for PKE_RAM1_EIBIT1 register  */
#define PKE_RAM1_EIBIT1_EIBIT1                         (0x0000007FUL)

/*  Bit definition for PKE_RAM1_ECCERRADDR register  */
#define PKE_RAM1_ECCERRADDR_ECCERRADDR                 (0x00001FFFUL)

/*  Bit definition for PKE_CTRL register  */
#define PKE_CTRL_START                                 (0x00000001UL)

/*  Bit definition for PKE_CFG register  */
#define PKE_CFG_PARTIAL_RADIX_POS                      (0U)
#define PKE_CFG_PARTIAL_RADIX                          (0x00001FFFUL)
#define PKE_CFG_BASE_RADIX_POS                         (16U)
#define PKE_CFG_BASE_RADIX                             (0x00070000UL)

/*  Bit definition for PKE_MC_PTR register  */
#define PKE_MC_PTR_ADDR                                (0x00000FFFUL)

/*  Bit definition for PKE_RISR register  */
#define PKE_RISR_CORE_RIS                              (0x00000001UL)

/*  Bit definition for PKE_IMCR register  */
#define PKE_IMCR_CORE_IRQEN                            (0x00000001UL)

