levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*******************************************************************************
                Bit definition for Peripheral QSPI
*******************************************************************************/
/*  Bit definition for QSPI_CR register  */
#define QSPI_CR_MDSEL_POS                              (0U)
#define QSPI_CR_MDSEL                                  (0x00000007UL)
#define QSPI_CR_PFE_POS                                (3U)
#define QSPI_CR_PFE                                    (0x00000008UL)
#define QSPI_CR_PFSAE_POS                              (4U)
#define QSPI_CR_PFSAE                                  (0x00000010UL)
#define QSPI_CR_DCOME_POS                              (5U)
#define QSPI_CR_DCOME                                  (0x00000020UL)
#define QSPI_CR_XIPE_POS                               (6U)
#define QSPI_CR_XIPE                                   (0x00000040UL)
#define QSPI_CR_SPIMD3_POS                             (7U)
#define QSPI_CR_SPIMD3                                 (0x00000080UL)
#define QSPI_CR_IPRSL_POS                              (8U)
#define QSPI_CR_IPRSL                                  (0x00000300UL)
#define QSPI_CR_IPRSL_0                                (0x00000100UL)
#define QSPI_CR_IPRSL_1                                (0x00000200UL)
#define QSPI_CR_APRSL_POS                              (10U)
#define QSPI_CR_APRSL                                  (0x00000C00UL)
#define QSPI_CR_APRSL_0                                (0x00000400UL)
#define QSPI_CR_APRSL_1                                (0x00000800UL)
#define QSPI_CR_DPRSL_POS                              (12U)
#define QSPI_CR_DPRSL                                  (0x00003000UL)
#define QSPI_CR_DPRSL_0                                (0x00001000UL)
#define QSPI_CR_DPRSL_1                                (0x00002000UL)
#define QSPI_CR_DIV_POS                                (16U)
#define QSPI_CR_DIV                                    (0x003F0000UL)

/*  Bit definition for QSPI_CSCR register  */
#define QSPI_CSCR_SSHW_POS                             (0U)
#define QSPI_CSCR_SSHW                                 (0x0000000FUL)
#define QSPI_CSCR_SSNW_POS                             (4U)
#define QSPI_CSCR_SSNW                                 (0x00000030UL)
#define QSPI_CSCR_SSNW_0                               (0x00000010UL)
#define QSPI_CSCR_SSNW_1                               (0x00000020UL)

/*  Bit definition for QSPI_FCR register  */
#define QSPI_FCR_AWSL_POS                              (0U)
#define QSPI_FCR_AWSL                                  (0x00000003UL)
#define QSPI_FCR_AWSL_0                                (0x00000001UL)
#define QSPI_FCR_AWSL_1                                (0x00000002UL)
#define QSPI_FCR_FOUR_BIC_POS                          (2U)
#define QSPI_FCR_FOUR_BIC                              (0x00000004UL)
#define QSPI_FCR_SSNHD_POS                             (4U)
#define QSPI_FCR_SSNHD                                 (0x00000010UL)
#define QSPI_FCR_SSNLD_POS                             (5U)
#define QSPI_FCR_SSNLD                                 (0x00000020UL)
#define QSPI_FCR_WPOL_POS                              (6U)
#define QSPI_FCR_WPOL                                  (0x00000040UL)
#define QSPI_FCR_DMCYCN_POS                            (8U)
#define QSPI_FCR_DMCYCN                                (0x00000F00UL)
#define QSPI_FCR_DUTY_POS                              (15U)
#define QSPI_FCR_DUTY                                  (0x00008000UL)

/*  Bit definition for QSPI_SR register  */
#define QSPI_SR_BUSY_POS                               (0U)
#define QSPI_SR_BUSY                                   (0x00000001UL)
#define QSPI_SR_XIPF_POS                               (6U)
#define QSPI_SR_XIPF                                   (0x00000040UL)
#define QSPI_SR_RAER_POS                               (7U)
#define QSPI_SR_RAER                                   (0x00000080UL)
#define QSPI_SR_PFNUM_POS                              (8U)
#define QSPI_SR_PFNUM                                  (0x00001F00UL)
#define QSPI_SR_PFFUL_POS                              (14U)
#define QSPI_SR_PFFUL                                  (0x00004000UL)
#define QSPI_SR_PFAN_POS                               (15U)
#define QSPI_SR_PFAN                                   (0x00008000UL)

/*  Bit definition for QSPI_DCOM register  */
#define QSPI_DCOM_DCOM_POS                             (0U)
#define QSPI_DCOM_DCOM                                 (0x000000FFUL)
#define QSPI_DCOM_DCOMPRSL_POS                         (8U)
#define QSPI_DCOM_DCOMPRSL                             (0x00000300UL)
#define QSPI_DCOM_DCOMPRSL_0                           (0x00000100UL)
#define QSPI_DCOM_DCOMPRSL_1                           (0x00000200UL)

/*  Bit definition for QSPI_CCMD register  */
#define QSPI_CCMD_RIC                                  (0x000000FFUL)

/*  Bit definition for QSPI_XCMD register  */
#define QSPI_XCMD_XIPMC                                (0x000000FFUL)

/*  Bit definition for QSPI_CLR register  */
#define QSPI_CLR_RAERCLR_POS                           (7U)
#define QSPI_CLR_RAERCLR                               (0x00000080UL)

/*  Bit definition for QSPI_EXAR register  */
#define QSPI_EXAR_EXADR_POS                            (26U)
#define QSPI_EXAR_EXADR                                (0xFC000000UL)

/*******************************************************************************
                Bit definition for Peripheral RMU
*******************************************************************************/
/*  Bit definition for RMU_FRST0 register  */
#define RMU_FRST0_ERMU_POS                             (8U)
#define RMU_FRST0_ERMU                                 (0x00000100UL)
#define RMU_FRST0_PKE_POS                              (12U)
#define RMU_FRST0_PKE                                  (0x00001000UL)
#define RMU_FRST0_KEYSCAN_POS                          (13U)
#define RMU_FRST0_KEYSCAN                              (0x00002000UL)
#define RMU_FRST0_DMA1_POS                             (14U)
#define RMU_FRST0_DMA1                                 (0x00004000UL)
#define RMU_FRST0_DMA2_POS                             (15U)
#define RMU_FRST0_DMA2                                 (0x00008000UL)
#define RMU_FRST0_FCM_POS                              (16U)
#define RMU_FRST0_FCM                                  (0x00010000UL)
#define RMU_FRST0_AOS_POS                              (17U)
#define RMU_FRST0_AOS                                  (0x00020000UL)
#define RMU_FRST0_CTC_POS                              (18U)
#define RMU_FRST0_CTC                                  (0x00040000UL)
#define RMU_FRST0_MAU_POS                              (19U)
#define RMU_FRST0_MAU                                  (0x00080000UL)
#define RMU_FRST0_SKE_POS                              (20U)
#define RMU_FRST0_SKE                                  (0x00100000UL)
#define RMU_FRST0_HASH_POS                             (21U)
#define RMU_FRST0_HASH                                 (0x00200000UL)
#define RMU_FRST0_TRNG_POS                             (22U)
#define RMU_FRST0_TRNG                                 (0x00400000UL)
#define RMU_FRST0_CRC_POS                              (23U)
#define RMU_FRST0_CRC                                  (0x00800000UL)
#define RMU_FRST0_DCU1_POS                             (24U)
#define RMU_FRST0_DCU1                                 (0x01000000UL)
#define RMU_FRST0_DCU2_POS                             (25U)
#define RMU_FRST0_DCU2                                 (0x02000000UL)
#define RMU_FRST0_DCU3_POS                             (26U)
#define RMU_FRST0_DCU3                                 (0x04000000UL)
#define RMU_FRST0_DCU4_POS                             (27U)
#define RMU_FRST0_DCU4                                 (0x08000000UL)
#define RMU_FRST0_DCU5_POS                             (28U)
#define RMU_FRST0_DCU5                                 (0x10000000UL)
#define RMU_FRST0_DCU6_POS                             (29U)
#define RMU_FRST0_DCU6                                 (0x20000000UL)
#define RMU_FRST0_DCU7_POS                             (30U)
#define RMU_FRST0_DCU7                                 (0x40000000UL)
#define RMU_FRST0_DCU8_POS                             (31U)
#define RMU_FRST0_DCU8                                 (0x80000000UL)

/*  Bit definition for RMU_FRST1 register  */
#define RMU_FRST1_CAN1_POS                             (0U)
#define RMU_FRST1_CAN1                                 (0x00000001UL)
#define RMU_FRST1_CAN2_POS                             (1U)
#define RMU_FRST1_CAN2                                 (0x00000002UL)
#define RMU_FRST1_ETHMAC_POS                           (2U)
#define RMU_FRST1_ETHMAC                               (0x00000004UL)
#define RMU_FRST1_QSPI_POS                             (3U)
#define RMU_FRST1_QSPI                                 (0x00000008UL)
#define RMU_FRST1_I2C1_POS                             (4U)
#define RMU_FRST1_I2C1                                 (0x00000010UL)
#define RMU_FRST1_I2C2_POS                             (5U)
#define RMU_FRST1_I2C2                                 (0x00000020UL)
#define RMU_FRST1_I2C3_POS                             (6U)
#define RMU_FRST1_I2C3                                 (0x00000040UL)
#define RMU_FRST1_I2C4_POS                             (7U)
#define RMU_FRST1_I2C4                                 (0x00000080UL)
#define RMU_FRST1_I2C5_POS                             (8U)
#define RMU_FRST1_I2C5                                 (0x00000100UL)
#define RMU_FRST1_I2C6_POS                             (9U)
#define RMU_FRST1_I2C6                                 (0x00000200UL)
#define RMU_FRST1_SDIOC1_POS                           (10U)
#define RMU_FRST1_SDIOC1                               (0x00000400UL)
#define RMU_FRST1_SDIOC2_POS                           (11U)
#define RMU_FRST1_SDIOC2                               (0x00000800UL)
#define RMU_FRST1_I2S1_POS                             (12U)
#define RMU_FRST1_I2S1                                 (0x00001000UL)
#define RMU_FRST1_I2S2_POS                             (13U)
#define RMU_FRST1_I2S2                                 (0x00002000UL)
#define RMU_FRST1_I2S3_POS                             (14U)
#define RMU_FRST1_I2S3                                 (0x00004000UL)
#define RMU_FRST1_I2S4_POS                             (15U)
#define RMU_FRST1_I2S4                                 (0x00008000UL)
#define RMU_FRST1_SPI1_POS                             (16U)
#define RMU_FRST1_SPI1                                 (0x00010000UL)
#define RMU_FRST1_SPI2_POS                             (17U)
#define RMU_FRST1_SPI2                                 (0x00020000UL)
#define RMU_FRST1_SPI3_POS                             (18U)
#define RMU_FRST1_SPI3                                 (0x00040000UL)
#define RMU_FRST1_SPI4_POS                             (19U)
#define RMU_FRST1_SPI4                                 (0x00080000UL)
#define RMU_FRST1_SPI5_POS                             (20U)
#define RMU_FRST1_SPI5                                 (0x00100000UL)
#define RMU_FRST1_SPI6_POS                             (21U)
#define RMU_FRST1_SPI6                                 (0x00200000UL)
#define RMU_FRST1_USBFS_POS                            (22U)
#define RMU_FRST1_USBFS                                (0x00400000UL)
#define RMU_FRST1_USBHS_POS                            (23U)
#define RMU_FRST1_USBHS                                (0x00800000UL)
#define RMU_FRST1_FMAC1_POS                            (24U)
#define RMU_FRST1_FMAC1                                (0x01000000UL)
#define RMU_FRST1_FMAC2_POS                            (25U)
#define RMU_FRST1_FMAC2                                (0x02000000UL)
#define RMU_FRST1_FMAC3_POS                            (26U)
#define RMU_FRST1_FMAC3                                (0x04000000UL)
#define RMU_FRST1_FMAC4_POS                            (27U)
#define RMU_FRST1_FMAC4                                (0x08000000UL)
#define RMU_FRST1_MCAN1_POS                            (28U)
#define RMU_FRST1_MCAN1                                (0x10000000UL)
#define RMU_FRST1_MCAN2_POS                            (29U)
#define RMU_FRST1_MCAN2                                (0x20000000UL)

/*  Bit definition for RMU_FRST2 register  */
#define RMU_FRST2_TMR6_POS                             (0U)
#define RMU_FRST2_TMR6                                 (0x00000001UL)
#define RMU_FRST2_TMR4_1_POS                           (8U)
#define RMU_FRST2_TMR4_1                               (0x00000100UL)
#define RMU_FRST2_TMR4_2_POS                           (9U)
#define RMU_FRST2_TMR4_2                               (0x00000200UL)
#define RMU_FRST2_TMR4_3_POS                           (10U)
#define RMU_FRST2_TMR4_3                               (0x00000400UL)
#define RMU_FRST2_TMR0_1_POS                           (12U)
#define RMU_FRST2_TMR0_1                               (0x00001000UL)
#define RMU_FRST2_TMR0_2_POS                           (13U)
#define RMU_FRST2_TMR0_2                               (0x00002000UL)
#define RMU_FRST2_TMR0_3_POS                           (14U)
#define RMU_FRST2_TMR0_3                               (0x00004000UL)
#define RMU_FRST2_EMB_POS                              (15U)
#define RMU_FRST2_EMB                                  (0x00008000UL)
#define RMU_FRST2_TMR2_1_POS                           (16U)
#define RMU_FRST2_TMR2_1                               (0x00010000UL)
#define RMU_FRST2_TMR2_2_POS                           (17U)
#define RMU_FRST2_TMR2_2                               (0x00020000UL)
#define RMU_FRST2_TMR2_3_POS                           (18U)
#define RMU_FRST2_TMR2_3                               (0x00040000UL)
#define RMU_FRST2_TMR2_4_POS                           (19U)
#define RMU_FRST2_TMR2_4                               (0x00080000UL)
#define RMU_FRST2_TMRA_1_POS                           (20U)
#define RMU_FRST2_TMRA_1                               (0x00100000UL)
#define RMU_FRST2_TMRA_2_POS                           (21U)
#define RMU_FRST2_TMRA_2                               (0x00200000UL)
#define RMU_FRST2_TMRA_3_POS                           (22U)
#define RMU_FRST2_TMRA_3                               (0x00400000UL)
#define RMU_FRST2_TMRA_4_POS                           (23U)
#define RMU_FRST2_TMRA_4                               (0x00800000UL)
#define RMU_FRST2_TMRA_5_POS                           (24U)
#define RMU_FRST2_TMRA_5                               (0x01000000UL)
#define RMU_FRST2_TMRA_6_POS                           (25U)
#define RMU_FRST2_TMRA_6                               (0x02000000UL)
#define RMU_FRST2_TMRA_7_POS                           (26U)
#define RMU_FRST2_TMRA_7                               (0x04000000UL)
#define RMU_FRST2_TMRA_8_POS                           (27U)
#define RMU_FRST2_TMRA_8                               (0x08000000UL)
#define RMU_FRST2_TMRA_9_POS                           (28U)
#define RMU_FRST2_TMRA_9                               (0x10000000UL)
#define RMU_FRST2_TMRA_10_POS                          (29U)
#define RMU_FRST2_TMRA_10                              (0x20000000UL)
#define RMU_FRST2_TMRA_11_POS                          (30U)
#define RMU_FRST2_TMRA_11                              (0x40000000UL)
#define RMU_FRST2_TMRA_12_POS                          (31U)
#define RMU_FRST2_TMRA_12                              (0x80000000UL)

