levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*******************************************************************************
                Bit definition for Peripheral SKE
*******************************************************************************/
/*  Bit definition for SKE_CTRL register  */
#define SKE_CTRL_START                                 (0x00000001UL)

/*  Bit definition for SKE_CFG register  */
#define SKE_CFG_ALG_POS                                (0U)
#define SKE_CFG_ALG                                    (0x0000000FUL)
#define SKE_CFG_DEC_POS                                (11U)
#define SKE_CFG_DEC                                    (0x00000800UL)
#define SKE_CFG_UP_CFG_POS                             (12U)
#define SKE_CFG_UP_CFG                                 (0x00001000UL)
#define SKE_CFG_DMAEN_POS                              (16U)
#define SKE_CFG_DMAEN                                  (0x00010000UL)
#define SKE_CFG_IRQEN_POS                              (17U)
#define SKE_CFG_IRQEN                                  (0x00020000UL)
#define SKE_CFG_SEC_STAGE_POS                          (22U)
#define SKE_CFG_SEC_STAGE                              (0x00C00000UL)
#define SKE_CFG_SEC_STAGE_0                            (0x00400000UL)
#define SKE_CFG_SEC_STAGE_1                            (0x00800000UL)
#define SKE_CFG_DATA_TYPE_POS                          (24U)
#define SKE_CFG_DATA_TYPE                              (0x03000000UL)
#define SKE_CFG_DATA_TYPE_0                            (0x01000000UL)
#define SKE_CFG_DATA_TYPE_1                            (0x02000000UL)
#define SKE_CFG_MODE_POS                               (28U)
#define SKE_CFG_MODE                                   (0xF0000000UL)

/*  Bit definition for SKE_SR1 register  */
#define SKE_SR1_BUSY_POS                               (0U)
#define SKE_SR1_BUSY                                   (0x00000001UL)
#define SKE_SR1_MID_O_VALID_POS                        (1U)
#define SKE_SR1_MID_O_VALID                            (0x00000002UL)

/*  Bit definition for SKE_SR2 register  */
#define SKE_SR2_CORE_DONE                              (0x00000001UL)

/*  Bit definition for SKE_KEY register  */
#define SKE_KEY                                        (0xFFFFFFFFUL)

/*  Bit definition for SKE_AAD register  */
#define SKE_AAD                                        (0xFFFFFFFFUL)

/*  Bit definition for SKE_CLEN register  */
#define SKE_CLEN                                       (0xFFFFFFFFUL)

/*  Bit definition for SKE_IV register  */
#define SKE_IV                                         (0xFFFFFFFFUL)

/*  Bit definition for SKE_DIN_CR register  */
#define SKE_DIN_CR_LAST_LEN_POS                        (0U)
#define SKE_DIN_CR_LAST_LEN                            (0x000000FFUL)
#define SKE_DIN_CR_LAST_POS                            (16U)
#define SKE_DIN_CR_LAST                                (0x00010000UL)

/*  Bit definition for SKE_DIN register  */
#define SKE_DIN                                        (0xFFFFFFFFUL)

/*  Bit definition for SKE_DOUT register  */
#define SKE_DOUT                                       (0xFFFFFFFFUL)

/*  Bit definition for SKE_VERSION register  */
#define SKE_VERSION_MIR_POS                            (0U)
#define SKE_VERSION_MIR                                (0x0000000FUL)
#define SKE_VERSION_MAR_POS                            (4U)
#define SKE_VERSION_MAR                                (0x000000F0UL)
#define SKE_VERSION_PROJECT_POS                        (16U)
#define SKE_VERSION_PROJECT                            (0xFFFF0000UL)

/*  Bit definition for SKE_MID_IV register  */
#define SKE_MID_IV                                     (0xFFFFFFFFUL)

/*  Bit definition for SKE_MID_MAC register  */
#define SKE_MID_MAC                                    (0xFFFFFFFFUL)

/*  Bit definition for SKE_TOTAL_AAD register  */
#define SKE_TOTAL_AAD                                  (0xFFFFFFFFUL)

/*  Bit definition for SKE_TOTAL_CLEN register  */
#define SKE_TOTAL_CLEN                                 (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral SMC
*******************************************************************************/
/*  Bit definition for SMC_STSR register  */
#define SMC_STSR_STATUS                                (0x00000001UL)

/*  Bit definition for SMC_STCR0 register  */
#define SMC_STCR0_LPWIR_POS                            (2U)
#define SMC_STCR0_LPWIR                                (0x00000004UL)

/*  Bit definition for SMC_STCR1 register  */
#define SMC_STCR1_LPWOR_POS                            (2U)
#define SMC_STCR1_LPWOR                                (0x00000004UL)

/*  Bit definition for SMC_CMDR register  */
#define SMC_CMDR_CMDADD_POS                            (0U)
#define SMC_CMDR_CMDADD                                (0x000FFFFFUL)
#define SMC_CMDR_CRES_POS                              (20U)
#define SMC_CMDR_CRES                                  (0x00100000UL)
#define SMC_CMDR_CMD_POS                               (21U)
#define SMC_CMDR_CMD                                   (0x00600000UL)
#define SMC_CMDR_CMD_0                                 (0x00200000UL)
#define SMC_CMDR_CMD_1                                 (0x00400000UL)
#define SMC_CMDR_CMDCHIP_POS                           (23U)
#define SMC_CMDR_CMDCHIP                               (0x03800000UL)

/*  Bit definition for SMC_TMCR register  */
#define SMC_TMCR_T_RC_POS                              (0U)
#define SMC_TMCR_T_RC                                  (0x0000000FUL)
#define SMC_TMCR_T_WC_POS                              (4U)
#define SMC_TMCR_T_WC                                  (0x000000F0UL)
#define SMC_TMCR_T_CEOE_POS                            (8U)
#define SMC_TMCR_T_CEOE                                (0x00000700UL)
#define SMC_TMCR_T_WP_POS                              (12U)
#define SMC_TMCR_T_WP                                  (0x00007000UL)
#define SMC_TMCR_T_TR_POS                              (20U)
#define SMC_TMCR_T_TR                                  (0x00700000UL)
#define SMC_TMCR_T_ADV_POS                             (24U)
#define SMC_TMCR_T_ADV                                 (0x07000000UL)

