levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for SPI_CFG2 register  */
#define SPI_CFG2_CPHA_POS                              (0U)
#define SPI_CFG2_CPHA                                  (0x00000001UL)
#define SPI_CFG2_CPOL_POS                              (1U)
#define SPI_CFG2_CPOL                                  (0x00000002UL)
#define SPI_CFG2_MBR_POS                               (2U)
#define SPI_CFG2_MBR                                   (0x0000000CUL)
#define SPI_CFG2_MBR_0                                 (0x00000004UL)
#define SPI_CFG2_MBR_1                                 (0x00000008UL)
#define SPI_CFG2_SSA_POS                               (5U)
#define SPI_CFG2_SSA                                   (0x000000E0UL)
#define SPI_CFG2_SSA_0                                 (0x00000020UL)
#define SPI_CFG2_SSA_1                                 (0x00000040UL)
#define SPI_CFG2_SSA_2                                 (0x00000080UL)
#define SPI_CFG2_DSIZE_POS                             (8U)
#define SPI_CFG2_DSIZE                                 (0x00000F00UL)
#define SPI_CFG2_LSBF_POS                              (12U)
#define SPI_CFG2_LSBF                                  (0x00001000UL)
#define SPI_CFG2_MIDIE_POS                             (13U)
#define SPI_CFG2_MIDIE                                 (0x00002000UL)
#define SPI_CFG2_MSSDLE_POS                            (14U)
#define SPI_CFG2_MSSDLE                                (0x00004000UL)
#define SPI_CFG2_MSSIE_POS                             (15U)
#define SPI_CFG2_MSSIE                                 (0x00008000UL)

/*******************************************************************************
                Bit definition for Peripheral SRAMC
*******************************************************************************/
/*  Bit definition for SRAMC_WTCR register  */
#define SRAMC_WTCR_SRAM123RWT_POS                      (0U)
#define SRAMC_WTCR_SRAM123RWT                          (0x00000007UL)
#define SRAMC_WTCR_SRAM123WWT_POS                      (4U)
#define SRAMC_WTCR_SRAM123WWT                          (0x00000070UL)
#define SRAMC_WTCR_SRAM4RWT_POS                        (8U)
#define SRAMC_WTCR_SRAM4RWT                            (0x00000700UL)
#define SRAMC_WTCR_SRAM4WWT_POS                        (12U)
#define SRAMC_WTCR_SRAM4WWT                            (0x00007000UL)
#define SRAMC_WTCR_SRAMHRWT_POS                        (16U)
#define SRAMC_WTCR_SRAMHRWT                            (0x00070000UL)
#define SRAMC_WTCR_SRAMHWWT_POS                        (20U)
#define SRAMC_WTCR_SRAMHWWT                            (0x00700000UL)
#define SRAMC_WTCR_SRAMBRWT_POS                        (24U)
#define SRAMC_WTCR_SRAMBRWT                            (0x07000000UL)
#define SRAMC_WTCR_SRAMBWWT_POS                        (28U)
#define SRAMC_WTCR_SRAMBWWT                            (0x70000000UL)

/*  Bit definition for SRAMC_WTPR register  */
#define SRAMC_WTPR_WTPRC_POS                           (0U)
#define SRAMC_WTPR_WTPRC                               (0x00000001UL)
#define SRAMC_WTPR_WTPRKW_POS                          (1U)
#define SRAMC_WTPR_WTPRKW                              (0x000000FEUL)

/*  Bit definition for SRAMC_CKCR register  */
#define SRAMC_CKCR_CACHE_ECCOAD_POS                    (11U)
#define SRAMC_CKCR_CACHE_ECCOAD                        (0x00000800UL)
#define SRAMC_CKCR_SRAMH_ECCOAD_POS                    (12U)
#define SRAMC_CKCR_SRAMH_ECCOAD                        (0x00001000UL)
#define SRAMC_CKCR_SRAM1_ECCOAD_POS                    (13U)
#define SRAMC_CKCR_SRAM1_ECCOAD                        (0x00002000UL)
#define SRAMC_CKCR_SRAM2_ECCOAD_POS                    (14U)
#define SRAMC_CKCR_SRAM2_ECCOAD                        (0x00004000UL)
#define SRAMC_CKCR_SRAM3_ECCOAD_POS                    (15U)
#define SRAMC_CKCR_SRAM3_ECCOAD                        (0x00008000UL)
#define SRAMC_CKCR_SRAM4_ECCOAD_POS                    (16U)
#define SRAMC_CKCR_SRAM4_ECCOAD                        (0x00010000UL)
#define SRAMC_CKCR_SRAMB_ECCOAD_POS                    (17U)
#define SRAMC_CKCR_SRAMB_ECCOAD                        (0x00020000UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_POS                    (18U)
#define SRAMC_CKCR_SRAM1_ECCMOD                        (0x000C0000UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_0                      (0x00040000UL)
#define SRAMC_CKCR_SRAM1_ECCMOD_1                      (0x00080000UL)
#define SRAMC_CKCR_SRAM2_ECCMOD_POS                    (20U)
#define SRAMC_CKCR_SRAM2_ECCMOD                        (0x00300000UL)
#define SRAMC_CKCR_SRAM2_ECCMOD_0                      (0x00100000UL)
#define SRAMC_CKCR_SRAM2_ECCMOD_1                      (0x00200000UL)
#define SRAMC_CKCR_SRAM3_ECCMOD_POS                    (22U)
#define SRAMC_CKCR_SRAM3_ECCMOD                        (0x00C00000UL)
#define SRAMC_CKCR_SRAM3_ECCMOD_0                      (0x00400000UL)
#define SRAMC_CKCR_SRAM3_ECCMOD_1                      (0x00800000UL)
#define SRAMC_CKCR_SRAM4_ECCMOD_POS                    (24U)
#define SRAMC_CKCR_SRAM4_ECCMOD                        (0x03000000UL)
#define SRAMC_CKCR_SRAM4_ECCMOD_0                      (0x01000000UL)
#define SRAMC_CKCR_SRAM4_ECCMOD_1                      (0x02000000UL)
#define SRAMC_CKCR_SRAMB_ECCMOD_POS                    (26U)
#define SRAMC_CKCR_SRAMB_ECCMOD                        (0x0C000000UL)
#define SRAMC_CKCR_SRAMB_ECCMOD_0                      (0x04000000UL)
#define SRAMC_CKCR_SRAMB_ECCMOD_1                      (0x08000000UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_POS                    (28U)
#define SRAMC_CKCR_SRAMH_ECCMOD                        (0x30000000UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_0                      (0x10000000UL)
#define SRAMC_CKCR_SRAMH_ECCMOD_1                      (0x20000000UL)
#define SRAMC_CKCR_CACHE_ECCMOD_POS                    (30U)
#define SRAMC_CKCR_CACHE_ECCMOD                        (0xC0000000UL)
#define SRAMC_CKCR_CACHE_ECCMOD_0                      (0x40000000UL)
#define SRAMC_CKCR_CACHE_ECCMOD_1                      (0x80000000UL)

/*  Bit definition for SRAMC_CKPR register  */
#define SRAMC_CKPR_CKPRC_POS                           (0U)
#define SRAMC_CKPR_CKPRC                               (0x00000001UL)
#define SRAMC_CKPR_CKPRKW_POS                          (1U)
#define SRAMC_CKPR_CKPRKW                              (0x000000FEUL)

/*  Bit definition for SRAMC_CKSR register  */
#define SRAMC_CKSR_SRAM4_1ERR_POS                      (4U)
#define SRAMC_CKSR_SRAM4_1ERR                          (0x00000010UL)
#define SRAMC_CKSR_SRAM4_2ERR_POS                      (5U)
#define SRAMC_CKSR_SRAM4_2ERR                          (0x00000020UL)
#define SRAMC_CKSR_SRAMB_1ERR_POS                      (6U)
#define SRAMC_CKSR_SRAMB_1ERR                          (0x00000040UL)
#define SRAMC_CKSR_SRAMB_2ERR_POS                      (7U)
#define SRAMC_CKSR_SRAMB_2ERR                          (0x00000080UL)
#define SRAMC_CKSR_SRAM1_1ERR_POS                      (9U)
#define SRAMC_CKSR_SRAM1_1ERR                          (0x00000200UL)
#define SRAMC_CKSR_SRAM1_2ERR_POS                      (10U)
#define SRAMC_CKSR_SRAM1_2ERR                          (0x00000400UL)
#define SRAMC_CKSR_SRAM2_1ERR_POS                      (11U)
#define SRAMC_CKSR_SRAM2_1ERR                          (0x00000800UL)
#define SRAMC_CKSR_SRAM2_2ERR_POS                      (12U)
#define SRAMC_CKSR_SRAM2_2ERR                          (0x00001000UL)
#define SRAMC_CKSR_SRAM3_1ERR_POS                      (13U)
#define SRAMC_CKSR_SRAM3_1ERR                          (0x00002000UL)
#define SRAMC_CKSR_SRAM3_2ERR_POS                      (14U)
#define SRAMC_CKSR_SRAM3_2ERR                          (0x00004000UL)
#define SRAMC_CKSR_SRAMH_1ERR_POS                      (15U)
#define SRAMC_CKSR_SRAMH_1ERR                          (0x00008000UL)
#define SRAMC_CKSR_SRAMH_2ERR_POS                      (16U)
#define SRAMC_CKSR_SRAMH_2ERR                          (0x00010000UL)
#define SRAMC_CKSR_CACHE_1ERR_POS                      (17U)
#define SRAMC_CKSR_CACHE_1ERR                          (0x00020000UL)
#define SRAMC_CKSR_CACHE_2ERR_POS                      (18U)
#define SRAMC_CKSR_CACHE_2ERR                          (0x00040000UL)

/*  Bit definition for SRAMC_SRAM1_EIEN register  */
#define SRAMC_SRAM1_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAM1_EIBIT0 register  */
#define SRAMC_SRAM1_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAM1_EIBIT1 register  */
#define SRAMC_SRAM1_EIBIT1_EIBIT                       (0x0000007FUL)

