levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for SRAMC_SRAM1_ECCERRADDR register  */
#define SRAMC_SRAM1_ECCERRADDR_ECCERRADDR              (0x0001FFFFUL)

/*  Bit definition for SRAMC_SRAM2_EIEN register  */
#define SRAMC_SRAM2_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAM2_EIBIT0 register  */
#define SRAMC_SRAM2_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAM2_EIBIT1 register  */
#define SRAMC_SRAM2_EIBIT1_EIBIT                       (0x0000007FUL)

/*  Bit definition for SRAMC_SRAM2_ECCERRADDR register  */
#define SRAMC_SRAM2_ECCERRADDR_ECCERRADDR              (0x0001FFFFUL)

/*  Bit definition for SRAMC_SRAM3_EIEN register  */
#define SRAMC_SRAM3_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAM3_EIBIT0 register  */
#define SRAMC_SRAM3_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAM3_EIBIT1 register  */
#define SRAMC_SRAM3_EIBIT1_EIBIT                       (0x0000007FUL)

/*  Bit definition for SRAMC_SRAM3_ECCERRADDR register  */
#define SRAMC_SRAM3_ECCERRADDR_ECCERRADDR              (0x0001FFFFUL)

/*  Bit definition for SRAMC_SRAM4_EIEN register  */
#define SRAMC_SRAM4_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAM4_EIBIT0 register  */
#define SRAMC_SRAM4_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAM4_EIBIT1 register  */
#define SRAMC_SRAM4_EIBIT1_EIBIT                       (0x0000007FUL)

/*  Bit definition for SRAMC_SRAM4_ECCERRADDR register  */
#define SRAMC_SRAM4_ECCERRADDR_ECCERRADDR              (0x00007FFFUL)

/*  Bit definition for SRAMC_SRAMH_EIEN register  */
#define SRAMC_SRAMH_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAMH_EIBIT0 register  */
#define SRAMC_SRAMH_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAMH_EIBIT1 register  */
#define SRAMC_SRAMH_EIBIT1_EIBIT                       (0x0000007FUL)

/*  Bit definition for SRAMC_SRAMH_ECCERRADDR register  */
#define SRAMC_SRAMH_ECCERRADDR_ECCERRADDR              (0x0001FFFFUL)

/*  Bit definition for SRAMC_SRAMB_EIEN register  */
#define SRAMC_SRAMB_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_SRAMB_EIBIT0 register  */
#define SRAMC_SRAMB_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_SRAMB_EIBIT1 register  */
#define SRAMC_SRAMB_EIBIT1_EIBIT                       (0x0000007FUL)

/*  Bit definition for SRAMC_SRAMB_ECCERRADDR register  */
#define SRAMC_SRAMB_ECCERRADDR_ECCERRADDR              (0x00000FFFUL)

/*  Bit definition for SRAMC_CACHE_EIEN register  */
#define SRAMC_CACHE_EIEN_EIEN                          (0x00000001UL)

/*  Bit definition for SRAMC_CACHE_EIBIT0 register  */
#define SRAMC_CACHE_EIBIT0                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_CACHE_EIBIT1 register  */
#define SRAMC_CACHE_EIBIT1                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_CACHE_EIBIT2 register  */
#define SRAMC_CACHE_EIBIT2                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_CACHE_EIBIT3 register  */
#define SRAMC_CACHE_EIBIT3                             (0xFFFFFFFFUL)

/*  Bit definition for SRAMC_CACHE_EIBIT4 register  */
#define SRAMC_CACHE_EIBIT4_EIBIT                       (0x000001FFUL)

/*  Bit definition for SRAMC_CACHE_ECCERRADDR register  */
#define SRAMC_CACHE_ECCERRADDR_ECCERRADDR              (0x00001FFFUL)

/*******************************************************************************
                Bit definition for Peripheral SWDT
*******************************************************************************/
/*  Bit definition for SWDT_CR register  */
#define SWDT_CR_PERI_POS                               (0U)
#define SWDT_CR_PERI                                   (0x00000003UL)
#define SWDT_CR_PERI_0                                 (0x00000001UL)
#define SWDT_CR_PERI_1                                 (0x00000002UL)
#define SWDT_CR_CKS_POS                                (4U)
#define SWDT_CR_CKS                                    (0x000000F0UL)
#define SWDT_CR_WDPT_POS                               (8U)
#define SWDT_CR_WDPT                                   (0x00000F00UL)
#define SWDT_CR_SLPOFF_POS                             (16U)
#define SWDT_CR_SLPOFF                                 (0x00010000UL)
#define SWDT_CR_ITS_POS                                (31U)
#define SWDT_CR_ITS                                    (0x80000000UL)

/*  Bit definition for SWDT_SR register  */
#define SWDT_SR_CNT_POS                                (0U)
#define SWDT_SR_CNT                                    (0x0000FFFFUL)
#define SWDT_SR_UDF_POS                                (16U)
#define SWDT_SR_UDF                                    (0x00010000UL)
#define SWDT_SR_REF_POS                                (17U)
#define SWDT_SR_REF                                    (0x00020000UL)

/*  Bit definition for SWDT_RR register  */
#define SWDT_RR_RF                                     (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CNTBR register  */
#define TMR0_CNTBR_CNTB                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CMPBR register  */
#define TMR0_CMPBR_CMPB                                (0x0000FFFFUL)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                            (0U)
#define TMR0_BCONR_CSTA                                (0x00000001UL)
#define TMR0_BCONR_CAPMDA_POS                          (1U)
#define TMR0_BCONR_CAPMDA                              (0x00000002UL)
#define TMR0_BCONR_CMENA_POS                           (2U)
#define TMR0_BCONR_CMENA                               (0x00000004UL)
#define TMR0_BCONR_OVENA_POS                           (3U)
#define TMR0_BCONR_OVENA                               (0x00000008UL)
#define TMR0_BCONR_CKDIVA_POS                          (4U)
#define TMR0_BCONR_CKDIVA                              (0x000000F0UL)
#define TMR0_BCONR_SYNSA_POS                           (8U)
#define TMR0_BCONR_SYNSA                               (0x00000100UL)
#define TMR0_BCONR_SYNCLKA_POS                         (9U)
#define TMR0_BCONR_SYNCLKA                             (0x00000200UL)
#define TMR0_BCONR_ASYNCLKA_POS                        (10U)
#define TMR0_BCONR_ASYNCLKA                            (0x00000400UL)
#define TMR0_BCONR_HSTAA_POS                           (12U)
#define TMR0_BCONR_HSTAA                               (0x00001000UL)
#define TMR0_BCONR_HSTPA_POS                           (13U)
#define TMR0_BCONR_HSTPA                               (0x00002000UL)
#define TMR0_BCONR_HCLEA_POS                           (14U)
#define TMR0_BCONR_HCLEA                               (0x00004000UL)
#define TMR0_BCONR_HICPA_POS                           (15U)
#define TMR0_BCONR_HICPA                               (0x00008000UL)
#define TMR0_BCONR_CSTB_POS                            (16U)
#define TMR0_BCONR_CSTB                                (0x00010000UL)
#define TMR0_BCONR_CAPMDB_POS                          (17U)
#define TMR0_BCONR_CAPMDB                              (0x00020000UL)
#define TMR0_BCONR_CMENB_POS                           (18U)
#define TMR0_BCONR_CMENB                               (0x00040000UL)
#define TMR0_BCONR_OVENB_POS                           (19U)
#define TMR0_BCONR_OVENB                               (0x00080000UL)
#define TMR0_BCONR_CKDIVB_POS                          (20U)
#define TMR0_BCONR_CKDIVB                              (0x00F00000UL)
#define TMR0_BCONR_SYNSB_POS                           (24U)
#define TMR0_BCONR_SYNSB                               (0x01000000UL)
#define TMR0_BCONR_SYNCLKB_POS                         (25U)
#define TMR0_BCONR_SYNCLKB                             (0x02000000UL)
#define TMR0_BCONR_ASYNCLKB_POS                        (26U)
#define TMR0_BCONR_ASYNCLKB                            (0x04000000UL)
#define TMR0_BCONR_HSTAB_POS                           (28U)
#define TMR0_BCONR_HSTAB                               (0x10000000UL)
#define TMR0_BCONR_HSTPB_POS                           (29U)
#define TMR0_BCONR_HSTPB                               (0x20000000UL)
#define TMR0_BCONR_HCLEB_POS                           (30U)
#define TMR0_BCONR_HCLEB                               (0x40000000UL)
#define TMR0_BCONR_HICPB_POS                           (31U)
#define TMR0_BCONR_HICPB                               (0x80000000UL)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA_POS                            (0U)
#define TMR0_STFLR_CMFA                                (0x00000001UL)
#define TMR0_STFLR_OVFA_POS                            (1U)
#define TMR0_STFLR_OVFA                                (0x00000002UL)
#define TMR0_STFLR_ICPA_POS                            (2U)
#define TMR0_STFLR_ICPA                                (0x00000004UL)
#define TMR0_STFLR_SYDA_POS                            (8U)
#define TMR0_STFLR_SYDA                                (0x00000100UL)
#define TMR0_STFLR_CMFB_POS                            (16U)
#define TMR0_STFLR_CMFB                                (0x00010000UL)
#define TMR0_STFLR_OVFB_POS                            (17U)
#define TMR0_STFLR_OVFB                                (0x00020000UL)
#define TMR0_STFLR_ICPB_POS                            (18U)
#define TMR0_STFLR_ICPB                                (0x00040000UL)
#define TMR0_STFLR_SYDB_POS                            (24U)
#define TMR0_STFLR_SYDB                                (0x01000000UL)

