levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for TMR6_PTPERR register  */
#define TMR6_PTPERR_PTPER                              (0x0000FFFFUL)

/*  Bit definition for TMR6_PTRMDR register  */
#define TMR6_PTRMDR                                    (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTCTLR register  */
#define TMR6_PTCTLR_PTOENA_POS                         (0U)
#define TMR6_PTCTLR_PTOENA                             (0x00000001UL)
#define TMR6_PTCTLR_AOUTENA_POS                        (1U)
#define TMR6_PTCTLR_AOUTENA                            (0x00000002UL)
#define TMR6_PTCTLR_BOUTENA_POS                        (2U)
#define TMR6_PTCTLR_BOUTENA                            (0x00000004UL)
#define TMR6_PTCTLR_ZOUTENA_POS                        (3U)
#define TMR6_PTCTLR_ZOUTENA                            (0x00000008UL)
#define TMR6_PTCTLR_WORKF_POS                          (8U)
#define TMR6_PTCTLR_WORKF                              (0x00000100UL)

/*  Bit definition for TMR6_PTAOPR register  */
#define TMR6_PTAOPR_PTAOP                              (0x0000000FUL)
#define TMR6_PTAOPR_PTAOP_0                            (0x00000001UL)
#define TMR6_PTAOPR_PTAOP_1                            (0x00000002UL)
#define TMR6_PTAOPR_PTAOP_2                            (0x00000004UL)
#define TMR6_PTAOPR_PTAOP_3                            (0x00000008UL)

/*  Bit definition for TMR6_PTBOPR register  */
#define TMR6_PTBOPR_PTBOP                              (0x0000000FUL)
#define TMR6_PTBOPR_PTBOP_0                            (0x00000001UL)
#define TMR6_PTBOPR_PTBOP_1                            (0x00000002UL)
#define TMR6_PTBOPR_PTBOP_2                            (0x00000004UL)
#define TMR6_PTBOPR_PTBOP_3                            (0x00000008UL)

/*  Bit definition for TMR6_PTZOSPR register  */
#define TMR6_PTZOSPR                                   (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTZOEPR register  */
#define TMR6_PTZOEPR                                   (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTZCMPBR register  */
#define TMR6_PTZCMPBR_ZCMPB_POS                        (0U)
#define TMR6_PTZCMPBR_ZCMPB                            (0x0000FFFFUL)
#define TMR6_PTZCMPBR_ZCMPBENA_POS                     (16U)
#define TMR6_PTZCMPBR_ZCMPBENA                         (0x00010000UL)

/*  Bit definition for TMR6_PTZPERR register  */
#define TMR6_PTZPERR                                   (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTPSPR register  */
#define TMR6_PTPSPR                                    (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTPSTR register  */
#define TMR6_PTPSTR_APORTST_POS                        (0U)
#define TMR6_PTPSTR_APORTST                            (0x00000001UL)
#define TMR6_PTPSTR_BPORTST_POS                        (1U)
#define TMR6_PTPSTR_BPORTST                            (0x00000002UL)
#define TMR6_PTPSTR_ZPORTST_POS                        (2U)
#define TMR6_PTPSTR_ZPORTST                            (0x00000004UL)
#define TMR6_PTPSTR_SDIRIND_POS                        (3U)
#define TMR6_PTPSTR_SDIRIND                            (0x00000008UL)
#define TMR6_PTPSTR_ABSTP_POS                          (8U)
#define TMR6_PTPSTR_ABSTP                              (0x00001F00UL)

/*  Bit definition for TMR6_PTPCPR register  */
#define TMR6_PTPCPR                                    (0xFFFFFFFFUL)

/*  Bit definition for TMR6_PTPCTR register  */
#define TMR6_PTPCTR_APORTCR_POS                        (0U)
#define TMR6_PTPCTR_APORTCR                            (0x00000001UL)
#define TMR6_PTPCTR_BPORTCR_POS                        (1U)
#define TMR6_PTPCTR_BPORTCR                            (0x00000002UL)
#define TMR6_PTPCTR_ZPORTCR_POS                        (2U)
#define TMR6_PTPCTR_ZPORTCR                            (0x00000004UL)
#define TMR6_PTPCTR_CDIRIND_POS                        (3U)
#define TMR6_PTPCTR_CDIRIND                            (0x00000008UL)
#define TMR6_PTPCTR_ABCRP_POS                          (8U)
#define TMR6_PTPCTR_ABCRP                              (0x00001F00UL)

/*******************************************************************************
                Bit definition for Peripheral TMR6_COMMON
*******************************************************************************/
/*  Bit definition for TMR6_COMMON_FCNTR register  */
#define TMR6_COMMON_FCNTR_NOFIENTA_POS                 (0U)
#define TMR6_COMMON_FCNTR_NOFIENTA                     (0x00000001UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_POS                 (1U)
#define TMR6_COMMON_FCNTR_NOFICKTA                     (0x00000006UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_0                   (0x00000002UL)
#define TMR6_COMMON_FCNTR_NOFICKTA_1                   (0x00000004UL)
#define TMR6_COMMON_FCNTR_NOFIENTB_POS                 (4U)
#define TMR6_COMMON_FCNTR_NOFIENTB                     (0x00000010UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_POS                 (5U)
#define TMR6_COMMON_FCNTR_NOFICKTB                     (0x00000060UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_0                   (0x00000020UL)
#define TMR6_COMMON_FCNTR_NOFICKTB_1                   (0x00000040UL)
#define TMR6_COMMON_FCNTR_NOFIENTC_POS                 (8U)
#define TMR6_COMMON_FCNTR_NOFIENTC                     (0x00000100UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_POS                 (9U)
#define TMR6_COMMON_FCNTR_NOFICKTC                     (0x00000600UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_0                   (0x00000200UL)
#define TMR6_COMMON_FCNTR_NOFICKTC_1                   (0x00000400UL)
#define TMR6_COMMON_FCNTR_NOFIENTD_POS                 (12U)
#define TMR6_COMMON_FCNTR_NOFIENTD                     (0x00001000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_POS                 (13U)
#define TMR6_COMMON_FCNTR_NOFICKTD                     (0x00006000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_0                   (0x00002000UL)
#define TMR6_COMMON_FCNTR_NOFICKTD_1                   (0x00004000UL)

/*  Bit definition for TMR6_COMMON_SSTAR register  */
#define TMR6_COMMON_SSTAR_SSTA1_POS                    (0U)
#define TMR6_COMMON_SSTAR_SSTA1                        (0x00000001UL)
#define TMR6_COMMON_SSTAR_SSTA2_POS                    (1U)
#define TMR6_COMMON_SSTAR_SSTA2                        (0x00000002UL)
#define TMR6_COMMON_SSTAR_SSTA3_POS                    (2U)
#define TMR6_COMMON_SSTAR_SSTA3                        (0x00000004UL)
#define TMR6_COMMON_SSTAR_SSTA4_POS                    (3U)
#define TMR6_COMMON_SSTAR_SSTA4                        (0x00000008UL)
#define TMR6_COMMON_SSTAR_SSTA5_POS                    (4U)
#define TMR6_COMMON_SSTAR_SSTA5                        (0x00000010UL)
#define TMR6_COMMON_SSTAR_SSTA6_POS                    (5U)
#define TMR6_COMMON_SSTAR_SSTA6                        (0x00000020UL)
#define TMR6_COMMON_SSTAR_SSTA7_POS                    (6U)
#define TMR6_COMMON_SSTAR_SSTA7                        (0x00000040UL)
#define TMR6_COMMON_SSTAR_SSTA8_POS                    (7U)
#define TMR6_COMMON_SSTAR_SSTA8                        (0x00000080UL)

/*  Bit definition for TMR6_COMMON_SSTPR register  */
#define TMR6_COMMON_SSTPR_SSTP1_POS                    (0U)
#define TMR6_COMMON_SSTPR_SSTP1                        (0x00000001UL)
#define TMR6_COMMON_SSTPR_SSTP2_POS                    (1U)
#define TMR6_COMMON_SSTPR_SSTP2                        (0x00000002UL)
#define TMR6_COMMON_SSTPR_SSTP3_POS                    (2U)
#define TMR6_COMMON_SSTPR_SSTP3                        (0x00000004UL)
#define TMR6_COMMON_SSTPR_SSTP4_POS                    (3U)
#define TMR6_COMMON_SSTPR_SSTP4                        (0x00000008UL)
#define TMR6_COMMON_SSTPR_SSTP5_POS                    (4U)
#define TMR6_COMMON_SSTPR_SSTP5                        (0x00000010UL)
#define TMR6_COMMON_SSTPR_SSTP6_POS                    (5U)
#define TMR6_COMMON_SSTPR_SSTP6                        (0x00000020UL)
#define TMR6_COMMON_SSTPR_SSTP7_POS                    (6U)
#define TMR6_COMMON_SSTPR_SSTP7                        (0x00000040UL)
#define TMR6_COMMON_SSTPR_SSTP8_POS                    (7U)
#define TMR6_COMMON_SSTPR_SSTP8                        (0x00000080UL)

