levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for TMR6_COMMON_SCLRR register  */
#define TMR6_COMMON_SCLRR_SCLE1_POS                    (0U)
#define TMR6_COMMON_SCLRR_SCLE1                        (0x00000001UL)
#define TMR6_COMMON_SCLRR_SCLE2_POS                    (1U)
#define TMR6_COMMON_SCLRR_SCLE2                        (0x00000002UL)
#define TMR6_COMMON_SCLRR_SCLE3_POS                    (2U)
#define TMR6_COMMON_SCLRR_SCLE3                        (0x00000004UL)
#define TMR6_COMMON_SCLRR_SCLE4_POS                    (3U)
#define TMR6_COMMON_SCLRR_SCLE4                        (0x00000008UL)
#define TMR6_COMMON_SCLRR_SCLE5_POS                    (4U)
#define TMR6_COMMON_SCLRR_SCLE5                        (0x00000010UL)
#define TMR6_COMMON_SCLRR_SCLE6_POS                    (5U)
#define TMR6_COMMON_SCLRR_SCLE6                        (0x00000020UL)
#define TMR6_COMMON_SCLRR_SCLE7_POS                    (6U)
#define TMR6_COMMON_SCLRR_SCLE7                        (0x00000040UL)
#define TMR6_COMMON_SCLRR_SCLE8_POS                    (7U)
#define TMR6_COMMON_SCLRR_SCLE8                        (0x00000080UL)

/*  Bit definition for TMR6_COMMON_SUPDR register  */
#define TMR6_COMMON_SUPDR_SUPD1_POS                    (0U)
#define TMR6_COMMON_SUPDR_SUPD1                        (0x00000001UL)
#define TMR6_COMMON_SUPDR_SUPD2_POS                    (1U)
#define TMR6_COMMON_SUPDR_SUPD2                        (0x00000002UL)
#define TMR6_COMMON_SUPDR_SUPD3_POS                    (2U)
#define TMR6_COMMON_SUPDR_SUPD3                        (0x00000004UL)
#define TMR6_COMMON_SUPDR_SUPD4_POS                    (3U)
#define TMR6_COMMON_SUPDR_SUPD4                        (0x00000008UL)
#define TMR6_COMMON_SUPDR_SUPD5_POS                    (4U)
#define TMR6_COMMON_SUPDR_SUPD5                        (0x00000010UL)
#define TMR6_COMMON_SUPDR_SUPD6_POS                    (5U)
#define TMR6_COMMON_SUPDR_SUPD6                        (0x00000020UL)
#define TMR6_COMMON_SUPDR_SUPD7_POS                    (6U)
#define TMR6_COMMON_SUPDR_SUPD7                        (0x00000040UL)
#define TMR6_COMMON_SUPDR_SUPD8_POS                    (7U)
#define TMR6_COMMON_SUPDR_SUPD8                        (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral TMRA
*******************************************************************************/
/*  Bit definition for TMRA_CNTER register  */
#define TMRA_CNTER                                     (0xFFFFU)

/*  Bit definition for TMRA_PERAR register  */
#define TMRA_PERAR                                     (0xFFFFU)

/*  Bit definition for TMRA_CMPAR1 register  */
#define TMRA_CMPAR1                                    (0xFFFFU)

/*  Bit definition for TMRA_CMPAR2 register  */
#define TMRA_CMPAR2                                    (0xFFFFU)

/*  Bit definition for TMRA_CMPAR3 register  */
#define TMRA_CMPAR3                                    (0xFFFFU)

/*  Bit definition for TMRA_CMPAR4 register  */
#define TMRA_CMPAR4                                    (0xFFFFU)

/*  Bit definition for TMRA_BCSTRL register  */
#define TMRA_BCSTRL_START_POS                          (0U)
#define TMRA_BCSTRL_START                              (0x01U)
#define TMRA_BCSTRL_DIR_POS                            (1U)
#define TMRA_BCSTRL_DIR                                (0x02U)
#define TMRA_BCSTRL_MODE_POS                           (2U)
#define TMRA_BCSTRL_MODE                               (0x04U)
#define TMRA_BCSTRL_SYNST_POS                          (3U)
#define TMRA_BCSTRL_SYNST                              (0x08U)
#define TMRA_BCSTRL_CKDIV_POS                          (4U)
#define TMRA_BCSTRL_CKDIV                              (0xF0U)

/*  Bit definition for TMRA_BCSTRH register  */
#define TMRA_BCSTRH_OVSTP_POS                          (0U)
#define TMRA_BCSTRH_OVSTP                              (0x01U)
#define TMRA_BCSTRH_ITENOVF_POS                        (4U)
#define TMRA_BCSTRH_ITENOVF                            (0x10U)
#define TMRA_BCSTRH_ITENUDF_POS                        (5U)
#define TMRA_BCSTRH_ITENUDF                            (0x20U)
#define TMRA_BCSTRH_OVFF_POS                           (6U)
#define TMRA_BCSTRH_OVFF                               (0x40U)
#define TMRA_BCSTRH_UDFF_POS                           (7U)
#define TMRA_BCSTRH_UDFF                               (0x80U)

/*  Bit definition for TMRA_HCONR register  */
#define TMRA_HCONR_HSTA0_POS                           (0U)
#define TMRA_HCONR_HSTA0                               (0x0001U)
#define TMRA_HCONR_HSTA1_POS                           (1U)
#define TMRA_HCONR_HSTA1                               (0x0002U)
#define TMRA_HCONR_HSTA2_POS                           (2U)
#define TMRA_HCONR_HSTA2                               (0x0004U)
#define TMRA_HCONR_HSTP0_POS                           (4U)
#define TMRA_HCONR_HSTP0                               (0x0010U)
#define TMRA_HCONR_HSTP1_POS                           (5U)
#define TMRA_HCONR_HSTP1                               (0x0020U)
#define TMRA_HCONR_HSTP2_POS                           (6U)
#define TMRA_HCONR_HSTP2                               (0x0040U)
#define TMRA_HCONR_HCLE0_POS                           (8U)
#define TMRA_HCONR_HCLE0                               (0x0100U)
#define TMRA_HCONR_HCLE1_POS                           (9U)
#define TMRA_HCONR_HCLE1                               (0x0200U)
#define TMRA_HCONR_HCLE2_POS                           (10U)
#define TMRA_HCONR_HCLE2                               (0x0400U)
#define TMRA_HCONR_HCLE3_POS                           (12U)
#define TMRA_HCONR_HCLE3                               (0x1000U)
#define TMRA_HCONR_HCLE4_POS                           (13U)
#define TMRA_HCONR_HCLE4                               (0x2000U)
#define TMRA_HCONR_HCLE5_POS                           (14U)
#define TMRA_HCONR_HCLE5                               (0x4000U)
#define TMRA_HCONR_HCLE6_POS                           (15U)
#define TMRA_HCONR_HCLE6                               (0x8000U)

