levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
/*  Bit definition for USBHS_DOEPDMA register  */
#define USBHS_DOEPDMA                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL register  */
#define USBHS_DOEPCTL_MPSIZ_POS                        (0U)
#define USBHS_DOEPCTL_MPSIZ                            (0x000007FFUL)
#define USBHS_DOEPCTL_USBAEP_POS                       (15U)
#define USBHS_DOEPCTL_USBAEP                           (0x00008000UL)
#define USBHS_DOEPCTL_DPID_POS                         (16U)
#define USBHS_DOEPCTL_DPID                             (0x00010000UL)
#define USBHS_DOEPCTL_NAKSTS_POS                       (17U)
#define USBHS_DOEPCTL_NAKSTS                           (0x00020000UL)
#define USBHS_DOEPCTL_EPTYP_POS                        (18U)
#define USBHS_DOEPCTL_EPTYP                            (0x000C0000UL)
#define USBHS_DOEPCTL_EPTYP_0                          (0x00040000UL)
#define USBHS_DOEPCTL_EPTYP_1                          (0x00080000UL)
#define USBHS_DOEPCTL_SNPM_POS                         (20U)
#define USBHS_DOEPCTL_SNPM                             (0x00100000UL)
#define USBHS_DOEPCTL_STALL_POS                        (21U)
#define USBHS_DOEPCTL_STALL                            (0x00200000UL)
#define USBHS_DOEPCTL_CNAK_POS                         (26U)
#define USBHS_DOEPCTL_CNAK                             (0x04000000UL)
#define USBHS_DOEPCTL_SNAK_POS                         (27U)
#define USBHS_DOEPCTL_SNAK                             (0x08000000UL)
#define USBHS_DOEPCTL_SD0PID_POS                       (28U)
#define USBHS_DOEPCTL_SD0PID                           (0x10000000UL)
#define USBHS_DOEPCTL_SD1PID_POS                       (29U)
#define USBHS_DOEPCTL_SD1PID                           (0x20000000UL)
#define USBHS_DOEPCTL_EPDIS_POS                        (30U)
#define USBHS_DOEPCTL_EPDIS                            (0x40000000UL)
#define USBHS_DOEPCTL_EPENA_POS                        (31U)
#define USBHS_DOEPCTL_EPENA                            (0x80000000UL)

/*  Bit definition for USBHS_DOEPTSIZ register  */
#define USBHS_DOEPTSIZ_XFRSIZ_POS                      (0U)
#define USBHS_DOEPTSIZ_XFRSIZ                          (0x0007FFFFUL)
#define USBHS_DOEPTSIZ_PKTCNT_POS                      (19U)
#define USBHS_DOEPTSIZ_PKTCNT                          (0x1FF80000UL)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT_POS              (29U)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT                  (0x60000000UL)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT_0                (0x20000000UL)
#define USBHS_DOEPTSIZ_RXDPID_STUPCNT_1                (0x40000000UL)

/*  Bit definition for USBHS_GCCTL register  */
#define USBHS_GCCTL_STPPCLK_POS                        (0U)
#define USBHS_GCCTL_STPPCLK                            (0x00000001UL)
#define USBHS_GCCTL_GATEHCLK_POS                       (1U)
#define USBHS_GCCTL_GATEHCLK                           (0x00000002UL)
#define USBHS_GCCTL_ENL1GTG_POS                        (5U)
#define USBHS_GCCTL_ENL1GTG                            (0x00000020UL)
#define USBHS_GCCTL_PHYSLEEP_POS                       (6U)
#define USBHS_GCCTL_PHYSLEEP                           (0x00000040UL)
#define USBHS_GCCTL_SUSP_POS                           (7U)
#define USBHS_GCCTL_SUSP                               (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral WDT
*******************************************************************************/
/*  Bit definition for WDT_CR register  */
#define WDT_CR_PERI_POS                                (0U)
#define WDT_CR_PERI                                    (0x00000003UL)
#define WDT_CR_PERI_0                                  (0x00000001UL)
#define WDT_CR_PERI_1                                  (0x00000002UL)
#define WDT_CR_CKS_POS                                 (4U)
#define WDT_CR_CKS                                     (0x000000F0UL)
#define WDT_CR_WDPT_POS                                (8U)
#define WDT_CR_WDPT                                    (0x00000F00UL)
#define WDT_CR_SLPOFF_POS                              (16U)
#define WDT_CR_SLPOFF                                  (0x00010000UL)
#define WDT_CR_ITS_POS                                 (31U)
#define WDT_CR_ITS                                     (0x80000000UL)

/*  Bit definition for WDT_SR register  */
#define WDT_SR_CNT_POS                                 (0U)
#define WDT_SR_CNT                                     (0x0000FFFFUL)
#define WDT_SR_UDF_POS                                 (16U)
#define WDT_SR_UDF                                     (0x00010000UL)
#define WDT_SR_REF_POS                                 (17U)
#define WDT_SR_REF                                     (0x00020000UL)

/*  Bit definition for WDT_RR register  */
#define WDT_RR_RF                                      (0x0000FFFFUL)

/******************************************************************************/
/*             Device Specific Registers bit_band structure                   */
/******************************************************************************/

typedef struct {
    __IO uint32_t STRT;
    uint32_t RESERVED0[7];
} stc_adc_str_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t CLREN;
    __IO uint32_t DFMT;
    uint32_t RESERVED1[8];
} stc_adc_cr0_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t RSCHSEL;
    uint32_t RESERVED1[13];
} stc_adc_cr1_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t OVSMOD;
    uint32_t RESERVED1[3];
} stc_adc_cr2_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t TRGENA;
    uint32_t RESERVED1[7];
    __IO uint32_t TRGENB;
} stc_adc_trgsr_bit_t;

typedef struct {
    __IO uint32_t EXCHSEL;
    uint32_t RESERVED0[7];
} stc_adc_exchselr_bit_t;

typedef struct {
    __I  uint32_t EOCAF;
    __I  uint32_t EOCBF;
    uint32_t RESERVED0[2];
    __I  uint32_t SASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isr_bit_t;

