levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    __IO uint32_t F0NWPRT64;
    __IO uint32_t F0NWPRT65;
    __IO uint32_t F0NWPRT66;
    __IO uint32_t F0NWPRT67;
    __IO uint32_t F0NWPRT68;
    __IO uint32_t F0NWPRT69;
    __IO uint32_t F0NWPRT70;
    __IO uint32_t F0NWPRT71;
    __IO uint32_t F0NWPRT72;
    __IO uint32_t F0NWPRT73;
    __IO uint32_t F0NWPRT74;
    __IO uint32_t F0NWPRT75;
    __IO uint32_t F0NWPRT76;
    __IO uint32_t F0NWPRT77;
    __IO uint32_t F0NWPRT78;
    __IO uint32_t F0NWPRT79;
    __IO uint32_t F0NWPRT80;
    __IO uint32_t F0NWPRT81;
    __IO uint32_t F0NWPRT82;
    __IO uint32_t F0NWPRT83;
    __IO uint32_t F0NWPRT84;
    __IO uint32_t F0NWPRT85;
    __IO uint32_t F0NWPRT86;
    __IO uint32_t F0NWPRT87;
    __IO uint32_t F0NWPRT88;
    __IO uint32_t F0NWPRT89;
    __IO uint32_t F0NWPRT90;
    __IO uint32_t F0NWPRT91;
    __IO uint32_t F0NWPRT92;
    __IO uint32_t F0NWPRT93;
    __IO uint32_t F0NWPRT94;
    __IO uint32_t F0NWPRT95;
} stc_efm_f0nwprt2_bit_t;

typedef struct {
    __IO uint32_t F0NWPRT96;
    __IO uint32_t F0NWPRT97;
    __IO uint32_t F0NWPRT98;
    __IO uint32_t F0NWPRT99;
    __IO uint32_t F0NWPRT100;
    __IO uint32_t F0NWPRT101;
    __IO uint32_t F0NWPRT102;
    __IO uint32_t F0NWPRT103;
    __IO uint32_t F0NWPRT104;
    __IO uint32_t F0NWPRT105;
    __IO uint32_t F0NWPRT106;
    __IO uint32_t F0NWPRT107;
    __IO uint32_t F0NWPRT108;
    __IO uint32_t F0NWPRT109;
    __IO uint32_t F0NWPRT110;
    __IO uint32_t F0NWPRT111;
    __IO uint32_t F0NWPRT112;
    __IO uint32_t F0NWPRT113;
    __IO uint32_t F0NWPRT114;
    __IO uint32_t F0NWPRT115;
    __IO uint32_t F0NWPRT116;
    __IO uint32_t F0NWPRT117;
    __IO uint32_t F0NWPRT118;
    __IO uint32_t F0NWPRT119;
    __IO uint32_t F0NWPRT120;
    __IO uint32_t F0NWPRT121;
    __IO uint32_t F0NWPRT122;
    __IO uint32_t F0NWPRT123;
    __IO uint32_t F0NWPRT124;
    __IO uint32_t F0NWPRT125;
    __IO uint32_t F0NWPRT126;
    __IO uint32_t F0NWPRT127;
} stc_efm_f0nwprt3_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT0;
    __IO uint32_t F1NWPRT1;
    __IO uint32_t F1NWPRT2;
    __IO uint32_t F1NWPRT3;
    __IO uint32_t F1NWPRT4;
    __IO uint32_t F1NWPRT5;
    __IO uint32_t F1NWPRT6;
    __IO uint32_t F1NWPRT7;
    __IO uint32_t F1NWPRT8;
    __IO uint32_t F1NWPRT9;
    __IO uint32_t F1NWPRT10;
    __IO uint32_t F1NWPRT11;
    __IO uint32_t F1NWPRT12;
    __IO uint32_t F1NWPRT13;
    __IO uint32_t F1NWPRT14;
    __IO uint32_t F1NWPRT15;
    __IO uint32_t F1NWPRT16;
    __IO uint32_t F1NWPRT17;
    __IO uint32_t F1NWPRT18;
    __IO uint32_t F1NWPRT19;
    __IO uint32_t F1NWPRT20;
    __IO uint32_t F1NWPRT21;
    __IO uint32_t F1NWPRT22;
    __IO uint32_t F1NWPRT23;
    __IO uint32_t F1NWPRT24;
    __IO uint32_t F1NWPRT25;
    __IO uint32_t F1NWPRT26;
    __IO uint32_t F1NWPRT27;
    __IO uint32_t F1NWPRT28;
    __IO uint32_t F1NWPRT29;
    __IO uint32_t F1NWPRT30;
    __IO uint32_t F1NWPRT31;
} stc_efm_f1nwprt0_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT32;
    __IO uint32_t F1NWPRT33;
    __IO uint32_t F1NWPRT34;
    __IO uint32_t F1NWPRT35;
    __IO uint32_t F1NWPRT36;
    __IO uint32_t F1NWPRT37;
    __IO uint32_t F1NWPRT38;
    __IO uint32_t F1NWPRT39;
    __IO uint32_t F1NWPRT40;
    __IO uint32_t F1NWPRT41;
    __IO uint32_t F1NWPRT42;
    __IO uint32_t F1NWPRT43;
    __IO uint32_t F1NWPRT44;
    __IO uint32_t F1NWPRT45;
    __IO uint32_t F1NWPRT46;
    __IO uint32_t F1NWPRT47;
    __IO uint32_t F1NWPRT48;
    __IO uint32_t F1NWPRT49;
    __IO uint32_t F1NWPRT50;
    __IO uint32_t F1NWPRT51;
    __IO uint32_t F1NWPRT52;
    __IO uint32_t F1NWPRT53;
    __IO uint32_t F1NWPRT54;
    __IO uint32_t F1NWPRT55;
    __IO uint32_t F1NWPRT56;
    __IO uint32_t F1NWPRT57;
    __IO uint32_t F1NWPRT58;
    __IO uint32_t F1NWPRT59;
    __IO uint32_t F1NWPRT60;
    __IO uint32_t F1NWPRT61;
    __IO uint32_t F1NWPRT62;
    __IO uint32_t F1NWPRT63;
} stc_efm_f1nwprt1_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT64;
    __IO uint32_t F1NWPRT65;
    __IO uint32_t F1NWPRT66;
    __IO uint32_t F1NWPRT67;
    __IO uint32_t F1NWPRT68;
    __IO uint32_t F1NWPRT69;
    __IO uint32_t F1NWPRT70;
    __IO uint32_t F1NWPRT71;
    __IO uint32_t F1NWPRT72;
    __IO uint32_t F1NWPRT73;
    __IO uint32_t F1NWPRT74;
    __IO uint32_t F1NWPRT75;
    __IO uint32_t F1NWPRT76;
    __IO uint32_t F1NWPRT77;
    __IO uint32_t F1NWPRT78;
    __IO uint32_t F1NWPRT79;
    __IO uint32_t F1NWPRT80;
    __IO uint32_t F1NWPRT81;
    __IO uint32_t F1NWPRT82;
    __IO uint32_t F1NWPRT83;
    __IO uint32_t F1NWPRT84;
    __IO uint32_t F1NWPRT85;
    __IO uint32_t F1NWPRT86;
    __IO uint32_t F1NWPRT87;
    __IO uint32_t F1NWPRT88;
    __IO uint32_t F1NWPRT89;
    __IO uint32_t F1NWPRT90;
    __IO uint32_t F1NWPRT91;
    __IO uint32_t F1NWPRT92;
    __IO uint32_t F1NWPRT93;
    __IO uint32_t F1NWPRT94;
    __IO uint32_t F1NWPRT95;
} stc_efm_f1nwprt2_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT96;
    __IO uint32_t F1NWPRT97;
    __IO uint32_t F1NWPRT98;
    __IO uint32_t F1NWPRT99;
    __IO uint32_t F1NWPRT100;
    __IO uint32_t F1NWPRT101;
    __IO uint32_t F1NWPRT102;
    __IO uint32_t F1NWPRT103;
    __IO uint32_t F1NWPRT104;
    __IO uint32_t F1NWPRT105;
    __IO uint32_t F1NWPRT106;
    __IO uint32_t F1NWPRT107;
    __IO uint32_t F1NWPRT108;
    __IO uint32_t F1NWPRT109;
    __IO uint32_t F1NWPRT110;
    __IO uint32_t F1NWPRT111;
    __IO uint32_t F1NWPRT112;
    __IO uint32_t F1NWPRT113;
    __IO uint32_t F1NWPRT114;
    __IO uint32_t F1NWPRT115;
    __IO uint32_t F1NWPRT116;
    __IO uint32_t F1NWPRT117;
    __IO uint32_t F1NWPRT118;
    __IO uint32_t F1NWPRT119;
    __IO uint32_t F1NWPRT120;
    __IO uint32_t F1NWPRT121;
    __IO uint32_t F1NWPRT122;
    __IO uint32_t F1NWPRT123;
    __IO uint32_t F1NWPRT124;
    __IO uint32_t F1NWPRT125;
    __IO uint32_t F1NWPRT126;
    __IO uint32_t F1NWPRT127;
} stc_efm_f1nwprt3_bit_t;

typedef struct {
    __IO uint32_t F0ECCOAD;
    uint32_t RESERVED0[15];
    __IO uint32_t F1ECCOAD;
    uint32_t RESERVED1[15];
} stc_efm_ckcr_bit_t;

