levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    __IO uint32_t CKPRC;
    uint32_t RESERVED0[31];
} stc_efm_ckpr_bit_t;

typedef struct {
    __IO uint32_t F0_1ERR;
    __IO uint32_t F0_2ERR;
    uint32_t RESERVED0[14];
    __IO uint32_t F1_1ERR;
    __IO uint32_t F1_2ERR;
    uint32_t RESERVED1[14];
} stc_efm_cksr_bit_t;

typedef struct {
    __IO uint32_t F0_EIEN;
    uint32_t RESERVED0[15];
    __IO uint32_t F1_EIEN;
    uint32_t RESERVED1[15];
} stc_efm_eien_bit_t;

typedef struct {
    __IO uint32_t GDIS;
    __IO uint32_t VDIS;
    uint32_t RESERVED0[30];
} stc_efm_f0ecccr_bit_t;

typedef struct {
    __IO uint32_t VALID;
    __IO uint32_t FATAL;
    uint32_t RESERVED0[30];
} stc_efm_f0err0_bit_t;

typedef struct {
    __IO uint32_t VALID;
    __IO uint32_t FATAL;
    uint32_t RESERVED0[30];
} stc_efm_f0err1_bit_t;

typedef struct {
    __IO uint32_t GDIS;
    __IO uint32_t VDIS;
    uint32_t RESERVED0[30];
} stc_efm_f1ecccr_bit_t;

typedef struct {
    __IO uint32_t VALID;
    __IO uint32_t FATAL;
    uint32_t RESERVED0[30];
} stc_efm_f1err0_bit_t;

typedef struct {
    __IO uint32_t VALID;
    __IO uint32_t FATAL;
    uint32_t RESERVED0[30];
} stc_efm_f1err1_bit_t;

typedef struct {
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    __IO uint32_t CMPEN3;
    __IO uint32_t CMPEN4;
    __IO uint32_t SYSEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    __IO uint32_t PWMSEN3;
    __IO uint32_t PWMSEN4;
    __IO uint32_t PWMSEN5;
    __IO uint32_t PWMSEN6;
    __IO uint32_t PWMSEN7;
    uint32_t RESERVED0[2];
    __IO uint32_t FCMERREN;
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    __IO uint32_t PORTINEN3;
    __IO uint32_t PORTINEN4;
    uint32_t RESERVED1[2];
    __IO uint32_t INVSEL1;
    __IO uint32_t INVSEL2;
    __IO uint32_t INVSEL3;
    __IO uint32_t INVSEL4;
    __IO uint32_t FLASHECCERREN;
    __IO uint32_t OSCSTPEN;
    __IO uint32_t SRAMECCERREN;
    uint32_t RESERVED2[1];
    __IO uint32_t LOCKUPEN;
    __IO uint32_t PVDEN;
} stc_emb_ctl1_bit_t;

typedef struct {
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    __IO uint32_t PWMLV3;
    __IO uint32_t PWMLV4;
    __IO uint32_t PWMLV5;
    __IO uint32_t PWMLV6;
    __IO uint32_t PWMLV7;
    uint32_t RESERVED0[10];
    __IO uint32_t NFEN1;
    uint32_t RESERVED1[2];
    __IO uint32_t NFEN2;
    uint32_t RESERVED2[2];
    __IO uint32_t NFEN3;
    uint32_t RESERVED3[2];
    __IO uint32_t NFEN4;
    uint32_t RESERVED4[4];
} stc_emb_ctl2_bit_t;

typedef struct {
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __I  uint32_t PWMSF;
    __I  uint32_t CMPF;
    __I  uint32_t SYSF;
    uint32_t RESERVED1[1];
    __I  uint32_t PWMST;
    __I  uint32_t CMPST;
    __I  uint32_t SYSST;
    __I  uint32_t PORTINF1;
    __I  uint32_t PORTINF2;
    __I  uint32_t PORTINF3;
    __I  uint32_t PORTINF4;
    uint32_t RESERVED2[2];
    __I  uint32_t PORTINST1;
    __I  uint32_t PORTINST2;
    __I  uint32_t PORTINST3;
    __I  uint32_t PORTINST4;
    uint32_t RESERVED3[14];
} stc_emb_stat_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __O  uint32_t PWMSFCLR;
    __O  uint32_t CMPFCLR;
    __O  uint32_t SYSFCLR;
    uint32_t RESERVED1[4];
    __O  uint32_t PORTINFCLR1;
    __O  uint32_t PORTINFCLR2;
    __O  uint32_t PORTINFCLR3;
    __O  uint32_t PORTINFCLR4;
    uint32_t RESERVED2[20];
} stc_emb_statclr_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t SYSINTEN;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTININTEN1;
    __IO uint32_t PORTININTEN2;
    __IO uint32_t PORTININTEN3;
    __IO uint32_t PORTININTEN4;
    uint32_t RESERVED2[20];
} stc_emb_inten_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMRSEL;
    __IO uint32_t CMPRSEL;
    __IO uint32_t SYSRSEL;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINRSEL1;
    __IO uint32_t PORTINRSEL2;
    __IO uint32_t PORTINRSEL3;
    __IO uint32_t PORTINRSEL4;
    uint32_t RESERVED2[20];
} stc_emb_rlssel_bit_t;

typedef struct {
    __O  uint32_t SET;
    __O  uint32_t CLR;
    uint32_t RESERVED0[14];
    __IO uint32_t CTE;
    uint32_t RESERVED1[15];
} stc_ermu_eoc_bit_t;

typedef struct {
    __O  uint32_t EOS;
    uint32_t RESERVED0[15];
    __I  uint32_t CTS;
    uint32_t RESERVED1[15];
} stc_ermu_eos_bit_t;

typedef struct {
    __IO uint32_t TTE;
    uint32_t RESERVED0[31];
} stc_ermu_eottc_bit_t;

typedef struct {
    __IO uint32_t WTE;
    uint32_t RESERVED0[15];
    __O  uint32_t STP;
    uint32_t RESERVED1[15];
} stc_ermu_wtc_bit_t;

typedef struct {
    __I  uint32_t WTS;
    uint32_t RESERVED0[31];
} stc_ermu_wts_bit_t;

typedef struct {
    __IO uint32_t LPISE;
    uint32_t RESERVED0[15];
    __IO uint32_t HPISE;
    uint32_t RESERVED1[15];
} stc_ermu_wtse_bit_t;

typedef struct {
    __IO uint32_t PSE;
    uint32_t RESERVED0[31];
} stc_ermu_ccps_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t DC;
    uint32_t RESERVED1[2];
    __IO uint32_t ACS;
    uint32_t RESERVED2[1];
    __IO uint32_t DRTY;
    __IO uint32_t IPCO;
    __IO uint32_t DM;
    __IO uint32_t LM;
    __IO uint32_t DO;
    __IO uint32_t FES;
    uint32_t RESERVED3[1];
    __IO uint32_t DCRS;
    uint32_t RESERVED4[5];
    __IO uint32_t MJB;
    __IO uint32_t MWD;
    uint32_t RESERVED5[1];
    __IO uint32_t CST;
    uint32_t RESERVED6[6];
} stc_eth_mac_configr_bit_t;

typedef struct {
    __IO uint32_t PR;
    __IO uint32_t HUC;
    __IO uint32_t HMC;
    __IO uint32_t DAIF;
    __IO uint32_t PMF;
    __IO uint32_t DBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SAIF;
    __IO uint32_t SAF;
    __IO uint32_t HPF;
    uint32_t RESERVED1[5];
    __IO uint32_t VTFE;
    uint32_t RESERVED2[3];
    __IO uint32_t IPFE;
    __IO uint32_t DNTU;
    uint32_t RESERVED3[9];
    __IO uint32_t RA;
} stc_eth_mac_fltctlr_bit_t;

