levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    __IO uint32_t EMPUBRP;
    __IO uint32_t EMPUBWP;
    uint32_t RESERVED0[5];
    __IO uint32_t EMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_ecr_bit_t;

typedef struct {
    __IO uint32_t OTSST;
    __IO uint32_t OTSCK;
    __IO uint32_t OTSIE;
    __IO uint32_t TSSTP;
    uint32_t RESERVED0[12];
} stc_ots_ctl_bit_t;

typedef struct {
    __IO uint32_t USBFS_DFB;
    __IO uint32_t USBFS_SOFEN;
    uint32_t RESERVED0[6];
    __IO uint32_t USBHS_DFB;
    __IO uint32_t USBHS_SOFEN;
    __IO uint32_t USBHS_FSPHYE;
    uint32_t RESERVED1[7];
    __IO uint32_t USBFS_NFE;
    uint32_t RESERVED2[7];
    __IO uint32_t USBHS_NFE;
    uint32_t RESERVED3[5];
} stc_peric_usb_syctlreg_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t SELMMC1;
    uint32_t RESERVED1[1];
    __IO uint32_t SELMMC2;
    uint32_t RESERVED2[28];
} stc_peric_sdioc_syctlreg_bit_t;

typedef struct {
    __IO uint32_t OPENP;
    uint32_t RESERVED0[31];
} stc_peric_nfc_stcr_bit_t;

typedef struct {
    __IO uint32_t DMCEN;
    __IO uint32_t SMCEN;
    __IO uint32_t NFCEN;
    uint32_t RESERVED0[29];
} stc_peric_exmc_enar_bit_t;

typedef struct {
    __IO uint32_t IFSEL;
    uint32_t RESERVED0[3];
    __IO uint32_t RCKINV;
    __IO uint32_t TCKINV;
    uint32_t RESERVED1[26];
} stc_peric_eth_mac_ifconfr_bit_t;

typedef struct {
    __IO uint32_t TMR0_1_A;
    __IO uint32_t TMR0_1_B;
    __IO uint32_t TMR0_2_A;
    __IO uint32_t TMR0_2_B;
    __IO uint32_t TMR0_3_A;
    __IO uint32_t TMR0_3_B;
    __IO uint32_t TMR0_4_A;
    __IO uint32_t TMR0_4_B;
    __IO uint32_t TMR0_5_A;
    __IO uint32_t TMR0_5_B;
    uint32_t RESERVED0[6];
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    uint32_t RESERVED1[5];
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
} stc_peric_tmr_synenr1_bit_t;

typedef struct {
    __IO uint32_t CAN1FDE;
    __IO uint32_t CAN2FDE;
    uint32_t RESERVED0[30];
} stc_peric_can_syctlreg_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED1[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __I  uint32_t PECC;
    uint32_t RESERVED1[23];
} stc_peric_nfc_stsr_bit_t;

typedef struct {
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
    uint32_t RESERVED0[4];
    __IO uint32_t TMR2_1_A;
    __IO uint32_t TMR2_1_B;
    __IO uint32_t TMR2_2_A;
    __IO uint32_t TMR2_2_B;
    __IO uint32_t TMR2_3_A;
    __IO uint32_t TMR2_3_B;
    __IO uint32_t TMR2_4_A;
    __IO uint32_t TMR2_4_B;
    uint32_t RESERVED1[8];
} stc_peric_tmr_synenr2_bit_t;

typedef struct {
    __IO uint32_t RAM_1ERR;
    __IO uint32_t RAM_2ERR;
    uint32_t RESERVED0[30];
} stc_pke_ram0_cksr_bit_t;

typedef struct {
    __IO uint32_t EIEN;
    uint32_t RESERVED0[31];
} stc_pke_ram0_eien_bit_t;

typedef struct {
    __IO uint32_t RAM_1ERR;
    __IO uint32_t RAM_2ERR;
    uint32_t RESERVED0[30];
} stc_pke_ram1_cksr_bit_t;

typedef struct {
    __IO uint32_t EIEN;
    uint32_t RESERVED0[31];
} stc_pke_ram1_eien_bit_t;

typedef struct {
    __IO uint32_t START;
    uint32_t RESERVED0[31];
} stc_pke_ctrl_bit_t;

typedef struct {
    __IO uint32_t CORE_RIS;
    uint32_t RESERVED0[31];
} stc_pke_risr_bit_t;

typedef struct {
    __IO uint32_t CORE_IRQEN;
    uint32_t RESERVED0[31];
} stc_pke_imcr_bit_t;

typedef struct {
    __I  uint32_t CORE_MI;
    uint32_t RESERVED0[31];
} stc_pke_misr_bit_t;

typedef struct {
    __IO uint32_t IAFF_R0;
    __IO uint32_t IMON_R0;
    __IO uint32_t IAFF_R1;
    __IO uint32_t IMON_R1;
    __IO uint32_t OAFF;
    __I  uint32_t OMON;
    uint32_t RESERVED0[26];
} stc_pke_exe_cfg_bit_t;

typedef struct {
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM1;
    __IO uint32_t SRAM2;
    __IO uint32_t SRAM3;
    __IO uint32_t SRAM4;
    __IO uint32_t ERMU;
    uint32_t RESERVED1[1];
    __IO uint32_t SRAMB;
    uint32_t RESERVED2[1];
    __IO uint32_t PKE;
    __IO uint32_t KEYSCAN;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t MAU;
    __IO uint32_t SKE;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_pwc_fcg0_bit_t;

typedef struct {
    __IO uint32_t CAN1;
    __IO uint32_t CAN2;
    __IO uint32_t ETHMAC;
    __IO uint32_t QSPI;
    __IO uint32_t I2C1;
    __IO uint32_t I2C2;
    __IO uint32_t I2C3;
    __IO uint32_t I2C4;
    __IO uint32_t I2C5;
    __IO uint32_t I2C6;
    __IO uint32_t SDIOC1;
    __IO uint32_t SDIOC2;
    __IO uint32_t I2S1;
    __IO uint32_t I2S2;
    __IO uint32_t I2S3;
    __IO uint32_t I2S4;
    __IO uint32_t SPI1;
    __IO uint32_t SPI2;
    __IO uint32_t SPI3;
    __IO uint32_t SPI4;
    __IO uint32_t SPI5;
    __IO uint32_t SPI6;
    __IO uint32_t USBFS;
    __IO uint32_t USBHS;
    __IO uint32_t FMAC1;
    __IO uint32_t FMAC2;
    __IO uint32_t FMAC3;
    __IO uint32_t FMAC4;
    __IO uint32_t MCAN1;
    __IO uint32_t MCAN2;
    uint32_t RESERVED0[2];
} stc_pwc_fcg1_bit_t;

typedef struct {
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    uint32_t RESERVED0[1];
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    __IO uint32_t TMR0_3;
    __IO uint32_t EMB;
    __IO uint32_t TMR2_1;
    __IO uint32_t TMR2_2;
    __IO uint32_t TMR2_3;
    __IO uint32_t TMR2_4;
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
} stc_pwc_fcg2_bit_t;

