levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    __IO uint32_t CMBIAS;
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED0[2];
    __IO uint32_t CMP12;
    __IO uint32_t CMP34;
    __IO uint32_t TMR0_4;
    __IO uint32_t TMR0_5;
    __IO uint32_t OTS;
    uint32_t RESERVED1[2];
    __IO uint32_t DVP;
    __IO uint32_t SMC;
    __IO uint32_t DMC;
    __IO uint32_t NFC;
    uint32_t RESERVED2[1];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    __IO uint32_t USART5;
    __IO uint32_t USART6;
    __IO uint32_t USART7;
    __IO uint32_t USART8;
    __IO uint32_t USART9;
    __IO uint32_t USART10;
    uint32_t RESERVED3[2];
} stc_pwc_fcg3_bit_t;

typedef struct {
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct {
    __IO uint32_t VBTRSD;
    __IO uint32_t RAMVALID;
    __IO uint32_t RAMPDF;
    __IO uint32_t VBATDIVMONE;
    uint32_t RESERVED0[3];
    __IO uint32_t CSDIS;
} stc_pwc_vbatcr_bit_t;

typedef struct {
    __I  uint32_t VBATPORF;
    uint32_t RESERVED0[7];
} stc_pwc_vbatporf_bit_t;

typedef struct {
    __IO uint32_t VBATPORFCLR;
    uint32_t RESERVED0[7];
} stc_pwc_vbatporfclr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t WKOVF;
    uint32_t RESERVED1[2];
    __IO uint32_t WKTCE;
} stc_pwc_wktc2_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t VHRCSD;
    __IO uint32_t PDTS;
    uint32_t RESERVED1[4];
} stc_pwc_pwrc1_bit_t;

typedef struct {
    __IO uint32_t VBATREFSEL;
    __IO uint32_t VBATME;
    uint32_t RESERVED0[2];
    __IO uint32_t VBATMON;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFS;
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct {
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct {
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

typedef struct {
    __IO uint32_t PVD1NFDIS;
    uint32_t RESERVED0[3];
    __IO uint32_t PVD2NFDIS;
    uint32_t RESERVED1[3];
} stc_pwc_pvdfcr_bit_t;

typedef struct {
    __IO uint32_t WKE00;
    __IO uint32_t WKE01;
    __IO uint32_t WKE02;
    __IO uint32_t WKE03;
    __IO uint32_t WKE10;
    __IO uint32_t WKE11;
    __IO uint32_t WKE12;
    __IO uint32_t WKE13;
} stc_pwc_pdwke0_bit_t;

typedef struct {
    __IO uint32_t WKE20;
    __IO uint32_t WKE21;
    __IO uint32_t WKE22;
    __IO uint32_t WKE23;
    __IO uint32_t WKE30;
    __IO uint32_t WKE31;
    __IO uint32_t WKE32;
    __IO uint32_t WKE33;
} stc_pwc_pdwke1_bit_t;

typedef struct {
    __IO uint32_t VD1WKE;
    __IO uint32_t VD2WKE;
    uint32_t RESERVED0[2];
    __IO uint32_t RTCPRDWKE;
    __IO uint32_t RTCALMWKE;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKE;
} stc_pwc_pdwke2_bit_t;

typedef struct {
    __IO uint32_t WK0EGS;
    __IO uint32_t WK1EGS;
    __IO uint32_t WK2EGS;
    __IO uint32_t WK3EGS;
    __IO uint32_t VD1EGS;
    __IO uint32_t VD2EGS;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkes_bit_t;

typedef struct {
    __IO uint32_t PTWK0F;
    __IO uint32_t PTWK1F;
    __IO uint32_t PTWK2F;
    __IO uint32_t PTWK3F;
    __IO uint32_t VD1WKF;
    __IO uint32_t VD2WKF;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkf0_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RXD0WKF;
    __IO uint32_t RTCPRDWKF;
    __IO uint32_t RTCALMWKF;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKF;
} stc_pwc_pdwkf1_bit_t;

typedef struct {
    __IO uint32_t RAMPDC0;
    __IO uint32_t RAMPDC1;
    __IO uint32_t RAMPDC2;
    __IO uint32_t RAMPDC3;
    __IO uint32_t RAMPDC4;
    __IO uint32_t RAMPDC5;
    __IO uint32_t RAMPDC6;
    __IO uint32_t RAMPDC7;
    __IO uint32_t RAMPDC8;
    __IO uint32_t RAMPDC9;
    __IO uint32_t RAMPDC10;
    uint32_t RESERVED0[21];
} stc_pwc_rampc0_bit_t;

typedef struct {
    __IO uint32_t PRAMPDC0;
    __IO uint32_t PRAMPDC1;
    __IO uint32_t PRAMPDC2;
    __IO uint32_t PRAMPDC3;
    __IO uint32_t PRAMPDC4;
    __IO uint32_t PRAMPDC5;
    __IO uint32_t PRAMPDC6;
    __IO uint32_t PRAMPDC7;
    __IO uint32_t PRAMPDC8;
    __IO uint32_t PRAMPDC9;
    __IO uint32_t PRAMPDC10;
    __IO uint32_t PRAMPDC11;
    uint32_t RESERVED0[20];
} stc_pwc_pramlpc_bit_t;

typedef struct {
    __I  uint32_t LPMF;
    uint32_t RESERVED0[15];
} stc_pwc_lpmcsr_bit_t;

typedef struct {
    __IO uint32_t LPMFC;
    uint32_t RESERVED0[15];
} stc_pwc_lpmcscr_bit_t;

typedef struct {
    __IO uint32_t PVD1NMIS;
    uint32_t RESERVED0[3];
    __IO uint32_t PVD2NMIS;
    uint32_t RESERVED1[3];
} stc_pwc_pvdicr_bit_t;

typedef struct {
    __IO uint32_t PVD1MON;
    __IO uint32_t PVD1DETFLG;
    uint32_t RESERVED0[2];
    __IO uint32_t PVD2MON;
    __IO uint32_t PVD2DETFLG;
    uint32_t RESERVED1[2];
} stc_pwc_pvddsr_bit_t;

typedef struct {
    __IO uint32_t FLNWT;
    __IO uint32_t CKSMRC;
    uint32_t RESERVED0[12];
    __IO uint32_t EXBUSOE;
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

typedef struct {
    __IO uint32_t FPRCB0;
    __IO uint32_t FPRCB1;
    __IO uint32_t FPRCB2;
    __IO uint32_t FPRCB3;
    uint32_t RESERVED0[12];
} stc_pwc_fprc_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t ERMU;
    uint32_t RESERVED1[3];
    __IO uint32_t PKE;
    __IO uint32_t KEYSCAN;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t MAU;
    __IO uint32_t SKE;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_rmu_frst0_bit_t;

