levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_dac_dacr_bit_t                       DACR_b;
    stc_dac_daadpcr_bit_t                    DAADPCR_b;
    uint32_t                                 RESERVED1[160];
    stc_dac_daocr_bit_t                      DAOCR_b;
} bCM_DAC_TypeDef;

typedef struct {
    stc_dcu_ctl_bit_t                        CTL_b;
    stc_dcu_flag_bit_t                       FLAG_b;
    uint32_t                                 RESERVED0[96];
    stc_dcu_flagclr_bit_t                    FLAGCLR_b;
    stc_dcu_intevtsel_bit_t                  INTEVTSEL_b;
} bCM_DCU_TypeDef;

typedef struct {
    stc_dma_en_bit_t                         EN_b;
    stc_dma_intstat0_bit_t                   INTSTAT0_b;
    stc_dma_intstat1_bit_t                   INTSTAT1_b;
    stc_dma_intmask0_bit_t                   INTMASK0_b;
    stc_dma_intmask1_bit_t                   INTMASK1_b;
    stc_dma_intclr0_bit_t                    INTCLR0_b;
    stc_dma_intclr1_bit_t                    INTCLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_dma_reqstat_bit_t                    REQSTAT_b;
    stc_dma_chstat_bit_t                     CHSTAT_b;
    uint32_t                                 RESERVED1[32];
    stc_dma_rcfgctl_bit_t                    RCFGCTL_b;
    stc_dma_swreq_bit_t                      SWREQ_b;
    uint32_t                                 RESERVED2[320];
    stc_dma_chctl_bit_t                      CHCTL0_b;
    uint32_t                                 RESERVED3[480];
    stc_dma_chctl_bit_t                      CHCTL1_b;
    uint32_t                                 RESERVED4[480];
    stc_dma_chctl_bit_t                      CHCTL2_b;
    uint32_t                                 RESERVED5[480];
    stc_dma_chctl_bit_t                      CHCTL3_b;
    uint32_t                                 RESERVED6[480];
    stc_dma_chctl_bit_t                      CHCTL4_b;
    uint32_t                                 RESERVED7[480];
    stc_dma_chctl_bit_t                      CHCTL5_b;
    uint32_t                                 RESERVED8[480];
    stc_dma_chctl_bit_t                      CHCTL6_b;
    uint32_t                                 RESERVED9[480];
    stc_dma_chctl_bit_t                      CHCTL7_b;
} bCM_DMA_TypeDef;

typedef struct {
    stc_dvp_ctr_bit_t                        CTR_b;
    uint32_t                                 RESERVED0[32];
    stc_dvp_str_bit_t                        STR_b;
    stc_dvp_ier_bit_t                        IER_b;
} bCM_DVP_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[160];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    stc_efm_fswp_bit_t                       FSWP_b;
    stc_efm_frmc2_bit_t                      FRMC2_b;
    uint32_t                                 RESERVED1[128];
    stc_efm_chipsel_bit_t                    CHIPSEL_b;
    uint32_t                                 RESERVED2[1504];
    stc_efm_mmf_remcr_bit_t                  MMF_REMCR0_b;
    stc_efm_mmf_remcr_bit_t                  MMF_REMCR1_b;
    uint32_t                                 RESERVED3[1056];
    stc_efm_f0nwprt0_bit_t                   F0NWPRT0_b;
    stc_efm_f0nwprt1_bit_t                   F0NWPRT1_b;
    stc_efm_f0nwprt2_bit_t                   F0NWPRT2_b;
    stc_efm_f0nwprt3_bit_t                   F0NWPRT3_b;
    stc_efm_f1nwprt0_bit_t                   F1NWPRT0_b;
    stc_efm_f1nwprt1_bit_t                   F1NWPRT1_b;
    stc_efm_f1nwprt2_bit_t                   F1NWPRT2_b;
    stc_efm_f1nwprt3_bit_t                   F1NWPRT3_b;
    uint32_t                                 RESERVED4[3328];
    stc_efm_ckcr_bit_t                       CKCR_b;
    stc_efm_ckpr_bit_t                       CKPR_b;
    stc_efm_cksr_bit_t                       CKSR_b;
    stc_efm_eien_bit_t                       EIEN_b;
    uint32_t                                 RESERVED5[128];
    stc_efm_f0ecccr_bit_t                    F0ECCCR_b;
    uint32_t                                 RESERVED6[32];
    stc_efm_f0err0_bit_t                     F0ERR0_b;
    stc_efm_f0err1_bit_t                     F0ERR1_b;
    uint32_t                                 RESERVED7[384];
    stc_efm_f1ecccr_bit_t                    F1ECCCR_b;
    uint32_t                                 RESERVED8[32];
    stc_efm_f1err0_bit_t                     F1ERR0_b;
    stc_efm_f1err1_bit_t                     F1ERR1_b;
} bCM_EFM_TypeDef;

typedef struct {
    stc_emb_ctl1_bit_t                       CTL1_b;
    stc_emb_ctl2_bit_t                       CTL2_b;
    stc_emb_soe_bit_t                        SOE_b;
    stc_emb_stat_bit_t                       STAT_b;
    stc_emb_statclr_bit_t                    STATCLR_b;
    stc_emb_inten_bit_t                      INTEN_b;
    stc_emb_rlssel_bit_t                     RLSSEL_b;
} bCM_EMB_TypeDef;

typedef struct {
    stc_ermu_eoc_bit_t                       EO0C_b;
    stc_ermu_eos_bit_t                       EO0S_b;
    uint32_t                                 RESERVED0[64];
    stc_ermu_eottc_bit_t                     EO0TTC_b;
    uint32_t                                 RESERVED1[864];
    stc_ermu_eoc_bit_t                       EO1C_b;
    stc_ermu_eos_bit_t                       EO1S_b;
    uint32_t                                 RESERVED2[64];
    stc_ermu_eottc_bit_t                     EO1TTC_b;
    uint32_t                                 RESERVED3[864];
    stc_ermu_eoc_bit_t                       EO2C_b;
    stc_ermu_eos_bit_t                       EO2S_b;
    uint32_t                                 RESERVED4[64];
    stc_ermu_eottc_bit_t                     EO2TTC_b;
    uint32_t                                 RESERVED5[864];
    stc_ermu_eoc_bit_t                       EO3C_b;
    stc_ermu_eos_bit_t                       EO3S_b;
    uint32_t                                 RESERVED6[64];
    stc_ermu_eottc_bit_t                     EO3TTC_b;
    uint32_t                                 RESERVED7[864];
    stc_ermu_wtc_bit_t                       WT0C_b;
    stc_ermu_wts_bit_t                       WT0S_b;
    uint32_t                                 RESERVED8[64];
    stc_ermu_wtse_bit_t                      WT0SE_b;
    uint32_t                                 RESERVED9[96];
    stc_ermu_wtc_bit_t                       WT1C_b;
    stc_ermu_wts_bit_t                       WT1S_b;
    uint32_t                                 RESERVED10[64];
    stc_ermu_wtse_bit_t                      WT1SE_b;
    uint32_t                                 RESERVED11[96];
    stc_ermu_wtc_bit_t                       WT2C_b;
    stc_ermu_wts_bit_t                       WT2S_b;
    uint32_t                                 RESERVED12[64];
    stc_ermu_wtse_bit_t                      WT2SE_b;
    uint32_t                                 RESERVED13[96];
    stc_ermu_wtc_bit_t                       WT3C_b;
    stc_ermu_wts_bit_t                       WT3S_b;
    uint32_t                                 RESERVED14[64];
    stc_ermu_wtse_bit_t                      WT3SE_b;
    uint32_t                                 RESERVED15[7264];
    stc_ermu_ccps_bit_t                      CCPS_b;
} bCM_ERMU_TypeDef;

