levizh/hc32f4a8_ddl_rtt/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a8.h
typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_mcanram_cksr_bit_t                   CKSR_b;
    stc_mcanram_eien_bit_t                   EIEN_b;
} bCM_MCANRAM_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[512];
    stc_mpu_sr_bit_t                         SR_b;
    stc_mpu_eclr_bit_t                       ECLR_b;
    stc_mpu_wp_bit_t                         WP_b;
    stc_mpu_ippr_bit_t                       IPPR_b;
    stc_mpu_srge_bit_t                       S1RGE_b;
    stc_mpu_srgwp_bit_t                      S1RGWP_b;
    stc_mpu_srgrp_bit_t                      S1RGRP_b;
    stc_mpu_scr_bit_t                        S1CR_b;
    stc_mpu_srge_bit_t                       S2RGE_b;
    stc_mpu_srgwp_bit_t                      S2RGWP_b;
    stc_mpu_srgrp_bit_t                      S2RGRP_b;
    stc_mpu_scr_bit_t                        S2CR_b;
    stc_mpu_frge_bit_t                       FRGE_b;
    stc_mpu_frgwp_bit_t                      FRGWP_b;
    stc_mpu_frgrp_bit_t                      FRGRP_b;
    stc_mpu_fcr_bit_t                        FCR_b;
    stc_mpu_hrge_bit_t                       HRGE_b;
    stc_mpu_hrgwp_bit_t                      HRGWP_b;
    stc_mpu_hrgrp_bit_t                      HRGRP_b;
    stc_mpu_hcr_bit_t                        HCR_b;
    stc_mpu_erge_bit_t                       ERGE_b;
    stc_mpu_ergwp_bit_t                      ERGWP_b;
    stc_mpu_ergrp_bit_t                      ERGRP_b;
    stc_mpu_ecr_bit_t                        ECR_b;
} bCM_MPU_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1904640];
    stc_ots_ctl_bit_t                        CTL_b;
} bCM_OTS_TypeDef;

typedef struct {
    stc_peric_usb_syctlreg_bit_t             USB_SYCTLREG_b;
    stc_peric_sdioc_syctlreg_bit_t           SDIOC_SYCTLREG_b;
    stc_peric_nfc_stcr_bit_t                 NFC_STCR_b;
    stc_peric_exmc_enar_bit_t                EXMC_ENAR_b;
    stc_peric_eth_mac_ifconfr_bit_t          ETH_MAC_IFCONFR_b;
    stc_peric_tmr_synenr1_bit_t              TMR_SYNENR1_b;
    stc_peric_can_syctlreg_bit_t             CAN_SYCTLREG_b;
    stc_peric_usart1_nfc_bit_t               USART1_NFC_b;
    uint32_t                                 RESERVED0[64];
    stc_peric_nfc_stsr_bit_t                 NFC_STSR_b;
    uint32_t                                 RESERVED1[160];
    stc_peric_tmr_synenr2_bit_t              TMR_SYNENR2_b;
} bCM_PERIC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_pke_ram0_cksr_bit_t                  RAM0_CKSR_b;
    stc_pke_ram0_eien_bit_t                  RAM0_EIEN_b;
    uint32_t                                 RESERVED1[192];
    stc_pke_ram1_cksr_bit_t                  RAM1_CKSR_b;
    stc_pke_ram1_eien_bit_t                  RAM1_EIEN_b;
    uint32_t                                 RESERVED2[32416];
    stc_pke_ctrl_bit_t                       CTRL_b;
    uint32_t                                 RESERVED3[64];
    stc_pke_risr_bit_t                       RISR_b;
    stc_pke_imcr_bit_t                       IMCR_b;
    stc_pke_misr_bit_t                       MISR_b;
    uint32_t                                 RESERVED4[448];
    stc_pke_exe_cfg_bit_t                    EXE_CFG_b;
} bCM_PKE_TypeDef;

typedef struct {
    stc_pwc_fcg0_bit_t                       FCG0_b;
    stc_pwc_fcg1_bit_t                       FCG1_b;
    stc_pwc_fcg2_bit_t                       FCG2_b;
    stc_pwc_fcg3_bit_t                       FCG3_b;
    stc_pwc_fcg0pc_bit_t                     FCG0PC_b;
    uint32_t                                 RESERVED0[139616];
    stc_pwc_vbatcr_bit_t                     VBATCR_b;
    uint32_t                                 RESERVED1[56];
    stc_pwc_vbatporf_bit_t                   VBATPORF_b;
    uint32_t                                 RESERVED2[24];
    stc_pwc_vbatporfclr_bit_t                VBATPORFCLR_b;
    uint32_t                                 RESERVED3[88];
    stc_pwc_wktc2_bit_t                      WKTC2_b;
    uint32_t                                 RESERVED4[15672];
    stc_pwc_pwrc0_bit_t                      PWRC0_b;
    uint32_t                                 RESERVED5[24];
    stc_pwc_pwrc1_bit_t                      PWRC1_b;
    uint32_t                                 RESERVED6[88];
    stc_pwc_pwrc4_bit_t                      PWRC4_b;
    uint32_t                                 RESERVED7[24];
    stc_pwc_pvdcr0_bit_t                     PVDCR0_b;
    uint32_t                                 RESERVED8[24];
    stc_pwc_pvdcr1_bit_t                     PVDCR1_b;
    uint32_t                                 RESERVED9[24];
    stc_pwc_pvdfcr_bit_t                     PVDFCR_b;
    uint32_t                                 RESERVED10[88];
    stc_pwc_pdwke0_bit_t                     PDWKE0_b;
    uint32_t                                 RESERVED11[24];
    stc_pwc_pdwke1_bit_t                     PDWKE1_b;
    uint32_t                                 RESERVED12[24];
    stc_pwc_pdwke2_bit_t                     PDWKE2_b;
    uint32_t                                 RESERVED13[24];
    stc_pwc_pdwkes_bit_t                     PDWKES_b;
    uint32_t                                 RESERVED14[24];
    stc_pwc_pdwkf0_bit_t                     PDWKF0_b;
    uint32_t                                 RESERVED15[24];
    stc_pwc_pdwkf1_bit_t                     PDWKF1_b;
    uint32_t                                 RESERVED16[1304];
    stc_pwc_rampc0_bit_t                     RAMPC0_b;
    uint32_t                                 RESERVED17[32];
    stc_pwc_pramlpc_bit_t                    PRAMLPC_b;
    stc_pwc_lpmcsr_bit_t                     LPMCSR_b;
    stc_pwc_lpmcscr_bit_t                    LPMCSCR_b;
    stc_pwc_pvdicr_bit_t                     PVDICR_b;
    uint32_t                                 RESERVED18[24];
    stc_pwc_pvddsr_bit_t                     PVDDSR_b;
    uint32_t                                 RESERVED19[235704];
    stc_pwc_stpmcr_bit_t                     STPMCR_b;
    uint32_t                                 RESERVED20[8064];
    stc_pwc_fprc_bit_t                       FPRC_b;
} bCM_PWC_TypeDef;

